{
    "intents": [
        {
            "tag": "bsc_agriculture_requirements",
            "patterns": [
                "What are the requirements for BSc. Agriculture?",
                "Can you provide the admission criteria for BSc. Agriculture?",
                "Requirements for BSc. Agriculture programme?",
                "What are the prerequisites for BSc. Agriculture?",
                "BSc. Agriculture admission requirements?",
                "Information on eligibility for BSc. Agriculture programme?",
                "What are the entry requirements for BSc. Agriculture programme?",
                "Criteria for admission into BSc. Agriculture?",
                "BSc. Agriculture programme prerequisites?",
                "admission requirement for agriculture science",
                "What are the academic requirements for BSc. Agriculture?",
                "Can you outline the admission criteria for BSc. Agriculture?",
                "What do I need to apply for BSc. Agriculture?",
                "What qualifications are necessary for BSc. Agriculture?",
                "What are the subject requirements for BSc. Agriculture?",
                "What grades do I need for BSc. Agriculture?",
                "What are the eligibility criteria for BSc. Agriculture?",
                "Can you list the entry requirements for BSc. Agriculture?",
                "What do I need to qualify for BSc. Agriculture?",
                "What are the WASSCE requirements for BSc. Agriculture?",
                "What are the GCE requirements for BSc. Agriculture?",
                "What are the mature entry requirements for BSc. Agriculture?",
                "What subjects do I need to study BSc. Agriculture?",
                "Can you explain the prerequisites for BSc. Agriculture?",
                "What electives are needed for BSc. Agriculture?",
                "Do I need Chemistry for BSc. Agriculture?",
                "Is Biology required for BSc. Agriculture?",
                "What science subjects are needed for BSc. Agriculture?",
                "What are the mandatory subjects for BSc. Agriculture?",
                "What qualifications must I have for BSc. Agriculture?",
                "Can you detail the entry criteria for BSc. Agriculture?",
                "What are the core subjects for BSc. Agriculture?",
                "What elective subjects are accepted for BSc. Agriculture?",
                "What are the application requirements for BSc. Agriculture?",
                "What qualifications are needed to study BSc. Agriculture?",
                "What are the academic criteria for BSc. Agriculture?",
                "What are the necessary requirements for BSc. Agriculture?",
                "What subjects must I pass to apply for BSc. Agriculture?",
                "Do I need Integrated Science for BSc. Agriculture?",
                "Are there specific subject combinations for BSc. Agriculture?",
                "Can I apply for BSc. Agriculture with a Diploma?",
                "Do I need to pass an interview for BSc. Agriculture?",
                "Is there an entrance exam for BSc. Agriculture?",
                "What are the age requirements for mature applicants for BSc. Agriculture?",
                "Can I apply for BSc. Agriculture with an HND?",
                "What are the 'A' Level requirements for BSc. Agriculture?",
                "What 'O' Level subjects are needed for BSc. Agriculture?",
                "What post-qualification experience is required for mature applicants for BSc. Agriculture?",
                "Do I need a science background for BSc. Agriculture?",
                "Can I apply for BSc. Agriculture with Agricultural Science?",
                "What qualifications do mature applicants need for BSc. Agriculture?",
                "What are the entry requirements for mature students for BSc. Agriculture?",
                "Do I need a pass in Mathematics for BSc. Agriculture?",
                "What are the entry requirements for SSSCE holders for BSc. Agriculture?",
                "Can you list the subjects needed for BSc. Agriculture?",
                "What qualifications do I need for BSc. Agriculture?",
                "Are there any special requirements for BSc. Agriculture?",
                "What are the requirements for direct entry into BSc. Agriculture?",
                "What qualifications do I need to meet for BSc. Agriculture?",
                "What are the admission criteria for mature applicants for BSc. Agriculture?"
            ],
            "responses": [
                "Here are the requirements for BSc. Agriculture <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:</b> Credit passes in Chemistry and any TWO (2) from Physics or Mathematics, Biology or General Agriculture or Animal Husbandry or Crop Husbandry or Horticulture. </p><br><li><b><u>GCE APPLICANTS </u></b></li><p><b>'O' Level:</b>  Credit passes in FIVE (5) subjects or equivalent qualification including English Language, Mathematics, AND, </p><p><b>'A' Level or equivalent:</b>  Credit passes in THREE (3) subjects or equivalent from  Chemistry, Physics or Mathematics, and Biology or Agricultural Science. </p><br><li><b><u>MATURE APPLICANTS</u></b></li><p>Applicants must have attained the age of 25 years at the time of submitting the Application Forms and must have a minimum of TWO (2) years post qualification experience. In addition, applicant must satisfy any of the following qualifications: </p><ul><li><b>Diploma or Higher National Diploma Applicants:</b> Diploma or Higher National Diploma in Agriculture or Agriculture-related programme from a recognized institution. OR </li><li><b>GCE Applicants:</b> Five (5) credits at 'O' Level including English Language and Mathematics, Biology, Chemistry and Physics, or Additional Mathematics, and Additional General Science. </li><li><b>WASSCE/SSSCE Applicants:</b> Credits passes in THREE (3) Elective subjects in Biology, Chemistry, and Physics or Mathematics or General Agriculture or Crop Husbandry or and Horticulture. </li></ul><br><i>Short-listed applicants may take an Entrance Examination and pass an interview. </i></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Agriculture Cutoff Points",
            "patterns": [
                "cutoff points for BSc Agriculture",
                "what is the minimum grade can i come with for agricultural engineering",
                "what is the minimum grade can i come with for bsc agriculture ?",
                "what is the minimum grade can i come with for agricultural engineering",
                "what is the minimum score can i come with for agricultural engineering",
                "BSc Agriculture cutoff points",
                "minimum score for BSc Agriculture",
                "required score for BSc Agriculture",
                "aggregate for BSc Agriculture",
                "what is the cutoff for BSc Agriculture",
                "cutoff marks for BSc Agriculture",
                "BSc Agriculture required marks",
                "what aggregate do I need for BSc Agriculture",
                "score needed for BSc Agriculture",
                "cutoff points for Agriculture",
                "aggregate requirements for Agriculture",
                "what were the cut-off aggregates for Agriculture",
                "what are the cut-off aggregates Agriculture",
                "What is the cutoff point for BSc Agriculture?",
                "Can you tell me the cutoff point for BSc Agriculture?",
                "Could you provide the cutoff point for BSc Agriculture?",
                "What's the cutoff score for BSc Agriculture?",
                "Do you know the cutoff for BSc Agriculture?",
                "How many points do I need for BSc Agriculture?",
                "What's the required aggregate for BSc Agriculture?",
                "What is the entry cutoff for BSc Agriculture?",
                "What score is needed for BSc Agriculture?",
                "What's the minimum score for BSc Agriculture?",
                "What's the admission cutoff for BSc Agriculture?",
                "How much do I need to score for BSc Agriculture?",
                "What's the cutoff mark for BSc Agriculture?",
                "How high does my score need to be for BSc Agriculture?",
                "What's the threshold for BSc Agriculture?",
                "What's the lowest score accepted for BSc Agriculture?",
                "How many points are required for BSc Agriculture?",
                "What's the point cutoff for BSc Agriculture?",
                "Can you tell me the score needed for BSc Agriculture?",
                "What is the cutoff point for entering BSc Agriculture?",
                "What's the required score for BSc Agriculture?",
                "What's the aggregate needed for BSc Agriculture?",
                "How many points to get into BSc Agriculture?",
                "What's the minimum aggregate for BSc Agriculture?",
                "What's the lowest mark accepted for BSc Agriculture?",
                "How many points are needed for BSc Agriculture?",
                "What's the cutoff score for getting into BSc Agriculture?",
                "How many points do I need to get into BSc Agriculture?",
                "What score do I need to enter BSc Agriculture?",
                "What's the entry score for BSc Agriculture?",
                "What's the minimum points for BSc Agriculture?",
                "What's the required points for BSc Agriculture?",
                "How much do I need to score to get into BSc Agriculture?",
                "What's the score requirement for BSc Agriculture?",
                "What's the point requirement for BSc Agriculture?",
                "What's the aggregate score for BSc Agriculture?",
                "How high does my aggregate need to be for BSc Agriculture?",
                "What's the minimum score requirement for BSc Agriculture?",
                "What's the minimum aggregate score for BSc Agriculture?",
                "What's the lowest score needed for BSc Agriculture?",
                "What score do I need for BSc Agriculture?",
                "What's the cutoff aggregate for BSc Agriculture?",
                "How many points to qualify for BSc Agriculture?",
                "What's the minimum required score for BSc Agriculture?",
                "What's the required cutoff for BSc Agriculture?",
                "What's the minimum threshold for BSc Agriculture?",
                "What's the admission score for BSc Agriculture?",
                "What's the required mark for BSc Agriculture?",
                "What's the lowest score requirement for BSc Agriculture?",
                "How many points are required to get into BSc Agriculture?",
                "What's the cutoff entry point for BSc Agriculture?",
                "How many points do I need to be accepted into BSc Agriculture?",
                "What's the minimum cutoff score for BSc Agriculture?",
                "What's the score needed for BSc Agriculture admission?",
                "What's the aggregate cutoff for BSc Agriculture?",
                "What's the required entry score for BSc Agriculture?",
                "How high must my score be for BSc Agriculture?",
                "What's the point aggregate for BSc Agriculture?",
                "What's the threshold score for BSc Agriculture?",
                "How much do I need to get into BSc Agriculture?",
                "What's the lowest score required for BSc Agriculture?",
                "What's the entry mark for BSc Agriculture?",
                "What's the required score to get into BSc Agriculture?",
                "What's the entry threshold for BSc Agriculture?",
                "What's the score cutoff for BSc Agriculture?",
                "How many points must I score for BSc Agriculture?",
                "What's the aggregate required for BSc Agriculture?",
                "What's the minimum points needed for BSc Agriculture?",
                "What's the minimum mark for BSc Agriculture?",
                "What's the lowest entry score for BSc Agriculture?",
                "What's the cutoff mark to get into BSc Agriculture?",
                "How high does my score have to be for BSc Agriculture?",
                "What's the minimum aggregate points for BSc Agriculture?",
                "What's the required entry aggregate for BSc Agriculture?",
                "How many points are needed to get into BSc Agriculture?",
                "What's the score threshold for BSc Agriculture?",
                "What's the aggregate to get into BSc Agriculture?",
                "What's the minimum score needed to get into BSc Agriculture?",
                "What's the minimum cutoff mark for BSc Agriculture?",
                "What's the lowest score to get into BSc Agriculture?",
                "What's the admission cutoff mark for BSc Agriculture?",
                "What's the minimum entry score for BSc Agriculture?",
                "What's the point cutoff for getting into BSc Agriculture?",
                "What's the lowest points needed for BSc Agriculture?",
                "What's the required cutoff points for BSc Agriculture?",
                "How much do I need to score to be accepted into BSc Agriculture?",
                "What's the lowest score accepted into BSc Agriculture?",
                "What's the required aggregate to get into BSc Agriculture?",
                "What's the cutoff for BSc Agriculture admission?",
                "How many points to be accepted into BSc Agriculture?",
                "What's the minimum points requirement for BSc Agriculture?",
                "What's the entry cutoff score for BSc Agriculture?",
                "What's the minimum points to get into BSc Agriculture?",
                "What's the required points to get into BSc Agriculture?",
                "What's the lowest score requirement for BSc Agriculture admission?",
                "What's the cutoff point requirement for BSc Agriculture?",
                "How high does my score need to be to get into BSc Agriculture?",
                "What's the minimum mark requirement for BSc Agriculture?",
                "How many points do I need to be eligible for BSc Agriculture?",
                "What's the required score for BSc Agriculture entry?",
                "What's the cutoff points for BSc Agriculture?",
                "What's the minimum threshold points for BSc Agriculture?",
                "What's the score requirement to get into BSc Agriculture?",
                "What's the minimum required points for BSc Agriculture?",
                "What's the admission score requirement for BSc Agriculture?",
                "What's the cutoff aggregate points for BSc Agriculture?",
                "How many points do I need to qualify for BSc Agriculture?",
                "What's the minimum entry points for BSc Agriculture?",
                "What's the required cutoff mark for BSc Agriculture?",
                "What's the lowest points requirement for BSc Agriculture?",
                "What's the cutoff score requirement for BSc Agriculture?",
                "How high must my aggregate be for BSc Agriculture?",
                "What's the score threshold for getting into BSc Agriculture?",
                "What's the lowest score needed to be accepted into BSc Agriculture?",
                "What's the entry points requirement for BSc Agriculture?",
                "What's the minimum score for getting into BSc Agriculture?",
                "What's the required entry points for BSc Agriculture?",
                "How many points to get accepted into BSc Agriculture?",
                "What's the minimum aggregate needed for BSc Agriculture?",
                "What's the cutoff entry score for BSc Agriculture?",
                "What's the required points to get into BSc Agriculture?",
                "What's the entry points for BSc Agriculture?",
                "How many points do I need to get accepted into BSc Agriculture?",
                "What's the minimum entry points for BSc Agriculture?",
                "What's the cutoff points requirement for BSc Agriculture?",
                "What's the minimum threshold score for BSc Agriculture?",
                "How many points do I need to get into BSc Agriculture?",
                "What's the score requirement for getting into BSc Agriculture?",
                "What's the minimum cutoff points for BSc Agriculture?",
                "What's the lowest aggregate required for BSc Agriculture?",
                "What's the points requirement for BSc Agriculture?",
                "How many points do I need to score for BSc Agriculture?",
                "What's the required cutoff aggregate for BSc Agriculture?",
                "What's the entry threshold points for BSc Agriculture?",
                "What's the minimum score to be accepted into BSc Agriculture?",
                "What's the cutoff points for entering BSc Agriculture?",
                "What's the minimum score required to get into BSc Agriculture?",
                "What's the required aggregate to be accepted into BSc Agriculture?",
                "What's the score cutoff for entering BSc Agriculture?",
                "What's the minimum points required for BSc Agriculture entry?",
                "How many points to get into BSc Agriculture?",
                "What's the score needed for getting into BSc Agriculture?",
                "What's the required cutoff aggregate points for BSc Agriculture?",
                "What's the minimum required aggregate for BSc Agriculture?",
                "How high must my points be for BSc Agriculture?",
                "What's the minimum cutoff aggregate for BSc Agriculture?",
                "What's the required points for getting into BSc Agriculture?",
                "What's the entry score requirement for BSc Agriculture?",
                "What's the lowest aggregate needed for BSc Agriculture?",
                "How many points to be eligible for BSc Agriculture?",
                "What's the required entry points for BSc Agriculture?",
                "What's the lowest score to be accepted into BSc Agriculture?",
                "What's the cutoff entry points for BSc Agriculture?"
            ],
            "responses": [
                "The cutoff points for BSc. Agriculture are typically around aggregate 22. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },


        {
            "tag": "bsc_agriculture_fees",
            "patterns": [
                "what is the fees for agriculture",
                "Can I know the amount I will pay for agriculture",
                "Can i pay the fees for agriculture in installment?",
                "When should i pay the fees for agriculture?",
                "Can i book for a hall before paying fees for agriculture",
                "How much are the fees for BSc. Agriculture?",
                "What are the tuition fees for BSc. Agriculture?",
                "How much do I need to pay for BSc. Agriculture?",
                "What is the cost of the BSc. Agriculture programme?",
                "Can you provide the fee details for BSc. Agriculture?",
                "What is the tuition cost for BSc. Agriculture?",
                "How much is the fee for studying Agriculture?",
                "What is the payment schedule for BSc. Agriculture fees?",
                "Do I have to pay the full fee for BSc. Agriculture upfront?",
                "What is the fee structure for BSc. Agriculture?",
                "Can I pay my BSc. Agriculture fees in installments?",
                "What are the fee payment options for BSc. Agriculture?",
                "How are the fees for BSc. Agriculture calculated?",
                "Are there any additional costs for BSc. Agriculture?",
                "What is the total cost of BSc. Agriculture for a year?",
                "Are there any extra fees for BSc. Agriculture?",
                "Can I get a breakdown of the BSc. Agriculture fees?",
                "What is the annual fee for BSc. Agriculture?",
                "How much does each semester cost for BSc. Agriculture?",
                "What are the miscellaneous fees for BSc. Agriculture?",
                "Are there any lab fees for BSc. Agriculture?",
                "What are the accommodation fees for BSc. Agriculture?",
                "How much are the hostel fees for BSc. Agriculture students?",
                "What is the fee for international students in BSc. Agriculture?",
                "Do international students pay higher fees for BSc. Agriculture?",
                "What is the fee for fee-paying students in BSc. Agriculture?",
                "Are there fee waivers for BSc. Agriculture?",
                "Are scholarships available to cover BSc. Agriculture fees?",
                "What are the financial aid options for BSc. Agriculture?",
                "How much should I budget for BSc. Agriculture fees?",
                "Is there a fee refund policy for BSc. Agriculture?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Agriculture?",
                "What is the refund policy for BSc. Agriculture fees?",
                "What is the deadline for paying BSc. Agriculture fees?",
                "Can I get a fee extension for BSc. Agriculture?",
                "What is the penalty for late payment of BSc. Agriculture fees?",
                "Can I pay BSc. Agriculture fees in multiple payments?",
                "Are there any hidden costs for BSc. Agriculture?",
                "What are the compulsory fees for BSc. Agriculture?",
                "Can I pay BSc. Agriculture fees with a payment plan?",
                "How often do I need to pay fees for BSc. Agriculture?",
                "What are the semester fees for BSc. Agriculture?",
                "Is there an application fee for BSc. Agriculture?",
                "What is the registration fee for BSc. Agriculture?",
                "Are the fees for BSc. Agriculture fixed or variable?",
                "What is the cost per credit hour for BSc. Agriculture?",
                "Are there any discounts available for BSc. Agriculture fees?",
                "Can I get a fee breakdown for BSc. Agriculture?",
                "What are the non-tuition fees for BSc. Agriculture?",
                "Are there any additional charges for BSc. Agriculture?",
                "How much is the acceptance fee for BSc. Agriculture?",
                "Can I book a hall without paying the BSc. Agriculture fees?",
                "What are the hostel booking requirements for BSc. Agriculture?",
                "When are the BSc. Agriculture fees due?",
                "What is the initial deposit for BSc. Agriculture fees?",
                "How do I pay my BSc. Agriculture fees online?",
                "Are there any late fees for BSc. Agriculture?",
                "What is the mode of payment for BSc. Agriculture fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Agriculture?",
                "How do I access my fee statement for BSc. Agriculture?",
                "What is the last date to pay fees for BSc. Agriculture?",
                "Is there an online payment option for BSc. Agriculture fees?",
                "What is the procedure for paying BSc. Agriculture fees?",
                "What is the tuition fee for the first year of BSc. Agriculture?",
                "Are there any financial aid options for BSc. Agriculture?",


                "What is included in the BSc. Agriculture fee?",
                "Can I get a fee waiver for BSc. Agriculture?"


            ],
            "responses": [
                "The fees for BSc. Agriculture programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },





        {
            "tag": "bsc_agricultural_biotechnology_requirements",
            "patterns": [
                "What are the requirements for BSc. Agricultural Biotechnology?",
                "Can you provide the admission criteria for BSc. Agricultural Biotechnology?",
                "Requirements for BSc. Agricultural Biotechnology programme?",
                "What are the prerequisites for BSc. Agricultural Biotechnology?",
                "BSc. Agricultural Biotechnology admission requirements?",
                "Information on eligibility for BSc. Agricultural Biotechnology programme?",
                "What are the entry requirements for BSc. Agricultural Biotechnology programme?",
                "Criteria for admission into BSc. Agricultural Biotechnology?",
                "BSc. Agricultural Biotechnology programme prerequisites?",
                "What are the requirements for BSc. Agricultural Biotechnology?",
                "What do I need to qualify for BSc. Agricultural Biotechnology?",
                "What qualifications are needed for BSc. Agricultural Biotechnology?",
                "What are the entry requirements for BSc. Agricultural Biotechnology?",
                "What are the admission requirements for BSc. Agricultural Biotechnology?",
                "What prerequisites are required for BSc. Agricultural Biotechnology?",
                "What are the academic requirements for BSc. Agricultural Biotechnology?",
                "What grades do I need for BSc. Agricultural Biotechnology?",
                "What subjects are required for BSc. Agricultural Biotechnology?",
                "What criteria do I need to meet for BSc. Agricultural Biotechnology?",
                "What qualifications must I have for BSc. Agricultural Biotechnology?",
                "What are the eligibility requirements for BSc. Agricultural Biotechnology?",
                "What academic qualifications are required for BSc. Agricultural Biotechnology?",
                "What educational background is needed for BSc. Agricultural Biotechnology?",
                "What high school subjects are required for BSc. Agricultural Biotechnology?",
                "What are the subject requirements for BSc. Agricultural Biotechnology?",
                "What qualifications do I need for BSc. Agricultural Biotechnology?",
                "What are the mandatory subjects for BSc. Agricultural Biotechnology?",
                "What qualifications should I have for BSc. Agricultural Biotechnology?",
                "What grades are needed for BSc. Agricultural Biotechnology?",
                "What entry qualifications are required for BSc. Agricultural Biotechnology?",
                "What are the course requirements for BSc. Agricultural Biotechnology?",
                "What qualifications are necessary for BSc. Agricultural Biotechnology?",
                "What do I need to study BSc. Agricultural Biotechnology?",
                "What qualifications do I need to pursue BSc. Agricultural Biotechnology?",
                "What are the minimum requirements for BSc. Agricultural Biotechnology?",
                "What credentials are required for BSc. Agricultural Biotechnology?",
                "What is needed to apply for BSc. Agricultural Biotechnology?",
                "What are the required subjects for BSc. Agricultural Biotechnology?",
                "What qualifications do I need to enroll in BSc. Agricultural Biotechnology?",
                "What are the academic prerequisites for BSc. Agricultural Biotechnology?",
                "What high school qualifications are needed for BSc. Agricultural Biotechnology?",
                "What requirements must be met for BSc. Agricultural Biotechnology?",
                "What are the admission criteria for BSc. Agricultural Biotechnology?",
                "What are the necessary qualifications for BSc. Agricultural Biotechnology?",
                "What are the educational requirements for BSc. Agricultural Biotechnology?",
                "What do I need to be eligible for BSc. Agricultural Biotechnology?",
                "What academic background is required for BSc. Agricultural Biotechnology?",
                "What prerequisites do I need for BSc. Agricultural Biotechnology?",
                "What qualifications are needed to apply for BSc. Agricultural Biotechnology?",
                "What qualifications do I need to get into BSc. Agricultural Biotechnology?",
                "What subjects do I need to study for BSc. Agricultural Biotechnology?",
                "What qualifications are needed to enroll in BSc. Agricultural Biotechnology?",
                "What are the qualification requirements for BSc. Agricultural Biotechnology?",
                "What subjects must I take for BSc. Agricultural Biotechnology?",
                "What grades do I need to get into BSc. Agricultural Biotechnology?",
                "What are the required qualifications for BSc. Agricultural Biotechnology?",
                "What educational qualifications are needed for BSc. Agricultural Biotechnology?",
                "What qualifications are required to study BSc. Agricultural Biotechnology?",
                "What requirements do I need to fulfill for BSc. Agricultural Biotechnology?",
                "What subjects should I have studied for BSc. Agricultural Biotechnology?",
                "What do I need to have to qualify for BSc. Agricultural Biotechnology?",
                "What subjects do I need to qualify for BSc. Agricultural Biotechnology?",
                "What qualifications do I need to meet for BSc. Agricultural Biotechnology?",
                "What qualifications must be met for BSc. Agricultural Biotechnology?",
                "What are the needed qualifications for BSc. Agricultural Biotechnology?",
                "What academic subjects are required for BSc. Agricultural Biotechnology?",
                "What requirements must I meet for BSc. Agricultural Biotechnology?",
                "What do I need to qualify for a BSc. in Agricultural Biotechnology?",
                "What grades are required for BSc. Agricultural Biotechnology?",
                "What academic credentials are needed for BSc. Agricultural Biotechnology?",
                "What subjects are necessary for BSc. Agricultural Biotechnology?",
                "What qualifications do I need for a BSc. in Agricultural Biotechnology?",
                "What educational qualifications must I have for BSc. Agricultural Biotechnology?",
                "What criteria must be met for BSc. Agricultural Biotechnology?",
                "What qualifications are necessary to study BSc. Agricultural Biotechnology?",
                "What subjects are required to study BSc. Agricultural Biotechnology?",
                "What prerequisites do I need to study BSc. Agricultural Biotechnology?",
                "What subjects must be taken for BSc. Agricultural Biotechnology?",
                "What are the requirements for enrolling in BSc. Agricultural Biotechnology?",
                "What qualifications do I need for admission to BSc. Agricultural Biotechnology?",
                "What are the required grades for BSc. Agricultural Biotechnology?",
                "What subjects are required for admission to BSc. Agricultural Biotechnology?",
                "What subjects should I study for BSc. Agricultural Biotechnology?",
                "What prerequisites are needed for BSc. Agricultural Biotechnology?",
                "What do I need to be admitted to BSc. Agricultural Biotechnology?",
                "What qualifications are needed for a BSc. in Agricultural Biotechnology?",
                "What academic qualifications must be met for BSc. Agricultural Biotechnology?",
                "What subjects are required to get into BSc. Agricultural Biotechnology?",
                "What are the eligibility criteria for BSc. Agricultural Biotechnology?",
                "What requirements do I need to be admitted to BSc. Agricultural Biotechnology?",
                "What qualifications are required for admission to BSc. Agricultural Biotechnology?",
                "What educational background do I need for BSc. Agricultural Biotechnology?",
                "What qualifications do I need for applying to BSc. Agricultural Biotechnology?",
                "What subjects do I need to meet the requirements for BSc. Agricultural Biotechnology?",
                "What prerequisites do I need to fulfill for BSc. Agricultural Biotechnology?",
                "What subjects do I need to take for BSc. Agricultural Biotechnology?",
                "What are the academic requirements to get into BSc. Agricultural Biotechnology?",
                "What qualifications are needed to be admitted to BSc. Agricultural Biotechnology?",
                "What academic subjects must be studied for BSc. Agricultural Biotechnology?",
                "What are the needed subjects for BSc. Agricultural Biotechnology?",
                "What do I need to study to qualify for BSc. Agricultural Biotechnology?",
                "What qualifications are needed to pursue a BSc. in Agricultural Biotechnology?",
                "what do i need to study to qualify for bsc . agricultural biotechnology ?"
            ],
            "responses": [
                "Here are the requirements for BSc. Agricultural Biotechnology <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:</b> Credit passes in Chemistry and any TWO (2) from Physics or Mathematics, Biology or General Agriculture or Animal Husbandry or Crop Husbandry or Horticulture. </p><br><li><b><u>GCE APPLICANTS </u></b></li><p><b>'O' Level:</b>  Credit passes in FIVE (5) subjects or equivalent qualification including English Language, Mathematics, AND, </p><p><b>'A' Level or equivalent:</b>  Credit passes in THREE (3) subjects or equivalent from  Chemistry, Physics or Mathematics, and Biology or Agricultural Science. </p><br><li><b><u>MATURE APPLICANTS</u></b></li><p>Applicants must have attained the age of 25 years at the time of submitting the Application Forms and must have a minimum of TWO (2) years post qualification experience. In addition, applicant must satisfy any of the following qualifications: </p><ul><li><b>Diploma or Higher National Diploma Applicants:</b> Diploma or Higher National Diploma in Agriculture or Agriculture-related programme from a recognized institution. OR </li><li><b>GCE Applicants:</b> Five (5) credits at 'O' Level including English Language and Mathematics, Biology, Chemistry and Physics, or Additional Mathematics, and Additional General Science. </li><li><b>WASSCE/SSSCE Applicants:</b> Credits passes in THREE (3) Elective subjects in Biology, Chemistry, and Physics or Mathematics or General Agriculture or Crop Husbandry or and Horticulture. </li></ul><br><i>Short-listed applicants may take an Entrance Examination and pass an interview. </i></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Agricultural Biotechnology Cutoff Points",
            "patterns": [
                "cutoff points for BSc Agricultural Biotechnology",
                "BSc Agricultural Biotechnology cutoff points",
                "minimum score for BSc Agricultural Biotechnology",
                "required score for BSc Agricultural Biotechnology",
                "aggregate for BSc Agricultural Biotechnology",
                "what is the cutoff for BSc Agricultural Biotechnology",
                "cutoff marks for BSc Agricultural Biotechnology",
                "BSc Agricultural Biotechnology required marks",
                "what aggregate do I need for BSc Agricultural Biotechnology",
                "score needed for BSc Agricultural Biotechnology",
                "cutoff points for Agricultural Biotechnology",
                "aggregate requirements for Agricultural Biotechnology",
                "what were the cut-off aggregates for Agricultural Biotechnology",
                "what are the cut-off aggregates Agricultural Biotechnology",
                "What is the cutoff point for BSc Agricultural Biotechnology?",
                "Can you tell me the cutoff point for BSc Agricultural Biotechnology?",
                "Could you provide the cutoff point for BSc Agricultural Biotechnology?",
                "What's the cutoff score for BSc Agricultural Biotechnology?",
                "Do you know the cutoff for BSc Agricultural Biotechnology?",
                "How many points do I need for BSc Agricultural Biotechnology?",
                "What's the required aggregate for BSc Agricultural Biotechnology?",
                "What is the entry cutoff for BSc Agricultural Biotechnology?",
                "What score is needed for BSc Agricultural Biotechnology?",
                "What's the minimum score for BSc Agricultural Biotechnology?",
                "What's the admission cutoff for BSc Agricultural Biotechnology?",
                "How much do I need to score for BSc Agricultural Biotechnology?",
                "What's the cutoff mark for BSc Agricultural Biotechnology?",
                "How high does my score need to be for BSc Agricultural Biotechnology?",
                "What's the threshold for BSc Agricultural Biotechnology?",
                "What's the lowest score accepted for BSc Agricultural Biotechnology?",
                "How many points are required for BSc Agricultural Biotechnology?",
                "What's the point cutoff for BSc Agricultural Biotechnology?",
                "Can you tell me the score needed for BSc Agricultural Biotechnology?",
                "What is the cutoff point for entering BSc Agricultural Biotechnology?",
                "What's the required score for BSc Agricultural Biotechnology?",
                "What's the aggregate needed for BSc Agricultural Biotechnology?",
                "How many points to get into BSc Agricultural Biotechnology?",
                "What's the minimum aggregate for BSc Agricultural Biotechnology?",
                "What's the lowest mark accepted for BSc Agricultural Biotechnology?",
                "How many points are needed for BSc Agricultural Biotechnology?",
                "What's the cutoff score for getting into BSc Agricultural Biotechnology?",
                "How many points do I need to get into BSc Agricultural Biotechnology?",
                "What score do I need to enter BSc Agricultural Biotechnology?",
                "What's the entry score for BSc Agricultural Biotechnology?",
                "What's the minimum points for BSc Agricultural Biotechnology?",
                "What's the required points for BSc Agricultural Biotechnology?",
                "How much do I need to score to get into BSc Agricultural Biotechnology?",
                "What's the score requirement for BSc Agricultural Biotechnology?",
                "What's the point requirement for BSc Agricultural Biotechnology?",
                "What's the aggregate score for BSc Agricultural Biotechnology?",
                "How high does my aggregate need to be for BSc Agricultural Biotechnology?",
                "What's the minimum score requirement for BSc Agricultural Biotechnology?",
                "What's the minimum aggregate score for BSc Agricultural Biotechnology?",
                "What's the lowest score needed for BSc Agricultural Biotechnology?",
                "What score do I need for BSc Agricultural Biotechnology?",
                "What's the cutoff aggregate for BSc Agricultural Biotechnology?",
                "How many points to qualify for BSc Agricultural Biotechnology?",
                "What's the minimum required score for BSc Agricultural Biotechnology?",
                "What's the required cutoff for BSc Agricultural Biotechnology?",
                "What's the minimum threshold for BSc Agricultural Biotechnology?",
                "What's the admission score for BSc Agricultural Biotechnology?",
                "What's the required mark for BSc Agricultural Biotechnology?",
                "What's the lowest score requirement for BSc Agricultural Biotechnology?",
                "How many points are required to get into BSc Agricultural Biotechnology?",
                "What's the cutoff entry point for BSc Agricultural Biotechnology?",
                "How many points do I need to be accepted into BSc Agricultural Biotechnology?",
                "What's the minimum cutoff score for BSc Agricultural Biotechnology?",
                "What's the score needed for BSc Agricultural Biotechnology admission?",
                "What's the aggregate cutoff for BSc Agricultural Biotechnology?",
                "What's the required entry score for BSc Agricultural Biotechnology?",
                "How high must my score be for BSc Agricultural Biotechnology?",
                "What's the point aggregate for BSc Agricultural Biotechnology?",
                "What's the threshold score for BSc Agricultural Biotechnology?",
                "How much do I need to get into BSc Agricultural Biotechnology?",
                "What's the lowest score required for BSc Agricultural Biotechnology?",
                "What's the entry mark for BSc Agricultural Biotechnology?",
                "What's the required score to get into BSc Agricultural Biotechnology?",
                "What's the entry threshold for BSc Agricultural Biotechnology?",
                "What's the score cutoff for BSc Agricultural Biotechnology?",
                "How many points must I score for BSc Agricultural Biotechnology?",
                "What's the aggregate required for BSc Agricultural Biotechnology?",
                "What's the minimum points needed for BSc Agricultural Biotechnology?",
                "What's the minimum mark for BSc Agricultural Biotechnology?",
                "What's the lowest entry score for BSc Agricultural Biotechnology?",
                "What's the cutoff mark to get into BSc Agricultural Biotechnology?",
                "How high does my score have to be for BSc Agricultural Biotechnology?",
                "What's the minimum aggregate points for BSc Agricultural Biotechnology?",
                "What's the required entry aggregate for BSc Agricultural Biotechnology?",
                "How many points are needed to get into BSc Agricultural Biotechnology?",
                "What's the score threshold for BSc Agricultural Biotechnology?",
                "What's the aggregate to get into BSc Agricultural Biotechnology?",
                "What's the minimum score needed to get into BSc Agricultural Biotechnology?",
                "What's the minimum cutoff mark for BSc Agricultural Biotechnology?",
                "What's the lowest score to get into BSc Agricultural Biotechnology?",
                "What's the admission cutoff mark for BSc Agricultural Biotechnology?",
                "What's the minimum entry score for BSc Agricultural Biotechnology?",
                "What's the point cutoff for getting into BSc Agricultural Biotechnology?",
                "What's the lowest points needed for BSc Agricultural Biotechnology?",
                "What's the required cutoff points for BSc Agricultural Biotechnology?",
                "How much do I need to score to be accepted into BSc Agricultural Biotechnology?",
                "What's the lowest score accepted into BSc Agricultural Biotechnology?",
                "What's the required aggregate to get into BSc Agricultural Biotechnology?",
                "What's the cutoff for BSc Agricultural Biotechnology admission?",
                "How many points to be accepted into BSc Agricultural Biotechnology?",
                "What's the minimum points requirement for BSc Agricultural Biotechnology?",
                "What's the entry cutoff score for BSc Agricultural Biotechnology?",
                "What's the minimum points to get into BSc Agricultural Biotechnology?",
                "What's the required points to get into BSc Agricultural Biotechnology?",
                "What's the lowest score requirement for BSc Agricultural Biotechnology admission?",
                "What's the cutoff point requirement for BSc Agricultural Biotechnology?",
                "How high does my score need to be to get into BSc Agricultural Biotechnology?",
                "What's the minimum mark requirement for BSc Agricultural Biotechnology?",
                "How many points do I need to be eligible for BSc Agricultural Biotechnology?",
                "What's the required score for BSc Agricultural Biotechnology entry?",
                "What's the cutoff points for BSc Agricultural Biotechnology?",
                "What's the minimum threshold points for BSc Agricultural Biotechnology?",
                "What's the score requirement to get into BSc Agricultural Biotechnology?",
                "What's the minimum required points for BSc Agricultural Biotechnology?",
                "What's the admission score requirement for BSc Agricultural Biotechnology?",
                "What's the cutoff aggregate points for BSc Agricultural Biotechnology?",
                "How many points do I need to qualify for BSc Agricultural Biotechnology?",
                "What's the minimum entry points for BSc Agricultural Biotechnology?",
                "What's the required cutoff mark for BSc Agricultural Biotechnology?",
                "What's the lowest points requirement for BSc Agricultural Biotechnology?",
                "What's the cutoff score requirement for BSc Agricultural Biotechnology?",
                "How high must my aggregate be for BSc Agricultural Biotechnology?",
                "What's the score threshold for getting into BSc Agricultural Biotechnology?",
                "What's the lowest score needed to be accepted into BSc Agricultural Biotechnology?",
                "What's the entry points requirement for BSc Agricultural Biotechnology?",
                "What's the minimum score for getting into BSc Agricultural Biotechnology?",
                "What's the required entry points for BSc Agricultural Biotechnology?",
                "How many points to get accepted into BSc Agricultural Biotechnology?",
                "What's the minimum aggregate needed for BSc Agricultural Biotechnology?",
                "What's the cutoff entry score for BSc Agricultural Biotechnology?",
                "What's the required points to get into BSc Agricultural Biotechnology?",
                "What's the entry points for BSc Agricultural Biotechnology?",
                "How many points do I need to get accepted into BSc Agricultural Biotechnology?",
                "What's the minimum entry points for BSc Agricultural Biotechnology?",
                "What's the cutoff points requirement for BSc Agricultural Biotechnology?",
                "What's the minimum threshold score for BSc Agricultural Biotechnology?",
                "How many points do I need to get into BSc Agricultural Biotechnology?",
                "What's the score requirement for getting into BSc Agricultural Biotechnology?",
                "What's the minimum cutoff points for BSc Agricultural Biotechnology?",
                "What's the lowest aggregate required for BSc Agricultural Biotechnology?",
                "What's the points requirement for BSc Agricultural Biotechnology?",
                "How many points do I need to score for BSc Agricultural Biotechnology?",
                "What's the required cutoff aggregate for BSc Agricultural Biotechnology?",
                "What's the entry threshold points for BSc Agricultural Biotechnology?",
                "What's the minimum score to be accepted into BSc Agricultural Biotechnology?",
                "What's the cutoff points for entering BSc Agricultural Biotechnology?",
                "What's the minimum score required to get into BSc Agricultural Biotechnology?",
                "What's the required aggregate to be accepted into BSc Agricultural Biotechnology?",
                "What's the score cutoff for entering BSc Agricultural Biotechnology?",
                "What's the minimum points required for BSc Agricultural Biotechnology entry?",
                "How many points to get into BSc Agricultural Biotechnology?",
                "What's the score needed for getting into BSc Agricultural Biotechnology?"
            ],
            "responses": [
                "The cutoff points for BSc. Agricultural Biotechnology are typically around aggregate 18. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc_Agricultural_Biotechnology_fees",
            "patterns": [
                "what is the fees for Agricultural Biotechnology",
                "Can I know the amount I will pay for Agricultural Biotechnology",
                "Can i pay the fees in installment for Agricultural Biotechnology?",
                "When should i pay the fees for Agricultural Biotechnology?",
                "Can i book for a hall before paying fees for Agricultural Biotechnology",
                "How much are the fees for BSc. Agricultural Biotechnology?",
                "What are the tuition fees for BSc. Agricultural Biotechnology?",
                "How much do I need to pay for BSc. Agricultural Biotechnology?",
                "What is the cost of the BSc. Agricultural Biotechnology programme?",
                "Can you provide the fee details for BSc. Agricultural Biotechnology?",
                "What is the tuition cost for BSc. Agricultural Biotechnology?",
                "How much is the fee for studying Agricultural Biotechnology?",
                "What is the payment schedule for BSc. Agricultural Biotechnology fees?",
                "Do I have to pay the full fee for BSc. Agricultural Biotechnology upfront?",
                "What is the fee structure for BSc. Agricultural Biotechnology?",
                "Can I pay my BSc. Agricultural Biotechnology fees in installments?",
                "What are the fee payment options for BSc. Agricultural Biotechnology?",
                "How are the fees for BSc. Agricultural Biotechnology calculated?",
                "Are there any additional costs for BSc. Agricultural Biotechnology?",
                "What is the total cost of BSc. Agricultural Biotechnology for a year?",
                "Are there any extra fees for BSc. Agricultural Biotechnology?",
                "Can I get a breakdown of the BSc. Agricultural Biotechnology fees?",
                "What is the annual fee for BSc. Agricultural Biotechnology?",
                "How much does each semester cost for BSc. Agricultural Biotechnology?",
                "What are the miscellaneous fees for BSc. Agricultural Biotechnology?",
                "Are there any lab fees for BSc. Agricultural Biotechnology?",
                "What are the accommodation fees for BSc. Agricultural Biotechnology?",
                "How much are the hostel fees for BSc. Agricultural Biotechnology students?",
                "What is the fee for international students in BSc. Agricultural Biotechnology?",
                "Do international students pay higher fees for BSc. Agricultural Biotechnology?",
                "What is the fee for fee-paying students in BSc. Agricultural Biotechnology?",
                "Are there fee waivers for BSc. Agricultural Biotechnology?",
                "Are scholarships available to cover BSc. Agricultural Biotechnology fees?",
                "What are the financial aid options for BSc. Agricultural Biotechnology?",
                "How much should I budget for BSc. Agricultural Biotechnology fees?",
                "Is there a fee refund policy for BSc. Agricultural Biotechnology?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Agricultural Biotechnology?",
                "What is the refund policy for BSc. Agricultural Biotechnology fees?",
                "What is the deadline for paying BSc. Agricultural Biotechnology fees?",
                "Can I get a fee extension for BSc. Agricultural Biotechnology?",
                "What is the penalty for late payment of BSc. Agricultural Biotechnology fees?",
                "Can I pay BSc. Agricultural Biotechnology fees in multiple payments?",
                "Are there any hidden costs for BSc. Agricultural Biotechnology?",
                "What are the compulsory fees for BSc. Agricultural Biotechnology?",
                "Can I pay BSc. Agricultural Biotechnology fees with a payment plan?",
                "How often do I need to pay fees for BSc. Agricultural Biotechnology?",
                "What are the semester fees for BSc. Agricultural Biotechnology?",
                "Is there an application fee for BSc. Agricultural Biotechnology?",
                "What is the registration fee for BSc. Agricultural Biotechnology?",
                "Are the fees for BSc. Agricultural Biotechnology fixed or variable?",
                "What is the cost per credit hour for BSc. Agricultural Biotechnology?",
                "Are there any discounts available for BSc. Agricultural Biotechnology fees?",
                "Can I get a fee breakdown for BSc. Agricultural Biotechnology?",
                "What are the non-tuition fees for BSc. Agricultural Biotechnology?",
                "Are there any additional charges for BSc. Agricultural Biotechnology?",
                "How much is the acceptance fee for BSc. Agricultural Biotechnology?",
                "Can I book a hall without paying the BSc. Agricultural Biotechnology fees?",
                "What are the hostel booking requirements for BSc. Agricultural Biotechnology?",
                "When are the BSc. Agricultural Biotechnology fees due?",
                "What is the initial deposit for BSc. Agricultural Biotechnology fees?",
                "How do I pay my BSc. Agricultural Biotechnology fees online?",
                "Are there any late fees for BSc. Agricultural Biotechnology?",
                "What is the mode of payment for BSc. Agricultural Biotechnology fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Agricultural Biotechnology?",
                "How do I access my fee statement for BSc. Agricultural Biotechnology?",
                "What is the last date to pay fees for BSc. Agricultural Biotechnology?",
                "Is there an online payment option for BSc. Agricultural Biotechnology fees?",
                "What is the procedure for paying BSc. Agricultural Biotechnology fees?",
                "What is the tuition fee for the first year of BSc. Agricultural Biotechnology?",
                "Are there any financial aid options for BSc. Agricultural Biotechnology?",


                "What is included in the BSc. Agricultural Biotechnology fee?",
                "Can I get a fee waiver for BSc. Agricultural Biotechnology?"


            ],
            "responses": [
                "The fees for BSc. Agricultural Biotechnology programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_agribusiness_management_requirements",
            "patterns": [
                "What are the requirements for BSc. Agribusiness Management?",
                "Can you provide the admission criteria for BSc. Agribusiness Management?",
                "Requirements for BSc. Agribusiness Management programme?",
                "What are the prerequisites for BSc. Agribusiness Management?",
                "BSc. Agribusiness Management admission requirements?",
                "Information on eligibility for BSc. Agribusiness Management programme?",
                "What are the entry requirements for BSc. Agribusiness Management programme?",
                "Criteria for admission into BSc. Agribusiness Management?",
                "BSc. Agribusiness Management programme prerequisites?",
                "What are the requirements for BSc. Agribusiness Management?",
                "What do I need to qualify for BSc. Agribusiness Management?",
                "What qualifications are needed for BSc. Agribusiness Management?",
                "What are the entry requirements for BSc. Agribusiness Management?",
                "What are the admission requirements for BSc. Agribusiness Management?",
                "What prerequisites are required for BSc. Agribusiness Management?",
                "What are the academic requirements for BSc. Agribusiness Management?",
                "What grades do I need for BSc. Agribusiness Management?",
                "What subjects are required for BSc. Agribusiness Management?",
                "What criteria do I need to meet for BSc. Agribusiness Management?",
                "What qualifications must I have for BSc. Agribusiness Management?",
                "What are the eligibility requirements for BSc. Agribusiness Management?",
                "What academic qualifications are required for BSc. Agribusiness Management?",
                "What educational background is needed for BSc. Agribusiness Management?",
                "What high school subjects are required for BSc. Agribusiness Management?",
                "What are the subject requirements for BSc. Agribusiness Management?",
                "What qualifications do I need for BSc. Agribusiness Management?",
                "What are the mandatory subjects for BSc. Agribusiness Management?",
                "What qualifications should I have for BSc. Agribusiness Management?",
                "What grades are needed for BSc. Agribusiness Management?",
                "What entry qualifications are required for BSc. Agribusiness Management?",
                "What are the course requirements for BSc. Agribusiness Management?",
                "What qualifications are necessary for BSc. Agribusiness Management?",
                "What do I need to study BSc. Agribusiness Management?",
                "What qualifications do I need to pursue BSc. Agribusiness Management?",
                "What are the minimum requirements for BSc. Agribusiness Management?",
                "What credentials are required for BSc. Agribusiness Management?",
                "What is needed to apply for BSc. Agribusiness Management?",
                "What are the required subjects for BSc. Agribusiness Management?",
                "What qualifications do I need to enroll in BSc. Agribusiness Management?",
                "What are the academic prerequisites for BSc. Agribusiness Management?",
                "What high school qualifications are needed for BSc. Agribusiness Management?",
                "What requirements must be met for BSc. Agribusiness Management?",
                "What are the admission criteria for BSc. Agribusiness Management?",
                "What are the necessary qualifications for BSc. Agribusiness Management?",
                "What are the educational requirements for BSc. Agribusiness Management?",
                "What do I need to be eligible for BSc. Agribusiness Management?",
                "What academic background is required for BSc. Agribusiness Management?",
                "What prerequisites do I need for BSc. Agribusiness Management?",
                "What qualifications are needed to apply for BSc. Agribusiness Management?",
                "What qualifications do I need to get into BSc. Agribusiness Management?",
                "What subjects do I need to study for BSc. Agribusiness Management?",
                "What qualifications are needed to enroll in BSc. Agribusiness Management?",
                "What are the qualification requirements for BSc. Agribusiness Management?",
                "What subjects must I take for BSc. Agribusiness Management?",
                "What grades do I need to get into BSc. Agribusiness Management?",
                "What are the required qualifications for BSc. Agribusiness Management?",
                "What educational qualifications are needed for BSc. Agribusiness Management?",
                "What qualifications are required to study BSc. Agribusiness Management?",
                "What requirements do I need to fulfill for BSc. Agribusiness Management?",
                "What subjects should I have studied for BSc. Agribusiness Management?",
                "What do I need to have to qualify for BSc. Agribusiness Management?",
                "What subjects do I need to qualify for BSc. Agribusiness Management?",
                "What qualifications do I need to meet for BSc. Agribusiness Management?",
                "What qualifications must be met for BSc. Agribusiness Management?",
                "What are the needed qualifications for BSc. Agribusiness Management?",
                "What academic subjects are required for BSc. Agribusiness Management?",
                "What requirements must I meet for BSc. Agribusiness Management?",
                "What do I need to qualify for a BSc. in Agribusiness Management?",
                "What grades are required for BSc. Agribusiness Management?",
                "What academic credentials are needed for BSc. Agribusiness Management?",
                "What subjects are necessary for BSc. Agribusiness Management?",
                "What qualifications do I need for a BSc. in Agribusiness Management?",
                "What educational qualifications must I have for BSc. Agribusiness Management?",
                "What criteria must be met for BSc. Agribusiness Management?",
                "What qualifications are necessary to study BSc. Agribusiness Management?",
                "What subjects are required to study BSc. Agribusiness Management?",
                "What prerequisites do I need to study BSc. Agribusiness Management?",
                "What subjects must be taken for BSc. Agribusiness Management?",
                "What are the requirements for enrolling in BSc. Agribusiness Management?",
                "What qualifications do I need for admission to BSc. Agribusiness Management?",
                "What are the required grades for BSc. Agribusiness Management?",
                "What subjects are required for admission to BSc. Agribusiness Management?",
                "What subjects should I study for BSc. Agribusiness Management?",
                "What prerequisites are needed for BSc. Agribusiness Management?",
                "What do I need to be admitted to BSc. Agribusiness Management?",
                "What qualifications are needed for a BSc. in Agribusiness Management?",
                "What academic qualifications must be met for BSc. Agribusiness Management?",
                "What subjects are required to get into BSc. Agribusiness Management?",
                "What are the eligibility criteria for BSc. Agribusiness Management?",
                "What requirements do I need to be admitted to BSc. Agribusiness Management?",
                "What qualifications are required for admission to BSc. Agribusiness Management?",
                "What educational background do I need for BSc. Agribusiness Management?",
                "What qualifications do I need for applying to BSc. Agribusiness Management?",
                "What subjects do I need to meet the requirements for BSc. Agribusiness Management?",
                "What prerequisites do I need to fulfill for BSc. Agribusiness Management?",
                "What subjects do I need to take for BSc. Agribusiness Management?",
                "What are the academic requirements to get into BSc. Agribusiness Management?",
                "What qualifications are needed to be admitted to BSc. Agribusiness Management?",
                "What academic subjects must be studied for BSc. Agribusiness Management?",
                "What are the needed subjects for BSc. Agribusiness Management?",
                "What do I need to study to qualify for BSc. Agribusiness Management?",
                "What qualifications are needed to pursue a BSc. in Agribusiness Management?"
            ],
            "responses": [
                "Here are the requirements for BSc. Agribusiness Management <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science</p><p><b>Elective Subjects:</b> Credit passes in THREE subjects from the following options: </p><ul><li><b>Science:</b> Chemistry, Physics or Mathematics, and Biology or General Agriculture. </li><li><b>Business:</b> Economics, Accounting, Business Management, Business Mathematics, Costing and Elective Mathematics. Applicants with this combination must have a minimum of C (for SSSCE applicants) and B3 (for WASSCE Applicants) in Integrated Science. </li><li><b>General Arts:</b>  Economics, Geography, and Elective Mathematics. Applicants with this combination must have a minimum of C (for SSSCE applicants) and B3 (for WASSCE Applicants) in Integrated Science. </li><li><b>General Agriculture:</b>  Chemistry, Physics or Mathematics, and Biology or General Agriculture or Crop Husbandry or Horticulture. </li></ul><br><li><b><u>GCE APPLICANTS </u></b></li><p><b>'O' Level:</b>  Credit passes in FIVE (5) subjects or equivalent qualification including English Language, Mathematics, AND, </p><p><b>'A' Level or equivalent:</b>  Credit passes in THREE (3) subjects or equivalent from  Chemistry, Physics or Mathematics, and Biology or Agricultural Science. </p><br><li><b><u>MATURE APPLICANTS</u></b></li><p>Applicants must have attained the age of 25 years at the time of submitting the Application Forms and must have a minimum of TWO (2) years post qualification experience. In addition, applicant must satisfy any of the following qualifications: </p><ul><li><b>Diploma or Higher National Diploma Applicants:</b> Diploma or Higher National Diploma in Agriculture or Agriculture-related programme from a recognized institution. OR </li><li><b>GCE Applicants:</b> Five (5) credits at 'O' Level including English Language and Mathematics, Biology, Chemistry and Physics, or Additional Mathematics, and Additional General Science. </li><li><b>WASSCE/SSSCE Applicants:</b> Credits passes in THREE (3) Elective subjects in Biology, Chemistry, and Physics or Mathematics or General Agriculture or Crop Husbandry or and Horticulture. </li></ul><br><i>Short-listed applicants may take an Entrance Examination and pass an interview. </i></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Agribusiness Management Cutoff Points",
            "patterns": [
                "cutoff points for BSc Agribusiness Management",
                "BSc Agribusiness Management cutoff points",
                "minimum score for BSc Agribusiness Management",
                "required score for BSc Agribusiness Management",
                "aggregate for BSc Agribusiness Management",
                "what is the cutoff for BSc Agribusiness Management",
                "cutoff marks for BSc Agribusiness Management",
                "BSc Agribusiness Management required marks",
                "what aggregate do I need for BSc Agribusiness Management",
                "score needed for BSc Agribusiness Management",
                "cutoff points for Agribusiness Management",
                "aggregate requirements for Agribusiness Management",
                "what were the cut-off aggregates for Agribusiness Management",
                "what are the cut-off aggregates Agribusiness Management",
                "What is the cutoff point for BSc Agribusiness Management?",
                "Can you tell me the cutoff point for BSc Agribusiness Management?",
                "Could you provide the cutoff point for BSc Agribusiness Management?",
                "What's the cutoff score for BSc Agribusiness Management?",
                "Do you know the cutoff for BSc Agribusiness Management?",
                "How many points do I need for BSc Agribusiness Management?",
                "What's the required aggregate for BSc Agribusiness Management?",
                "What is the entry cutoff for BSc Agribusiness Management?",
                "What score is needed for BSc Agribusiness Management?",
                "What's the minimum score for BSc Agribusiness Management?",
                "What's the admission cutoff for BSc Agribusiness Management?",
                "How much do I need to score for BSc Agribusiness Management?",
                "What's the cutoff mark for BSc Agribusiness Management?",
                "How high does my score need to be for BSc Agribusiness Management?",
                "What's the threshold for BSc Agribusiness Management?",
                "What's the lowest score accepted for BSc Agribusiness Management?",
                "How many points are required for BSc Agribusiness Management?",
                "What's the point cutoff for BSc Agribusiness Management?",
                "Can you tell me the score needed for BSc Agribusiness Management?",
                "What is the cutoff point for entering BSc Agribusiness Management?",
                "What's the required score for BSc Agribusiness Management?",
                "What's the aggregate needed for BSc Agribusiness Management?",
                "How many points to get into BSc Agribusiness Management?",
                "What's the minimum aggregate for BSc Agribusiness Management?",
                "What's the lowest mark accepted for BSc Agribusiness Management?",
                "How many points are needed for BSc Agribusiness Management?",
                "What's the cutoff score for getting into BSc Agribusiness Management?",
                "How many points do I need to get into BSc Agribusiness Management?",
                "What score do I need to enter BSc Agribusiness Management?",
                "What's the entry score for BSc Agribusiness Management?",
                "What's the minimum points for BSc Agribusiness Management?",
                "What's the required points for BSc Agribusiness Management?",
                "How much do I need to score to get into BSc Agribusiness Management?",
                "What's the score requirement for BSc Agribusiness Management?",
                "What's the point requirement for BSc Agribusiness Management?",
                "What's the aggregate score for BSc Agribusiness Management?",
                "How high does my aggregate need to be for BSc Agribusiness Management?",
                "What's the minimum score requirement for BSc Agribusiness Management?",
                "What's the minimum aggregate score for BSc Agribusiness Management?",
                "What's the lowest score needed for BSc Agribusiness Management?",
                "What score do I need for BSc Agribusiness Management?",
                "What's the cutoff aggregate for BSc Agribusiness Management?",
                "How many points to qualify for BSc Agribusiness Management?",
                "What's the minimum required score for BSc Agribusiness Management?",
                "What's the required cutoff for BSc Agribusiness Management?",
                "What's the minimum threshold for BSc Agribusiness Management?",
                "What's the admission score for BSc Agribusiness Management?",
                "What's the required mark for BSc Agribusiness Management?",
                "What's the lowest score requirement for BSc Agribusiness Management?",
                "How many points are required to get into BSc Agribusiness Management?",
                "What's the cutoff entry point for BSc Agribusiness Management?",
                "How many points do I need to be accepted into BSc Agribusiness Management?",
                "What's the minimum cutoff score for BSc Agribusiness Management?",
                "What's the score needed for BSc Agribusiness Management admission?",
                "What's the aggregate cutoff for BSc Agribusiness Management?",
                "What's the required entry score for BSc Agribusiness Management?",
                "How high must my score be for BSc Agribusiness Management?",
                "What's the point aggregate for BSc Agribusiness Management?",
                "What's the threshold score for BSc Agribusiness Management?",
                "How much do I need to get into BSc Agribusiness Management?",
                "What's the lowest score required for BSc Agribusiness Management?",
                "What's the entry mark for BSc Agribusiness Management?",
                "What's the required score to get into BSc Agribusiness Management?",
                "What's the entry threshold for BSc Agribusiness Management?",
                "What's the score cutoff for BSc Agribusiness Management?",
                "How many points must I score for BSc Agribusiness Management?",
                "What's the aggregate required for BSc Agribusiness Management?",
                "What's the minimum points needed for BSc Agribusiness Management?",
                "What's the minimum mark for BSc Agribusiness Management?",
                "What's the lowest entry score for BSc Agribusiness Management?",
                "What's the cutoff mark to get into BSc Agribusiness Management?",
                "How high does my score have to be for BSc Agribusiness Management?",
                "What's the minimum aggregate points for BSc Agribusiness Management?",
                "What's the required entry aggregate for BSc Agribusiness Management?",
                "How many points are needed to get into BSc Agribusiness Management?",
                "What's the score threshold for BSc Agribusiness Management?",
                "What's the aggregate to get into BSc Agribusiness Management?",
                "What's the minimum score needed to get into BSc Agribusiness Management?",
                "What's the minimum cutoff mark for BSc Agribusiness Management?",
                "What's the lowest score to get into BSc Agribusiness Management?",
                "What's the admission cutoff mark for BSc Agribusiness Management?",
                "What's the minimum entry score for BSc Agribusiness Management?",
                "What's the point cutoff for getting into BSc Agribusiness Management?",
                "What's the lowest points needed for BSc Agribusiness Management?",
                "What's the required cutoff points for BSc Agribusiness Management?",
                "How much do I need to score to be accepted into BSc Agribusiness Management?",
                "What's the lowest score accepted into BSc Agribusiness Management?",
                "What's the required aggregate to get into BSc Agribusiness Management?",
                "What's the cutoff for BSc Agribusiness Management admission?",
                "How many points to be accepted into BSc Agribusiness Management?",
                "What's the minimum points requirement for BSc Agribusiness Management?",
                "What's the entry cutoff score for BSc Agribusiness Management?",
                "What's the minimum points to get into BSc Agribusiness Management?",
                "What's the required points to get into BSc Agribusiness Management?",
                "What's the lowest score requirement for BSc Agribusiness Management admission?",
                "What's the cutoff point requirement for BSc Agribusiness Management?",
                "How high does my score need to be to get into BSc Agribusiness Management?",
                "What's the minimum mark requirement for BSc Agribusiness Management?",
                "How many points do I need to be eligible for BSc Agribusiness Management?",
                "What's the required score for BSc Agribusiness Management entry?",
                "What's the cutoff points for BSc Agribusiness Management?",
                "What's the minimum threshold points for BSc Agribusiness Management?",
                "What's the score requirement to get into BSc Agribusiness Management?",
                "What's the minimum required points for BSc Agribusiness Management?",
                "What's the admission score requirement for BSc Agribusiness Management?",
                "What's the cutoff aggregate points for BSc Agribusiness Management?",
                "How many points do I need to qualify for BSc Agribusiness Management?",
                "What's the minimum entry points for BSc Agribusiness Management?",
                "What's the required cutoff mark for BSc Agribusiness Management?",
                "What's the lowest points requirement for BSc Agribusiness Management?",
                "What's the cutoff score requirement for BSc Agribusiness Management?",
                "How high must my aggregate be for BSc Agribusiness Management?",
                "What's the score threshold for getting into BSc Agribusiness Management?",
                "What's the lowest score needed to be accepted into BSc Agribusiness Management?",
                "What's the entry points requirement for BSc Agribusiness Management?",
                "What's the minimum score for getting into BSc Agribusiness Management?",
                "What's the required entry points for BSc Agribusiness Management?",
                "How many points to get accepted into BSc Agribusiness Management?",
                "What's the minimum aggregate needed for BSc Agribusiness Management?",
                "What's the cutoff entry score for BSc Agribusiness Management?",
                "What's the required points to get into BSc Agribusiness Management?",
                "What's the entry points for BSc Agribusiness Management?",
                "How many points do I need to get accepted into BSc Agribusiness Management?",
                "What's the minimum entry points for BSc Agribusiness Management?",
                "What's the cutoff points requirement for BSc Agribusiness Management?"
            ],
            "responses": [
                "The cutoff points for BSc. Agribusiness Management are typically around aggregate 17. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc_Agribusiness_Management_fees",
            "patterns": [
                "what is the fees for Agribusiness Management",
                "Can I know the amount I will pay for Agribusiness Management",
                "Can i pay the fees in installment Agribusiness Management?",
                "When should i pay the fees Agribusiness Management?",
                "Can i book for a hall before paying fees Agribusiness Management",
                "How much are the fees for BSc. Agribusiness Management?",
                "What are the tuition fees for BSc. Agribusiness Management?",
                "How much do I need to pay for BSc. Agribusiness Management?",
                "What is the cost of the BSc. Agribusiness Management programme?",
                "Can you provide the fee details for BSc. Agribusiness Management?",
                "What is the tuition cost for BSc. Agribusiness Management?",
                "How much is the fee for studying Agribusiness Management?",
                "What is the payment schedule for BSc. Agribusiness Management fees?",
                "Do I have to pay the full fee for BSc. Agribusiness Management upfront?",
                "What is the fee structure for BSc. Agribusiness Management?",
                "Can I pay my BSc. Agribusiness Management fees in installments?",
                "What are the fee payment options for BSc. Agribusiness Management?",
                "How are the fees for BSc. Agribusiness Management calculated?",
                "Are there any additional costs for BSc. Agribusiness Management?",
                "What is the total cost of BSc. Agribusiness Management for a year?",
                "Are there any extra fees for BSc. Agribusiness Management?",
                "Can I get a breakdown of the BSc. Agribusiness Management fees?",
                "What is the annual fee for BSc. Agribusiness Management?",
                "How much does each semester cost for BSc. Agribusiness Management?",
                "What are the miscellaneous fees for BSc. Agribusiness Management?",
                "Are there any lab fees for BSc. Agribusiness Management?",
                "What are the accommodation fees for BSc. Agribusiness Management?",
                "How much are the hostel fees for BSc. Agribusiness Management students?",
                "What is the fee for international students in BSc. Agribusiness Management?",
                "Do international students pay higher fees for BSc. Agribusiness Management?",
                "What is the fee for fee-paying students in BSc. Agribusiness Management?",
                "Are there fee waivers for BSc. Agribusiness Management?",
                "Are scholarships available to cover BSc. Agribusiness Management fees?",
                "What are the financial aid options for BSc. Agribusiness Management?",
                "How much should I budget for BSc. Agribusiness Management fees?",
                "Is there a fee refund policy for BSc. Agribusiness Management?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Agribusiness Management?",
                "What is the refund policy for BSc. Agribusiness Management fees?",
                "What is the deadline for paying BSc. Agribusiness Management fees?",
                "Can I get a fee extension for BSc. Agribusiness Management?",
                "What is the penalty for late payment of BSc. Agribusiness Management fees?",
                "Can I pay BSc. Agribusiness Management fees in multiple payments?",
                "Are there any hidden costs for BSc. Agribusiness Management?",
                "What are the compulsory fees for BSc. Agribusiness Management?",
                "Can I pay BSc. Agribusiness Management fees with a payment plan?",
                "How often do I need to pay fees for BSc. Agribusiness Management?",
                "What are the semester fees for BSc. Agribusiness Management?",
                "Is there an application fee for BSc. Agribusiness Management?",
                "What is the registration fee for BSc. Agribusiness Management?",
                "Are the fees for BSc. Agribusiness Management fixed or variable?",
                "What is the cost per credit hour for BSc. Agribusiness Management?",
                "Are there any discounts available for BSc. Agribusiness Management fees?",
                "Can I get a fee breakdown for BSc. Agribusiness Management?",
                "What are the non-tuition fees for BSc. Agribusiness Management?",
                "Are there any additional charges for BSc. Agribusiness Management?",
                "How much is the acceptance fee for BSc. Agribusiness Management?",
                "Can I book a hall without paying the BSc. Agribusiness Management fees?",
                "What are the hostel booking requirements for BSc. Agribusiness Management?",
                "When are the BSc. Agribusiness Management fees due?",
                "What is the initial deposit for BSc. Agribusiness Management fees?",
                "How do I pay my BSc. Agribusiness Management fees online?",
                "Are there any late fees for BSc. Agribusiness Management?",
                "What is the mode of payment for BSc. Agribusiness Management fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Agribusiness Management?",
                "How do I access my fee statement for BSc. Agribusiness Management?",
                "What is the last date to pay fees for BSc. Agribusiness Management?",
                "Is there an online payment option for BSc. Agribusiness Management fees?",
                "What is the procedure for paying BSc. Agribusiness Management fees?",
                "What is the tuition fee for the first year of BSc. Agribusiness Management?",
                "Are there any financial aid options for BSc. Agribusiness Management?",


                "What is included in the BSc. Agribusiness Management fee?",
                "Can I get a fee waiver for BSc. Agribusiness Management?"


            ],
            "responses": [
                "The fees for BSc. Agribusiness Management programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_landscape_design_management_requirements",
            "patterns": [
                "What are the requirements for BSc. Landscape Design and Management?",
                "Can you provide the admission criteria for BSc. Landscape Design and Management?",
                "Requirements for BSc. Landscape Design and Management programme?",
                "What are the prerequisites for BSc. Landscape Design and Management?",
                "BSc. Landscape Design and Management admission requirements?",
                "Information on eligibility for BSc. Landscape Design and Management programme?",
                "What are the entry requirements for BSc. Landscape Design and Management programme?",
                "Criteria for admission into BSc. Landscape Design and Management?",
                "BSc. Landscape Design and Management programme prerequisites?",
                "What are the requirements for BSc. Landscape Design Management?",
                "What do I need to qualify for BSc. Landscape Design Management?",
                "What qualifications are needed for BSc. Landscape Design Management?",
                "What are the entry requirements for BSc. Landscape Design Management?",
                "What are the admission requirements for BSc. Landscape Design Management?",
                "What prerequisites are required for BSc. Landscape Design Management?",
                "What are the academic requirements for BSc. Landscape Design Management?",
                "What grades do I need for BSc. Landscape Design Management?",
                "What subjects are required for BSc. Landscape Design Management?",
                "What criteria do I need to meet for BSc. Landscape Design Management?",
                "What qualifications must I have for BSc. Landscape Design Management?",
                "What are the eligibility requirements for BSc. Landscape Design Management?",
                "What academic qualifications are required for BSc. Landscape Design Management?",
                "What educational background is needed for BSc. Landscape Design Management?",
                "What high school subjects are required for BSc. Landscape Design Management?",
                "What are the subject requirements for BSc. Landscape Design Management?",
                "What qualifications do I need for BSc. Landscape Design Management?",
                "What are the mandatory subjects for BSc. Landscape Design Management?",
                "What qualifications should I have for BSc. Landscape Design Management?",
                "What grades are needed for BSc. Landscape Design Management?",
                "What entry qualifications are required for BSc. Landscape Design Management?",
                "What are the course requirements for BSc. Landscape Design Management?",
                "What qualifications are necessary for BSc. Landscape Design Management?",
                "What do I need to study BSc. Landscape Design Management?",
                "What qualifications do I need to pursue BSc. Landscape Design Management?",
                "What are the minimum requirements for BSc. Landscape Design Management?",
                "What credentials are required for BSc. Landscape Design Management?",
                "What is needed to apply for BSc. Landscape Design Management?",
                "What are the required subjects for BSc. Landscape Design Management?",
                "What qualifications do I need to enroll in BSc. Landscape Design Management?",
                "What are the academic prerequisites for BSc. Landscape Design Management?",
                "What high school qualifications are needed for BSc. Landscape Design Management?",
                "What requirements must be met for BSc. Landscape Design Management?",
                "What are the admission criteria for BSc. Landscape Design Management?",
                "What are the necessary qualifications for BSc. Landscape Design Management?",
                "What are the educational requirements for BSc. Landscape Design Management?",
                "What do I need to be eligible for BSc. Landscape Design Management?",
                "What academic background is required for BSc. Landscape Design Management?",
                "What prerequisites do I need for BSc. Landscape Design Management?",
                "What qualifications are needed to apply for BSc. Landscape Design Management?",
                "What qualifications do I need to get into BSc. Landscape Design Management?",
                "What subjects do I need to study for BSc. Landscape Design Management?",
                "What qualifications are needed to enroll in BSc. Landscape Design Management?",
                "What are the qualification requirements for BSc. Landscape Design Management?",
                "What subjects must I take for BSc. Landscape Design Management?",
                "What grades do I need to get into BSc. Landscape Design Management?",
                "What are the required qualifications for BSc. Landscape Design Management?",
                "What educational qualifications are needed for BSc. Landscape Design Management?",
                "What qualifications are required to study BSc. Landscape Design Management?",
                "What requirements do I need to fulfill for BSc. Landscape Design Management?",
                "What subjects should I have studied for BSc. Landscape Design Management?",
                "What do I need to have to qualify for BSc. Landscape Design Management?",
                "What subjects do I need to qualify for BSc. Landscape Design Management?",
                "What qualifications do I need to meet for BSc. Landscape Design Management?",
                "What qualifications must be met for BSc. Landscape Design Management?",
                "What are the needed qualifications for BSc. Landscape Design Management?",
                "What academic subjects are required for BSc. Landscape Design Management?",
                "What requirements must I meet for BSc. Landscape Design Management?",
                "What do I need to qualify for a BSc. in Landscape Design Management?",
                "What grades are required for BSc. Landscape Design Management?",
                "What academic credentials are needed for BSc. Landscape Design Management?",
                "What subjects are necessary for BSc. Landscape Design Management?",
                "What qualifications do I need for a BSc. in Landscape Design Management?",
                "What educational qualifications must I have for BSc. Landscape Design Management?",
                "What criteria must be met for BSc. Landscape Design Management?",
                "What qualifications are necessary to study BSc. Landscape Design Management?",
                "What subjects are required to study BSc. Landscape Design Management?",
                "What prerequisites do I need to study BSc. Landscape Design Management?",
                "What subjects must be taken for BSc. Landscape Design Management?",
                "What are the requirements for enrolling in BSc. Landscape Design Management?",
                "What qualifications do I need for admission to BSc. Landscape Design Management?",
                "What are the required grades for BSc. Landscape Design Management?",
                "What subjects are required for admission to BSc. Landscape Design Management?",
                "What subjects should I study for BSc. Landscape Design Management?",
                "What prerequisites are needed for BSc. Landscape Design Management?",
                "What do I need to be admitted to BSc. Landscape Design Management?",
                "What qualifications are needed for a BSc. in Landscape Design Management?",
                "What academic qualifications must be met for BSc. Landscape Design Management?",
                "What subjects are required to get into BSc. Landscape Design Management?",
                "What are the eligibility criteria for BSc. Landscape Design Management?",
                "What requirements do I need to be admitted to BSc. Landscape Design Management?",
                "What qualifications are required for admission to BSc. Landscape Design Management?",
                "What educational background do I need for BSc. Landscape Design Management?",
                "What qualifications do I need for applying to BSc. Landscape Design Management?",
                "What subjects do I need to meet the requirements for BSc. Landscape Design Management?",
                "What prerequisites do I need to fulfill for BSc. Landscape Design Management?",
                "What subjects do I need to take for BSc. Landscape Design Management?",
                "What are the academic requirements to get into BSc. Landscape Design Management?",
                "What qualifications are needed to be admitted to BSc. Landscape Design Management?",
                "What academic subjects must be studied for BSc. Landscape Design Management?",
                "What are the needed subjects for BSc. Landscape Design Management?",
                "What do I need to study to qualify for BSc. Landscape Design Management?",
                "What qualifications are needed to pursue a BSc. in Landscape Design Management?",
                "what land design and management"    
            ],
            "responses": [
                "Here are the requirements for BSc. Landscape Design and Management <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:</b> Credit passes in THREE Subject from the following options: </p><ul><li><b>Science:</b> Chemistry, Physics or Mathematics or Crop Husbandry, Biology or General Agriculture.  </li><li><b>General Arts:</b> Mathematics, Geography, Economics, Technical Drawing and General Knowledge in Art.  </li><li><b>Visual Art:</b> General Knowledge in Art, Graphic Design, Chemistry, Picture Making, Painting and Sculpture.  </li></ul><br><li><b><u>GCE APPLICANTS </u></b></li><p><b>'O' Level:</b>  Credit passes in FIVE (5) subjects or equivalent qualification including English Language, Mathematics, and any three from: </p><ul><li>Physics, Chemistry, and Biology or Agricultural Science, or </li><li>General Science, Additional General Science, and Additional Mathematics, and any other relevant subject.</li></ul><p><b>'A' Level or equivalent:</b>  Credit passes in THREE (3) subjects or equivalent from  Chemistry, Physics or Mathematics, and Biology or Agricultural Science  </p><br><li><b><u>MATURE APPLICANTS</u></b></li><p>Applicants must have attained the age of 25 years at the time of submitting the Application Forms and must have a minimum of TWO (2) years post qualification experience. In addition, applicant must satisfy any of the following qualifications: </p><ul><li><b>Diploma or Higher National Diploma Applicants:</b> Diploma or Higher National Diploma in Agriculture or Agriculture-related programme from a recognized institution. OR </li><li><b>GCE Applicants:</b> Five (5) credits at 'O' Level including English Language and Mathematics, Biology, Chemistry and Physics, or Additional Mathematics, and Additional General Science. </li><li><b>WASSCE/SSSCE Applicants:</b> Credits passes in THREE (3) Elective subjects in Biology, Chemistry, and Physics or Mathematics or General Agriculture or Crop Husbandry or and Horticulture. </li></ul><br><i>Short-listed applicants may take an Entrance Examination and pass an interview. </i></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Landscape Design and Management Cutoff Points",
            "patterns": [
                "cutoff points for BSc Landscape Design and Management",
                "BSc Landscape Design and Management cutoff points",
                "minimum score for BSc Landscape Design and Management",
                "required score for BSc Landscape Design and Management",
                "aggregate for BSc Landscape Design and Management",
                "what is the cutoff for BSc Landscape Design and Management",
                "cutoff marks for BSc Landscape Design and Management",
                "BSc Landscape Design and Management required marks",
                "what aggregate do I need for BSc Landscape Design and Management",
                "score needed for BSc Landscape Design and Management",
                "cutoff points for Landscape Design and Management",
                "aggregate requirements for Landscape Design and Management",
                "what were the cut-off aggregates for Landscape Design and Management",
                "what are the cut-off aggregates Landscape Design and Management",
                "What is the cutoff point for BSc Landscape Design and Management?",
                "Can you tell me the cutoff point for BSc Landscape Design and Management?",
                "Could you provide the cutoff point for BSc Landscape Design and Management?",
                "What's the cutoff score for BSc Landscape Design and Management?",
                "Do you know the cutoff for BSc Landscape Design and Management?",
                "How many points do I need for BSc Landscape Design and Management?",
                "What's the required aggregate for BSc Landscape Design and Management?",
                "What is the entry cutoff for BSc Landscape Design and Management?",
                "What score is needed for BSc Landscape Design and Management?",
                "What's the minimum score for BSc Landscape Design and Management?",
                "What's the admission cutoff for BSc Landscape Design and Management?",
                "How much do I need to score for BSc Landscape Design and Management?",
                "What's the cutoff mark for BSc Landscape Design and Management?",
                "How high does my score need to be for BSc Landscape Design and Management?",
                "What's the threshold for BSc Landscape Design and Management?",
                "What's the lowest score accepted for BSc Landscape Design and Management?",
                "How many points are required for BSc Landscape Design and Management?",
                "What's the point cutoff for BSc Landscape Design and Management?",
                "Can you tell me the score needed for BSc Landscape Design and Management?",
                "What is the cutoff point for entering BSc Landscape Design and Management?",
                "What's the required score for BSc Landscape Design and Management?",
                "What's the aggregate needed for BSc Landscape Design and Management?",
                "How many points to get into BSc Landscape Design and Management?",
                "What's the minimum aggregate for BSc Landscape Design and Management?",
                "What's the lowest mark accepted for BSc Landscape Design and Management?",
                "How many points are needed for BSc Landscape Design and Management?",
                "What's the cutoff score for getting into BSc Landscape Design and Management?",
                "How many points do I need to get into BSc Landscape Design and Management?",
                "What score do I need to enter BSc Landscape Design and Management?",
                "What's the entry score for BSc Landscape Design and Management?",
                "What's the minimum points for BSc Landscape Design and Management?",
                "What's the required points for BSc Landscape Design and Management?",
                "How much do I need to score to get into BSc Landscape Design and Management?",
                "What's the score requirement for BSc Landscape Design and Management?",
                "What's the point requirement for BSc Landscape Design and Management?",
                "What's the aggregate score for BSc Landscape Design and Management?",
                "How high does my aggregate need to be for BSc Landscape Design and Management?",
                "What's the minimum score requirement for BSc Landscape Design and Management?",
                "What's the minimum aggregate score for BSc Landscape Design and Management?",
                "What's the lowest score needed for BSc Landscape Design and Management?",
                "What score do I need for BSc Landscape Design and Management?",
                "What's the cutoff aggregate for BSc Landscape Design and Management?",
                "How many points to qualify for BSc Landscape Design and Management?",
                "What's the minimum required score for BSc Landscape Design and Management?",
                "What's the required cutoff for BSc Landscape Design and Management?",
                "What's the minimum threshold for BSc Landscape Design and Management?",
                "What's the admission score for BSc Landscape Design and Management?",
                "What's the required mark for BSc Landscape Design and Management?",
                "What's the lowest score requirement for BSc Landscape Design and Management?",
                "How many points are required to get into BSc Landscape Design and Management?",
                "What's the cutoff entry point for BSc Landscape Design and Management?",
                "How many points do I need to be accepted into BSc Landscape Design and Management?",
                "What's the minimum cutoff score for BSc Landscape Design and Management?",
                "What's the score needed for BSc Landscape Design and Management admission?",
                "What's the aggregate cutoff for BSc Landscape Design and Management?",
                "What's the required entry score for BSc Landscape Design and Management?",
                "How high must my score be for BSc Landscape Design and Management?",
                "What's the point aggregate for BSc Landscape Design and Management?",
                "What's the threshold score for BSc Landscape Design and Management?",
                "How much do I need to get into BSc Landscape Design and Management?",
                "What's the lowest score required for BSc Landscape Design and Management?",
                "What's the entry mark for BSc Landscape Design and Management?",
                "What's the required score to get into BSc Landscape Design and Management?",
                "What's the entry threshold for BSc Landscape Design and Management?",
                "What's the score cutoff for BSc Landscape Design and Management?",
                "How many points must I score for BSc Landscape Design and Management?",
                "What's the aggregate required for BSc Landscape Design and Management?",
                "What's the minimum points needed for BSc Landscape Design and Management?",
                "What's the minimum mark for BSc Landscape Design and Management?",
                "What's the lowest entry score for BSc Landscape Design and Management?",
                "What's the cutoff mark to get into BSc Landscape Design and Management?",
                "How high does my score have to be for BSc Landscape Design and Management?",
                "What's the minimum aggregate points for BSc Landscape Design and Management?",
                "What's the required entry aggregate for BSc Landscape Design and Management?",
                "How many points are needed to get into BSc Landscape Design and Management?",
                "What's the score threshold for BSc Landscape Design and Management?",
                "What's the aggregate to get into BSc Landscape Design and Management?",
                "What's the minimum score needed to get into BSc Landscape Design and Management?",
                "What's the minimum cutoff mark for BSc Landscape Design and Management?",
                "What's the lowest score to get into BSc Landscape Design and Management?",
                "What's the admission cutoff mark for BSc Landscape Design and Management?",
                "What's the minimum entry score for BSc Landscape Design and Management?",
                "What's the point cutoff for getting into BSc Landscape Design and Management?",
                "What's the lowest points needed for BSc Landscape Design and Management?",
                "What's the required cutoff points for BSc Landscape Design and Management?",
                "How much do I need to score to be accepted into BSc Landscape Design and Management?",
                "What's the lowest score accepted into BSc Landscape Design and Management?",
                "What's the required aggregate to get into BSc Landscape Design and Management?",
                "What's the cutoff for BSc Landscape Design and Management admission?",
                "How many points to be accepted into BSc Landscape Design and Management?",
                "What's the minimum points requirement for BSc Landscape Design and Management?",
                "What's the entry cutoff score for BSc Landscape Design and Management?",
                "What's the minimum points to get into BSc Landscape Design and Management?",
                "What's the required points to get into BSc Landscape Design and Management?",
                "What's the lowest score requirement for BSc Landscape Design and Management admission?",
                "What's the cutoff point requirement for BSc Landscape Design and Management?",
                "How high does my score need to be to get into BSc Landscape Design and Management?",
                "What's the minimum mark requirement for BSc Landscape Design and Management?",
                "How many points do I need to be eligible for BSc Landscape Design and Management?",
                "What's the required score for BSc Landscape Design and Management entry?",
                "What's the cutoff points for BSc Landscape Design and Management?",
                "What's the minimum threshold points for BSc Landscape Design and Management?",
                "What's the score requirement to get into BSc Landscape Design and Management?",
                "What's the minimum required points for BSc Landscape Design and Management?",
                "What's the admission score requirement for BSc Landscape Design and Management?",
                "What's the cutoff aggregate points for BSc Landscape Design and Management?",
                "How many points do I need to qualify for BSc Landscape Design and Management?",
                "What's the minimum entry points for BSc Landscape Design and Management?",
                "What's the required cutoff mark for BSc Landscape Design and Management?",
                "What's the lowest points requirement for BSc Landscape Design and Management?",
                "What's the cutoff score requirement for BSc Landscape Design and Management?",
                "How high must my aggregate be for BSc Landscape Design and Management?",
                "What's the score threshold for getting into BSc Landscape Design and Management?",
                "score for landscape design and management",
                "score for design and management",
                "score for land design in knust",
                "give me the cutoff point for land design",
                "what of land design and management",
                "what is the cut land design and management ?",
                "how high must my aggregate be for bsc landscape design and management ?"
            ],
            "responses": [
                "The cutoff points for BSc. Landscape Design and Management are typically around aggregate 19. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc_Landscape_Design_Management_fees",
            "patterns": [
                "what is the fees for Landscape Design Management",
                "Can I know the amount I will pay for Landscape Design Management",
                "Can i pay the fees in installment Landscape Design Management?",
                "When should i pay the fees Landscape Design Management?",
                "Can i book for a hall before paying fees Landscape Design Management",
                "How much are the fees for BSc. Landscape Design Management?",
                "What are the tuition fees for BSc. Landscape Design Management?",
                "How much do I need to pay for BSc. Landscape Design Management?",
                "What is the cost of the BSc. Landscape Design Management programme?",
                "Can you provide the fee details for BSc. Landscape Design Management?",
                "What is the tuition cost for BSc. Landscape Design Management?",
                "How much is the fee for studying Landscape Design Management?",
                "What is the payment schedule for BSc. Landscape Design Management fees?",
                "Do I have to pay the full fee for BSc. Landscape Design Management upfront?",
                "What is the fee structure for BSc. Landscape Design Management?",
                "Can I pay my BSc. Landscape Design Management fees in installments?",
                "What are the fee payment options for BSc. Landscape Design Management?",
                "How are the fees for BSc. Landscape Design Management calculated?",
                "Are there any additional costs for BSc. Landscape Design Management?",
                "What is the total cost of BSc. Landscape Design Management for a year?",
                "Are there any extra fees for BSc. Landscape Design Management?",
                "Can I get a breakdown of the BSc. Landscape Design Management fees?",
                "What is the annual fee for BSc. Landscape Design Management?",
                "How much does each semester cost for BSc. Landscape Design Management?",
                "What are the miscellaneous fees for BSc. Landscape Design Management?",
                "Are there any lab fees for BSc. Landscape Design Management?",
                "What are the accommodation fees for BSc. Landscape Design Management?",
                "How much are the hostel fees for BSc. Landscape Design Management students?",
                "What is the fee for international students in BSc. Landscape Design Management?",
                "Do international students pay higher fees for BSc. Landscape Design Management?",
                "What is the fee for fee-paying students in BSc. Landscape Design Management?",
                "Are there fee waivers for BSc. Landscape Design Management?",
                "Are scholarships available to cover BSc. Landscape Design Management fees?",
                "What are the financial aid options for BSc. Landscape Design Management?",
                "How much should I budget for BSc. Landscape Design Management fees?",
                "Is there a fee refund policy for BSc. Landscape Design Management?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Landscape Design Management?",
                "What is the refund policy for BSc. Landscape Design Management fees?",
                "What is the deadline for paying BSc. Landscape Design Management fees?",
                "Can I get a fee extension for BSc. Landscape Design Management?",
                "What is the penalty for late payment of BSc. Landscape Design Management fees?",
                "Can I pay BSc. Landscape Design Management fees in multiple payments?",
                "Are there any hidden costs for BSc. Landscape Design Management?",
                "What are the compulsory fees for BSc. Landscape Design Management?",
                "Can I pay BSc. Landscape Design Management fees with a payment plan?",
                "How often do I need to pay fees for BSc. Landscape Design Management?",
                "What are the semester fees for BSc. Landscape Design Management?",
                "Is there an application fee for BSc. Landscape Design Management?",
                "What is the registration fee for BSc. Landscape Design Management?",
                "Are the fees for BSc. Landscape Design Management fixed or variable?",
                "What is the cost per credit hour for BSc. Landscape Design Management?",
                "Are there any discounts available for BSc. Landscape Design Management fees?",
                "Can I get a fee breakdown for BSc. Landscape Design Management?",
                "What are the non-tuition fees for BSc. Landscape Design Management?",
                "Are there any additional charges for BSc. Landscape Design Management?",
                "How much is the acceptance fee for BSc. Landscape Design Management?",
                "Can I book a hall without paying the BSc. Landscape Design Management fees?",
                "What are the hostel booking requirements for BSc. Landscape Design Management?",
                "When are the BSc. Landscape Design Management fees due?",
                "What is the initial deposit for BSc. Landscape Design Management fees?",
                "How do I pay my BSc. Landscape Design Management fees online?",
                "Are there any late fees for BSc. Landscape Design Management?",
                "What is the mode of payment for BSc. Landscape Design Management fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Landscape Design Management?",
                "How do I access my fee statement for BSc. Landscape Design Management?",
                "What is the last date to pay fees for BSc. Landscape Design Management?",
                "Is there an online payment option for BSc. Landscape Design Management fees?",
                "What is the procedure for paying BSc. Landscape Design Management fees?",
                "What is the tuition fee for the first year of BSc. Landscape Design Management?",
                "Are there any financial aid options for BSc. Landscape Design Management?",


                "What is included in the BSc. Landscape Design Management fee?",
                "Can I get a fee waiver for BSc. Landscape Design Management?"


            ],
            "responses": [
                "The fees for BSc. Landscape Design Management programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_natural_resource_management_requirements",
            "patterns": [
                "What are the requirements for BSc. Natural Resource Management?",
                "Can you provide the admission criteria for BSc. Natural Resource Management?",
                "Requirements for BSc. Natural Resource Management programme?",
                "What are the prerequisites for BSc. Natural Resource Management?",
                "BSc. Natural Resource Management admission requirements?",
                "Information on eligibility for BSc. Natural Resource Management programme?",
                "What are the entry requirements for BSc. Natural Resource Management programme?",
                "Criteria for admission into BSc. Natural Resource Management?",
                "BSc. Natural Resource Management programme prerequisites?",
                "What are the requirements for BSc. Natural Resource Management?",
                "What do I need to qualify for BSc. Natural Resource Management?",
                "What qualifications are needed for BSc. Natural Resource Management?",
                "What are the entry requirements for BSc. Natural Resource Management?",
                "What are the admission requirements for BSc. Natural Resource Management?",
                "What prerequisites are required for BSc. Natural Resource Management?",
                "What are the academic requirements for BSc. Natural Resource Management?",
                "What grades do I need for BSc. Natural Resource Management?",
                "What subjects are required for BSc. Natural Resource Management?",
                "What criteria do I need to meet for BSc. Natural Resource Management?",
                "What qualifications must I have for BSc. Natural Resource Management?",
                "What are the eligibility requirements for BSc. Natural Resource Management?",
                "What academic qualifications are required for BSc. Natural Resource Management?",
                "What educational background is needed for BSc. Natural Resource Management?",
                "What high school subjects are required for BSc. Natural Resource Management?",
                "What are the subject requirements for BSc. Natural Resource Management?",
                "What qualifications do I need for BSc. Natural Resource Management?",
                "What are the mandatory subjects for BSc. Natural Resource Management?",
                "What qualifications should I have for BSc. Natural Resource Management?",
                "What grades are needed for BSc. Natural Resource Management?",
                "What entry qualifications are required for BSc. Natural Resource Management?",
                "What are the course requirements for BSc. Natural Resource Management?",
                "What qualifications are necessary for BSc. Natural Resource Management?",
                "What do I need to study BSc. Natural Resource Management?",
                "What qualifications do I need to pursue BSc. Natural Resource Management?",
                "What are the minimum requirements for BSc. Natural Resource Management?",
                "What credentials are required for BSc. Natural Resource Management?",
                "What is needed to apply for BSc. Natural Resource Management?",
                "What are the required subjects for BSc. Natural Resource Management?",
                "What qualifications do I need to enroll in BSc. Natural Resource Management?",
                "What are the academic prerequisites for BSc. Natural Resource Management?",
                "What high school qualifications are needed for BSc. Natural Resource Management?",
                "What requirements must be met for BSc. Natural Resource Management?",
                "What are the admission criteria for BSc. Natural Resource Management?",
                "What are the necessary qualifications for BSc. Natural Resource Management?",
                "What are the educational requirements for BSc. Natural Resource Management?",
                "What do I need to be eligible for BSc. Natural Resource Management?",
                "What academic background is required for BSc. Natural Resource Management?",
                "What prerequisites do I need for BSc. Natural Resource Management?",
                "What qualifications are needed to apply for BSc. Natural Resource Management?",
                "What qualifications do I need to get into BSc. Natural Resource Management?",
                "What subjects do I need to study for BSc. Natural Resource Management?",
                "What qualifications are needed to enroll in BSc. Natural Resource Management?",
                "What are the qualification requirements for BSc. Natural Resource Management?",
                "What subjects must I take for BSc. Natural Resource Management?",
                "What grades do I need to get into BSc. Natural Resource Management?",
                "What are the required qualifications for BSc. Natural Resource Management?",
                "What educational qualifications are needed for BSc. Natural Resource Management?",
                "What qualifications are required to study BSc. Natural Resource Management?",
                "What requirements do I need to fulfill for BSc. Natural Resource Management?",
                "What subjects should I have studied for BSc. Natural Resource Management?",
                "What do I need to have to qualify for BSc. Natural Resource Management?",
                "What subjects do I need to qualify for BSc. Natural Resource Management?",
                "What qualifications do I need to meet for BSc. Natural Resource Management?",
                "What qualifications must be met for BSc. Natural Resource Management?",
                "What are the needed qualifications for BSc. Natural Resource Management?",
                "What academic subjects are required for BSc. Natural Resource Management?",
                "What requirements must I meet for BSc. Natural Resource Management?",
                "What do I need to qualify for a BSc. in Natural Resource Management?",
                "What grades are required for BSc. Natural Resource Management?",
                "What academic credentials are needed for BSc. Natural Resource Management?",
                "What subjects are necessary for BSc. Natural Resource Management?",
                "What qualifications do I need for a BSc. in Natural Resource Management?",
                "What educational qualifications must I have for BSc. Natural Resource Management?",
                "What criteria must be met for BSc. Natural Resource Management?",
                "What qualifications are necessary to study BSc. Natural Resource Management?",
                "What subjects are required to study BSc. Natural Resource Management?",
                "What prerequisites do I need to study BSc. Natural Resource Management?",
                "What subjects must be taken for BSc. Natural Resource Management?",
                "What are the requirements for enrolling in BSc. Natural Resource Management?",
                "What qualifications do I need for admission to BSc. Natural Resource Management?",
                "What are the required grades for BSc. Natural Resource Management?",
                "What subjects are required for admission to BSc. Natural Resource Management?",
                "What subjects should I study for BSc. Natural Resource Management?",
                "What prerequisites are needed for BSc. Natural Resource Management?",
                "What do I need to be admitted to BSc. Natural Resource Management?",
                "What qualifications are needed for a BSc. in Natural Resource Management?",
                "What academic qualifications must be met for BSc. Natural Resource Management?",
                "What subjects are required to get into BSc. Natural Resource Management?",
                "What are the eligibility criteria for BSc. Natural Resource Management?",
                "What requirements do I need to be admitted to BSc. Natural Resource Management?",
                "What qualifications are required for admission to BSc. Natural Resource Management?",
                "What educational background do I need for BSc. Natural Resource Management?",
                "What qualifications do I need for applying to BSc. Natural Resource Management?",
                "What subjects do I need to meet the requirements for BSc. Natural Resource Management?",
                "What prerequisites do I need to fulfill for BSc. Natural Resource Management?",
                "What subjects do I need to take for BSc. Natural Resource Management?",
                "What are the academic requirements to get into BSc. Natural Resource Management?",
                "What qualifications are needed to be admitted to BSc. Natural Resource Management?",
                "What academic subjects must be studied for BSc. Natural Resource Management?",
                "What are the needed subjects for BSc. Natural Resource Management?",
                "What do I need to study to qualify for BSc. Natural Resource Management?",
                "What qualifications are needed to pursue a BSc. in Natural Resource Management?"
            ],
            "responses": [
                "Here are the requirements for BSc. Natural Resource Management <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:</b> Chemistry, Physics or Mathematics, and Biology or General Agriculture.</p><br><li><b><u>'A' LEVEL APPLICANT </u></b></li><p><b>'O' Level:</b> Credit passes in FIVE (5) subjects or equivalent qualification including English Language and Mathematics. </p><p><b>'A' Level or equivalent:</b> Credit passes in Chemistry, Physics and any one from Biology, Agricultural Science, and Mathematics. Applicants with Agricultural Science or Mathematics. Applicant must have a credit in 'O' Level Biology.     </p><br><li><b><u>DIPLOMA HOLDERS  </u></b></li><ul><li>Two (2) Years Post Diploma field experience.  </li><li>An applicant must satisfy the requirements for WASSCE OR 'A' Level.  </li><li>Shortlisted applicants must pass an interview.</li></ul><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicant must have attained the age of 25 years at the time of the application.</li><li>Must have a minimum of Two (2) Years post qualification experience in a related field of Natural Resources Management.  </li><li>Must satisfy the requirements for WASSCE OR 'A' Level. </li><li>Short-listed applicants must pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Natural Resources Management Cutoff Points",
            "patterns": [
                "cutoff points for BSc Natural Resources Management",
                "BSc Natural Resources Management cutoff points",
                "minimum score for BSc Natural Resources Management",
                "required score for BSc Natural Resources Management",
                "aggregate for BSc Natural Resources Management",
                "what is the cutoff for BSc Natural Resources Management",
                "cutoff marks for BSc Natural Resources Management",
                "BSc Natural Resources Management required marks",
                "what aggregate do I need for BSc Natural Resources Management",
                "score needed for BSc Natural Resources Management",
                "cutoff points for Natural Resources Management",
                "aggregate requirements for Natural Resources Management",
                "what were the cut-off aggregates for Natural Resources Management",
                "what are the cut-off aggregates Natural Resources Management",
                "What is the cutoff point for BSc Natural Resources Management?",
                "Can you tell me the cutoff point for BSc Natural Resources Management?",
                "Could you provide the cutoff point for BSc Natural Resources Management?",
                "What's the cutoff score for BSc Natural Resources Management?",
                "Do you know the cutoff for BSc Natural Resources Management?",
                "How many points do I need for BSc Natural Resources Management?",
                "What's the required aggregate for BSc Natural Resources Management?",
                "What is the entry cutoff for BSc Natural Resources Management?",
                "What score is needed for BSc Natural Resources Management?",
                "What's the minimum score for BSc Natural Resources Management?",
                "What's the admission cutoff for BSc Natural Resources Management?",
                "How much do I need to score for BSc Natural Resources Management?",
                "What's the cutoff mark for BSc Natural Resources Management?",
                "How high does my score need to be for BSc Natural Resources Management?",
                "What's the threshold for BSc Natural Resources Management?",
                "What's the lowest score accepted for BSc Natural Resources Management?",
                "How many points are required for BSc Natural Resources Management?",
                "What's the point cutoff for BSc Natural Resources Management?",
                "Can you tell me the score needed for BSc Natural Resources Management?",
                "What is the cutoff point for entering BSc Natural Resources Management?",
                "What's the required score for BSc Natural Resources Management?",
                "What's the aggregate needed for BSc Natural Resources Management?",
                "How many points to get into BSc Natural Resources Management?",
                "What's the minimum aggregate for BSc Natural Resources Management?",
                "What's the lowest mark accepted for BSc Natural Resources Management?",
                "How many points are needed for BSc Natural Resources Management?",
                "What's the cutoff score for getting into BSc Natural Resources Management?",
                "How many points do I need to get into BSc Natural Resources Management?",
                "What score do I need to enter BSc Natural Resources Management?",
                "What's the entry score for BSc Natural Resources Management?",
                "What's the minimum points for BSc Natural Resources Management?",
                "What's the required points for BSc Natural Resources Management?",
                "How much do I need to score to get into BSc Natural Resources Management?",
                "What's the score requirement for BSc Natural Resources Management?",
                "What's the point requirement for BSc Natural Resources Management?",
                "What's the aggregate score for BSc Natural Resources Management?",
                "How high does my aggregate need to be for BSc Natural Resources Management?",
                "What's the minimum score requirement for BSc Natural Resources Management?",
                "What's the minimum aggregate score for BSc Natural Resources Management?",
                "What's the lowest score needed for BSc Natural Resources Management?",
                "What score do I need for BSc Natural Resources Management?",
                "What's the cutoff aggregate for BSc Natural Resources Management?",
                "How many points to qualify for BSc Natural Resources Management?",
                "What's the minimum required score for BSc Natural Resources Management?",
                "What's the required cutoff for BSc Natural Resources Management?",
                "What's the minimum threshold for BSc Natural Resources Management?",
                "What's the admission score for BSc Natural Resources Management?",
                "What's the required mark for BSc Natural Resources Management?",
                "What's the lowest score requirement for BSc Natural Resources Management?",
                "How many points are required to get into BSc Natural Resources Management?",
                "What's the cutoff entry point for BSc Natural Resources Management?",
                "How many points do I need to be accepted into BSc Natural Resources Management?",
                "What's the minimum cutoff score for BSc Natural Resources Management?",
                "What's the score needed for BSc Natural Resources Management admission?",
                "What's the aggregate cutoff for BSc Natural Resources Management?",
                "What's the required entry score for BSc Natural Resources Management?",
                "How high must my score be for BSc Natural Resources Management?",
                "What's the point aggregate for BSc Natural Resources Management?",
                "What's the threshold score for BSc Natural Resources Management?",
                "How much do I need to get into BSc Natural Resources Management?",
                "What's the lowest score required for BSc Natural Resources Management?",
                "What's the entry mark for BSc Natural Resources Management?",
                "What's the required score to get into BSc Natural Resources Management?",
                "What's the entry threshold for BSc Natural Resources Management?",
                "What's the score cutoff for BSc Natural Resources Management?",
                "How many points must I score for BSc Natural Resources Management?",
                "What's the aggregate required for BSc Natural Resources Management?",
                "What's the minimum points needed for BSc Natural Resources Management?",
                "What's the minimum mark for BSc Natural Resources Management?",
                "What's the lowest entry score for BSc Natural Resources Management?",
                "What's the cutoff mark to get into BSc Natural Resources Management?",
                "How high does my score have to be for BSc Natural Resources Management?",
                "What's the minimum aggregate points for BSc Natural Resources Management?",
                "What's the required entry aggregate for BSc Natural Resources Management?",
                "How many points are needed to get into BSc Natural Resources Management?",
                "What's the score threshold for BSc Natural Resources Management?",
                "What's the aggregate to get into BSc Natural Resources Management?",
                "What's the minimum score needed to get into BSc Natural Resources Management?",
                "What's the minimum cutoff mark for BSc Natural Resources Management?",
                "What's the lowest score to get into BSc Natural Resources Management?",
                "What's the admission cutoff mark for BSc Natural Resources Management?",
                "What's the minimum entry score for BSc Natural Resources Management?",
                "What's the point cutoff for getting into BSc Natural Resources Management?",
                "What's the lowest points needed for BSc Natural Resources Management?",
                "What's the required cutoff points for BSc Natural Resources Management?",
                "How much do I need to score to be accepted into BSc Natural Resources Management?",
                "What's the lowest score accepted into BSc Natural Resources Management?",
                "What's the required aggregate to get into BSc Natural Resources Management?",
                "What's the cutoff for BSc Natural Resources Management admission?",
                "How many points to be accepted into BSc Natural Resources Management?",
                "What's the minimum points requirement for BSc Natural Resources Management?",
                "What's the entry cutoff score for BSc Natural Resources Management?"
                
            ],
            "responses": [
                "The cutoff points for BSc. Natural Resources Management are typically around aggregate 18. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc_Natural_Resource_Management_fees",
            "patterns": [
                "what is the fees for Natural Resource Management",
                "Can I know the amount I will pay for Natural Resource Management",
                "Can i pay the fees in installment Natural Resource Management?",
                "When should i pay the fees Natural Resource Management?",
                "Can i book for a hall before paying fees Natural Resource Management",
                "How much are the fees for BSc. Natural Resource Management?",
                "What are the tuition fees for BSc. Natural Resource Management?",
                "How much do I need to pay for BSc. Natural Resource Management?",
                "What is the cost of the BSc. Natural Resource Management programme?",
                "Can you provide the fee details for BSc. Natural Resource Management?",
                "What is the tuition cost for BSc. Natural Resource Management?",
                "How much is the fee for studying Natural Resource Management?",
                "What is the payment schedule for BSc. Natural Resource Management fees?",
                "Do I have to pay the full fee for BSc. Natural Resource Management upfront?",
                "What is the fee structure for BSc. Natural Resource Management?",
                "Can I pay my BSc. Natural Resource Management fees in installments?",
                "What are the fee payment options for BSc. Natural Resource Management?",
                "How are the fees for BSc. Natural Resource Management calculated?",
                "Are there any additional costs for BSc. Natural Resource Management?",
                "What is the total cost of BSc. Natural Resource Management for a year?",
                "Are there any extra fees for BSc. Natural Resource Management?",
                "Can I get a breakdown of the BSc. Natural Resource Management fees?",
                "What is the annual fee for BSc. Natural Resource Management?",
                "How much does each semester cost for BSc. Natural Resource Management?",
                "What are the miscellaneous fees for BSc. Natural Resource Management?",
                "Are there any lab fees for BSc. Natural Resource Management?",
                "What are the accommodation fees for BSc. Natural Resource Management?",
                "How much are the hostel fees for BSc. Natural Resource Management students?",
                "What is the fee for international students in BSc. Natural Resource Management?",
                "Do international students pay higher fees for BSc. Natural Resource Management?",
                "What is the fee for fee-paying students in BSc. Natural Resource Management?",
                "Are there fee waivers for BSc. Natural Resource Management?",
                "Are scholarships available to cover BSc. Natural Resource Management fees?",
                "What are the financial aid options for BSc. Natural Resource Management?",
                "How much should I budget for BSc. Natural Resource Management fees?",
                "Is there a fee refund policy for BSc. Natural Resource Management?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Natural Resource Management?",
                "What is the refund policy for BSc. Natural Resource Management fees?",
                "What is the deadline for paying BSc. Natural Resource Management fees?",
                "Can I get a fee extension for BSc. Natural Resource Management?",
                "What is the penalty for late payment of BSc. Natural Resource Management fees?",
                "Can I pay BSc. Natural Resource Management fees in multiple payments?",
                "Are there any hidden costs for BSc. Natural Resource Management?",
                "What are the compulsory fees for BSc. Natural Resource Management?",
                "Can I pay BSc. Natural Resource Management fees with a payment plan?",
                "How often do I need to pay fees for BSc. Natural Resource Management?",
                "What are the semester fees for BSc. Natural Resource Management?",
                "Is there an application fee for BSc. Natural Resource Management?",
                "What is the registration fee for BSc. Natural Resource Management?",
                "Are the fees for BSc. Natural Resource Management fixed or variable?",
                "What is the cost per credit hour for BSc. Natural Resource Management?",
                "Are there any discounts available for BSc. Natural Resource Management fees?",
                "Can I get a fee breakdown for BSc. Natural Resource Management?",
                "What are the non-tuition fees for BSc. Natural Resource Management?",
                "Are there any additional charges for BSc. Natural Resource Management?",
                "How much is the acceptance fee for BSc. Natural Resource Management?",
                "Can I book a hall without paying the BSc. Natural Resource Management fees?",
                "What are the hostel booking requirements for BSc. Natural Resource Management?",
                "When are the BSc. Natural Resource Management fees due?",
                "What is the initial deposit for BSc. Natural Resource Management fees?",
                "How do I pay my BSc. Natural Resource Management fees online?",
                "Are there any late fees for BSc. Natural Resource Management?",
                "What is the mode of payment for BSc. Natural Resource Management fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Natural Resource Management?",
                "How do I access my fee statement for BSc. Natural Resource Management?",
                "What is the last date to pay fees for BSc. Natural Resource Management?",
                "Is there an online payment option for BSc. Natural Resource Management fees?",
                "What is the procedure for paying BSc. Natural Resource Management fees?",
                "What is the tuition fee for the first year of BSc. Natural Resource Management?",
                "Are there any financial aid options for BSc. Natural Resource Management?",


                "What is included in the BSc. Natural Resource Management fee?",
                "Can I get a fee waiver for BSc. Natural Resource Management?"


            ],
            "responses": [
                "The fees for BSc. Natural Resource Management programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_forest_resource_technology_requirements",
            "patterns": [
                "What are the requirements for BSc. Forest Resource Technology?",
                "Can you provide the admission criteria for BSc. Forest Resource Technology?",
                "Requirements for BSc. Forest Resource Technology programme?",
                "What are the prerequisites for BSc. Forest Resource Technology?",
                "BSc. Forest Resource Technology admission requirements?",
                "Information on eligibility for BSc. Forest Resource Technology programme?",
                "What are the entry requirements for BSc. Forest Resource Technology programme?",
                "Criteria for admission into BSc. Forest Resource Technology?",
                "BSc. Forest Resource Technology programme prerequisites?",
                "What are the requirements for BSc. Forest Resource Technology?",
                "What do I need to qualify for BSc. Forest Resource Technology?",
                "What qualifications are needed for BSc. Forest Resource Technology?",
                "What are the entry requirements for BSc. Forest Resource Technology?",
                "What are the admission requirements for BSc. Forest Resource Technology?",
                "What prerequisites are required for BSc. Forest Resource Technology?",
                "What are the academic requirements for BSc. Forest Resource Technology?",
                "What grades do I need for BSc. Forest Resource Technology?",
                "What subjects are required for BSc. Forest Resource Technology?",
                "What criteria do I need to meet for BSc. Forest Resource Technology?",
                "What qualifications must I have for BSc. Forest Resource Technology?",
                "What are the eligibility requirements for BSc. Forest Resource Technology?",
                "What academic qualifications are required for BSc. Forest Resource Technology?",
                "What educational background is needed for BSc. Forest Resource Technology?",
                "What high school subjects are required for BSc. Forest Resource Technology?",
                "What are the subject requirements for BSc. Forest Resource Technology?",
                "What qualifications do I need for BSc. Forest Resource Technology?",
                "What are the mandatory subjects for BSc. Forest Resource Technology?",
                "What qualifications should I have for BSc. Forest Resource Technology?",
                "What grades are needed for BSc. Forest Resource Technology?",
                "What entry qualifications are required for BSc. Forest Resource Technology?",
                "What are the course requirements for BSc. Forest Resource Technology?",
                "What qualifications are necessary for BSc. Forest Resource Technology?",
                "What do I need to study BSc. Forest Resource Technology?",
                "What qualifications do I need to pursue BSc. Forest Resource Technology?",
                "What are the minimum requirements for BSc. Forest Resource Technology?",
                "What credentials are required for BSc. Forest Resource Technology?",
                "What is needed to apply for BSc. Forest Resource Technology?",
                "What are the required subjects for BSc. Forest Resource Technology?",
                "What qualifications do I need to enroll in BSc. Forest Resource Technology?",
                "What are the academic prerequisites for BSc. Forest Resource Technology?",
                "What high school qualifications are needed for BSc. Forest Resource Technology?",
                "What requirements must be met for BSc. Forest Resource Technology?",
                "What are the admission criteria for BSc. Forest Resource Technology?",
                "What are the necessary qualifications for BSc. Forest Resource Technology?",
                "What are the educational requirements for BSc. Forest Resource Technology?",
                "What do I need to be eligible for BSc. Forest Resource Technology?",
                "What academic background is required for BSc. Forest Resource Technology?",
                "What prerequisites do I need for BSc. Forest Resource Technology?",
                "What qualifications are needed to apply for BSc. Forest Resource Technology?",
                "What qualifications do I need to get into BSc. Forest Resource Technology?",
                "What subjects do I need to study for BSc. Forest Resource Technology?",
                "What qualifications are needed to enroll in BSc. Forest Resource Technology?",
                "What are the qualification requirements for BSc. Forest Resource Technology?",
                "What subjects must I take for BSc. Forest Resource Technology?",
                "What grades do I need to get into BSc. Forest Resource Technology?",
                "What are the required qualifications for BSc. Forest Resource Technology?",
                "What educational qualifications are needed for BSc. Forest Resource Technology?",
                "What qualifications are required to study BSc. Forest Resource Technology?",
                "What requirements do I need to fulfill for BSc. Forest Resource Technology?",
                "What subjects should I have studied for BSc. Forest Resource Technology?",
                "What do I need to have to qualify for BSc. Forest Resource Technology?",
                "What subjects do I need to qualify for BSc. Forest Resource Technology?",
                "What qualifications do I need to meet for BSc. Forest Resource Technology?",
                "What qualifications must be met for BSc. Forest Resource Technology?",
                "What are the needed qualifications for BSc. Forest Resource Technology?",
                "What academic subjects are required for BSc. Forest Resource Technology?",
                "What requirements must I meet for BSc. Forest Resource Technology?",
                "What do I need to qualify for a BSc. in Forest Resource Technology?",
                "What grades are required for BSc. Forest Resource Technology?",
                "What academic credentials are needed for BSc. Forest Resource Technology?",
                "What subjects are necessary for BSc. Forest Resource Technology?",
                "What qualifications do I need for a BSc. in Forest Resource Technology?",
                "What educational qualifications must I have for BSc. Forest Resource Technology?",
                "What criteria must be met for BSc. Forest Resource Technology?",
                "What qualifications are necessary to study BSc. Forest Resource Technology?",
                "What subjects are required to study BSc. Forest Resource Technology?",
                "What prerequisites do I need to study BSc. Forest Resource Technology?",
                "What subjects must be taken for BSc. Forest Resource Technology?",
                "What are the requirements for enrolling in BSc. Forest Resource Technology?",
                "What qualifications do I need for admission to BSc. Forest Resource Technology?",
                "What are the required grades for BSc. Forest Resource Technology?",
                "What subjects are required for admission to BSc. Forest Resource Technology?",
                "What subjects should I study for BSc. Forest Resource Technology?",
                "What prerequisites are needed for BSc. Forest Resource Technology?",
                "What do I need to be admitted to BSc. Forest Resource Technology?",
                "What qualifications are needed for a BSc. in Forest Resource Technology?",
                "What academic qualifications must be met for BSc. Forest Resource Technology?",
                "What subjects are required to get into BSc. Forest Resource Technology?",
                "What are the eligibility criteria for BSc. Forest Resource Technology?",
                "What requirements do I need to be admitted to BSc. Forest Resource Technology?",
                "What qualifications are required for admission to BSc. Forest Resource Technology?",
                "What educational background do I need for BSc. Forest Resource Technology?",
                "What qualifications do I need for applying to BSc. Forest Resource Technology?",
                "What subjects do I need to meet the requirements for BSc. Forest Resource Technology?",
                "What prerequisites do I need to fulfill for BSc. Forest Resource Technology?",
                "What subjects do I need to take for BSc. Forest Resource Technology?",
                "What are the academic requirements to get into BSc. Forest Resource Technology?",
                "What qualifications are needed to be admitted to BSc. Forest Resource Technology?",
                "What academic subjects must be studied for BSc. Forest Resource Technology?",
                "What are the needed subjects for BSc. Forest Resource Technology?",
                "What do I need to study to qualify for BSc. Forest Resource Technology?",
                "What qualifications are needed to pursue a BSc. in Forest Resource Technology?"
            ],
            "responses": [
                "Here are the requirements for BSc. Forest Resource Technology <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:</b> Chemistry, Physics or Mathematics, and Biology or General Agriculture.</p><br><li><b><u>'A' LEVEL APPLICANT </u></b></li><p><b>'O' Level:</b> Credit passes in FIVE (5) subjects or equivalent qualification including English Language and Mathematics. </p><p><b>'A' Level or equivalent:</b> Credit passes in Chemistry, Physics and any one from Biology, Agricultural Science, and Mathematics. Applicants with Agricultural Science or Mathematics. Applicant must have a credit in 'O' Level Biology.     </p><br><li><b><u>DIPLOMA HOLDERS  </u></b></li><ul><li>Two (2) Years Post Diploma field experience.  </li><li>An applicant must satisfy the requirements for WASSCE OR 'A' Level.  </li><li>Shortlisted applicants must pass an interview.</li></ul><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicant must have attained the age of 25 years at the time of the application.</li><li>Must have a minimum of Two (2) Years post qualification experience in a related field of Natural Resources Management.  </li><li>Must satisfy the requirements for WASSCE OR 'A' Level. </li><li>Short-listed applicants must pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Forest Resources Technology Cutoff Points",
            "patterns": [
                "cutoff points for BSc Forest Resources Technology",
                "BSc Forest Resources Technology cutoff points",
                "minimum score for BSc Forest Resources Technology",
                "required score for BSc Forest Resources Technology",
                "aggregate for BSc Forest Resources Technology",
                "what is the cutoff for BSc Forest Resources Technology",
                "cutoff marks for BSc Forest Resources Technology",
                "BSc Forest Resources Technology required marks",
                "what aggregate do I need for BSc Forest Resources Technology",
                "score needed for BSc Forest Resources Technology",
                "cutoff points for Forest Resources Technology",
                "aggregate requirements for Forest Resources Technology",
                "what were the cut-off aggregates for Forest Resources Technology",
                "what are the cut-off aggregates Forest Resources Technology",
                "What is the cutoff point for BSc Forest Resources Technology?",
                "Can you tell me the cutoff point for BSc Forest Resources Technology?",
                "Could you provide the cutoff point for BSc Forest Resources Technology?",
                "What's the cutoff score for BSc Forest Resources Technology?",
                "Do you know the cutoff for BSc Forest Resources Technology?",
                "How many points do I need for BSc Forest Resources Technology?",
                "What's the required aggregate for BSc Forest Resources Technology?",
                "What is the entry cutoff for BSc Forest Resources Technology?",
                "What score is needed for BSc Forest Resources Technology?",
                "What's the minimum score for BSc Forest Resources Technology?",
                "What's the admission cutoff for BSc Forest Resources Technology?",
                "How much do I need to score for BSc Forest Resources Technology?",
                "What's the cutoff mark for BSc Forest Resources Technology?",
                "How high does my score need to be for BSc Forest Resources Technology?",
                "What's the threshold for BSc Forest Resources Technology?",
                "What's the lowest score accepted for BSc Forest Resources Technology?",
                "How many points are required for BSc Forest Resources Technology?",
                "What's the point cutoff for BSc Forest Resources Technology?",
                "Can you tell me the score needed for BSc Forest Resources Technology?",
                "What is the cutoff point for entering BSc Forest Resources Technology?",
                "What's the required score for BSc Forest Resources Technology?",
                "What's the aggregate needed for BSc Forest Resources Technology?",
                "How many points to get into BSc Forest Resources Technology?",
                "What's the minimum aggregate for BSc Forest Resources Technology?",
                "What's the lowest mark accepted for BSc Forest Resources Technology?",
                "How many points are needed for BSc Forest Resources Technology?",
                "What's the cutoff score for getting into BSc Forest Resources Technology?",
                "How many points do I need to get into BSc Forest Resources Technology?",
                "What score do I need to enter BSc Forest Resources Technology?",
                "What's the entry score for BSc Forest Resources Technology?",
                "What's the minimum points for BSc Forest Resources Technology?",
                "What's the required points for BSc Forest Resources Technology?",
                "How much do I need to score to get into BSc Forest Resources Technology?",
                "What's the score requirement for BSc Forest Resources Technology?",
                "What's the point requirement for BSc Forest Resources Technology?",
                "What's the aggregate score for BSc Forest Resources Technology?",
                "How high does my aggregate need to be for BSc Forest Resources Technology?",
                "What's the minimum score requirement for BSc Forest Resources Technology?"
            ],
            "responses": [
                "The cutoff points for BSc. Forest Resources Technology are typically around aggregate 23. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc_Forest_Resource_Technology_fees",
            "patterns": [
                "what is the fees for Forest Resource Technology",
                "Can I know the amount I will pay for Forest Resource Technology",
                "Can i pay the fees in installment for Forest Resource Technology?",
                "When should i pay the fees for Forest Resource Technology?",
                "Can i book for a hall before paying fees for Forest Resource Technology",
                "How much are the fees for BSc. Forest Resource Technology?",
                "What are the tuition fees for BSc. Forest Resource Technology?",
                "How much do I need to pay for BSc. Forest Resource Technology?",
                "What is the cost of the BSc. Forest Resource Technology programme?",
                "Can you provide the fee details for BSc. Forest Resource Technology?",
                "What is the tuition cost for BSc. Forest Resource Technology?",
                "How much is the fee for studying Forest Resource Technology?",
                "What is the payment schedule for BSc. Forest Resource Technology fees?",
                "Do I have to pay the full fee for BSc. Forest Resource Technology upfront?",
                "What is the fee structure for BSc. Forest Resource Technology?",
                "Can I pay my BSc. Forest Resource Technology fees in installments?",
                "What are the fee payment options for BSc. Forest Resource Technology?",
                "How are the fees for BSc. Forest Resource Technology calculated?",
                "Are there any additional costs for BSc. Forest Resource Technology?",
                "What is the total cost of BSc. Forest Resource Technology for a year?",
                "Are there any extra fees for BSc. Forest Resource Technology?",
                "Can I get a breakdown of the BSc. Forest Resource Technology fees?",
                "What is the annual fee for BSc. Forest Resource Technology?",
                "How much does each semester cost for BSc. Forest Resource Technology?",
                "What are the miscellaneous fees for BSc. Forest Resource Technology?",
                "Are there any lab fees for BSc. Forest Resource Technology?",
                "What are the accommodation fees for BSc. Forest Resource Technology?",
                "How much are the hostel fees for BSc. Forest Resource Technology students?",
                "What is the fee for international students in BSc. Forest Resource Technology?",
                "Do international students pay higher fees for BSc. Forest Resource Technology?",
                "What is the fee for fee-paying students in BSc. Forest Resource Technology?",
                "Are there fee waivers for BSc. Forest Resource Technology?",
                "Are scholarships available to cover BSc. Forest Resource Technology fees?",
                "What are the financial aid options for BSc. Forest Resource Technology?",
                "How much should I budget for BSc. Forest Resource Technology fees?",
                "Is there a fee refund policy for BSc. Forest Resource Technology?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Forest Resource Technology?",
                "What is the refund policy for BSc. Forest Resource Technology fees?",
                "What is the deadline for paying BSc. Forest Resource Technology fees?",
                "Can I get a fee extension for BSc. Forest Resource Technology?",
                "What is the penalty for late payment of BSc. Forest Resource Technology fees?",
                "Can I pay BSc. Forest Resource Technology fees in multiple payments?",
                "Are there any hidden costs for BSc. Forest Resource Technology?",
                "What are the compulsory fees for BSc. Forest Resource Technology?",
                "Can I pay BSc. Forest Resource Technology fees with a payment plan?",
                "How often do I need to pay fees for BSc. Forest Resource Technology?",
                "What are the semester fees for BSc. Forest Resource Technology?",
                "Is there an application fee for BSc. Forest Resource Technology?",
                "What is the registration fee for BSc. Forest Resource Technology?",
                "Are the fees for BSc. Forest Resource Technology fixed or variable?",
                "What is the cost per credit hour for BSc. Forest Resource Technology?",
                "Are there any discounts available for BSc. Forest Resource Technology fees?",
                "Can I get a fee breakdown for BSc. Forest Resource Technology?",
                "What are the non-tuition fees for BSc. Forest Resource Technology?",
                "Are there any additional charges for BSc. Forest Resource Technology?",
                "How much is the acceptance fee for BSc. Forest Resource Technology?",
                "Can I book a hall without paying the BSc. Forest Resource Technology fees?",
                "What are the hostel booking requirements for BSc. Forest Resource Technology?",
                "When are the BSc. Forest Resource Technology fees due?",
                "What is the initial deposit for BSc. Forest Resource Technology fees?",
                "How do I pay my BSc. Forest Resource Technology fees online?",
                "Are there any late fees for BSc. Forest Resource Technology?",
                "What is the mode of payment for BSc. Forest Resource Technology fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Forest Resource Technology?",
                "How do I access my fee statement for BSc. Forest Resource Technology?",
                "What is the last date to pay fees for BSc. Forest Resource Technology?",
                "Is there an online payment option for BSc. Forest Resource Technology fees?",
                "What is the procedure for paying BSc. Forest Resource Technology fees?",
                "What is the tuition fee for the first year of BSc. Forest Resource Technology?",
                "Are there any financial aid options for BSc. Forest Resource Technology?",


                "What is included in the BSc. Forest Resource Technology fee?",
                "Can I get a fee waiver for BSc. Forest Resource Technology?"


            ],
            "responses": [
                "The fees for BSc. Forest Resource Technology programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_aquaculture_water_resource_management_requirements",
            "patterns": [
                "What are the requirements for BSc. Aquaculture and Water Resource Management?",
                "Can you provide the admission criteria for BSc. Aquaculture and Water Resource Management?",
                "Requirements for BSc. Aquaculture and Water Resource Management programme?",
                "What are the prerequisites for BSc. Aquaculture and Water Resource Management?",
                "BSc. Aquaculture and Water Resource Management admission requirements?",
                "Information on eligibility for BSc. Aquaculture and Water Resource Management programme?",
                "What are the entry requirements for BSc. Aquaculture and Water Resource Management programme?",
                "Criteria for admission into BSc. Aquaculture and Water Resource Management?",
                "BSc. Aquaculture and Water Resource Management programme prerequisites?",
                "What are the requirements for BSc. Aquaculture and Water Resource Management?",
                "What do I need to qualify for BSc. Aquaculture and Water Resource Management?",
                "What qualifications are needed for BSc. Aquaculture and Water Resource Management?",
                "What are the entry requirements for BSc. Aquaculture and Water Resource Management?",
                "What are the admission requirements for BSc. Aquaculture and Water Resource Management?",
                "What prerequisites are required for BSc. Aquaculture and Water Resource Management?",
                "What are the academic requirements for BSc. Aquaculture and Water Resource Management?",
                "What grades do I need for BSc. Aquaculture and Water Resource Management?",
                "What subjects are required for BSc. Aquaculture and Water Resource Management?",
                "What criteria do I need to meet for BSc. Aquaculture and Water Resource Management?",
                "What qualifications must I have for BSc. Aquaculture and Water Resource Management?",
                "What are the eligibility requirements for BSc. Aquaculture and Water Resource Management?",
                "What academic qualifications are required for BSc. Aquaculture and Water Resource Management?",
                "What educational background is needed for BSc. Aquaculture and Water Resource Management?",
                "What high school subjects are required for BSc. Aquaculture and Water Resource Management?",
                "What are the subject requirements for BSc. Aquaculture and Water Resource Management?",
                "What qualifications do I need for BSc. Aquaculture and Water Resource Management?",
                "What are the mandatory subjects for BSc. Aquaculture and Water Resource Management?",
                "What qualifications should I have for BSc. Aquaculture and Water Resource Management?",
                "What grades are needed for BSc. Aquaculture and Water Resource Management?",
                "What entry qualifications are required for BSc. Aquaculture and Water Resource Management?",
                "What are the course requirements for BSc. Aquaculture and Water Resource Management?",
                "What qualifications are necessary for BSc. Aquaculture and Water Resource Management?",
                "What do I need to study BSc. Aquaculture and Water Resource Management?",
                "What qualifications do I need to pursue BSc. Aquaculture and Water Resource Management?",
                "What are the minimum requirements for BSc. Aquaculture and Water Resource Management?",
                "What credentials are required for BSc. Aquaculture and Water Resource Management?",
                "What is needed to apply for BSc. Aquaculture and Water Resource Management?",
                "What are the required subjects for BSc. Aquaculture and Water Resource Management?",
                "What qualifications do I need to enroll in BSc. Aquaculture and Water Resource Management?",
                "What are the academic prerequisites for BSc. Aquaculture and Water Resource Management?",
                "What high school qualifications are needed for BSc. Aquaculture and Water Resource Management?",
                "What requirements must be met for BSc. Aquaculture and Water Resource Management?",
                "What are the admission criteria for BSc. Aquaculture and Water Resource Management?",
                "What are the necessary qualifications for BSc. Aquaculture and Water Resource Management?",
                "What are the educational requirements for BSc. Aquaculture and Water Resource Management?",
                "What do I need to be eligible for BSc. Aquaculture and Water Resource Management?",
                "What academic background is required for BSc. Aquaculture and Water Resource Management?",
                "What prerequisites do I need for BSc. Aquaculture and Water Resource Management?"
            ],
            "responses": [
                "Here are the requirements for BSc. Aquaculture and Water Resource Management <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:</b> Chemistry, Physics or Mathematics, and Biology or General Agriculture.</p><br><li><b><u>'A' LEVEL APPLICANT </u></b></li><p><b>'O' Level:</b> Credit passes in FIVE (5) subjects or equivalent qualification including English Language and Mathematics. </p><p><b>'A' Level or equivalent:</b> Credit passes in Chemistry, Physics and any one from Biology, Agricultural Science, and Mathematics. Applicants with Agricultural Science or Mathematics. Applicant must have a credit in 'O' Level Biology.     </p><br><li><b><u>DIPLOMA HOLDERS  </u></b></li><ul><li>Two (2) Years Post Diploma field experience.  </li><li>An applicant must satisfy the requirements for WASSCE OR 'A' Level.  </li><li>Shortlisted applicants must pass an interview.</li></ul><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicant must have attained the age of 25 years at the time of the application.</li><li>Must have a minimum of Two (2) Years post qualification experience in a related field of Natural Resources Management.  </li><li>Must satisfy the requirements for WASSCE OR 'A' Level. </li><li>Short-listed applicants must pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Aquaculture and Water Resources Management Cutoff Points",
            "patterns": [
                "cutoff points for BSc Aquaculture and Water Resources Management",
                "BSc Aquaculture and Water Resources Management cutoff points",
                "minimum score for BSc Aquaculture and Water Resources Management",
                "required score for BSc Aquaculture and Water Resources Management",
                "aggregate for BSc Aquaculture and Water Resources Management",
                "what is the cutoff for BSc Aquaculture and Water Resources Management",
                "cutoff marks for BSc Aquaculture and Water Resources Management",
                "BSc Aquaculture and Water Resources Management required marks",
                "what aggregate do I need for BSc Aquaculture and Water Resources Management",
                "score needed for BSc Aquaculture and Water Resources Management",
                "cutoff points for Aquaculture and Water Resources Management",
                "aggregate requirements for Aquaculture and Water Resources Management",
                "what were the cut-off aggregates for Aquaculture and Water Resources Management",
                "what are the cut-off aggregates Aquaculture and Water Resources Management",
                "What is the cutoff point for BSc Aquaculture and Water Resources Management?",
                "Can you tell me the cutoff point for BSc Aquaculture and Water Resources Management?",
                "Could you provide the cutoff point for BSc Aquaculture and Water Resources Management?",
                "What's the cutoff score for BSc Aquaculture and Water Resources Management?",
                "Do you know the cutoff for BSc Aquaculture and Water Resources Management?",
                "How many points do I need for BSc Aquaculture and Water Resources Management?",
                "What's the required aggregate for BSc Aquaculture and Water Resources Management?",
                "What is the entry cutoff for BSc Aquaculture and Water Resources Management?",
                "What score is needed for BSc Aquaculture and Water Resources Management?",
                "What's the minimum score for BSc Aquaculture and Water Resources Management?",
                "What's the admission cutoff for BSc Aquaculture and Water Resources Management?",
                "How much do I need to score for BSc Aquaculture and Water Resources Management?",
                "What's the cutoff mark for BSc Aquaculture and Water Resources Management?",
                "How high does my score need to be for BSc Aquaculture and Water Resources Management?",
                "What's the threshold for BSc Aquaculture and Water Resources Management?",
                "What's the lowest score accepted for BSc Aquaculture and Water Resources Management?",
                "How many points are required for BSc Aquaculture and Water Resources Management?",
                "What's the point cutoff for BSc Aquaculture and Water Resources Management?",
                "Can you tell me the score needed for BSc Aquaculture and Water Resources Management?",
                "What is the cutoff point for entering BSc Aquaculture and Water Resources Management?",
                "What's the required score for BSc Aquaculture and Water Resources Management?",
                "What's the aggregate needed for BSc Aquaculture and Water Resources Management?",
                "How many points to get into BSc Aquaculture and Water Resources Management?",
                "What's the minimum aggregate for BSc Aquaculture and Water Resources Management?",
                "What's the lowest mark accepted for BSc Aquaculture and Water Resources Management?",
                "How many points are needed for BSc Aquaculture and Water Resources Management?",
                "What's the cutoff score for getting into BSc Aquaculture and Water Resources Management?",
                "How many points do I need to get into BSc Aquaculture and Water Resources Management?",
                "What score do I need to enter BSc Aquaculture and Water Resources Management?",
                "What's the entry score for BSc Aquaculture and Water Resources Management?",
                "What's the minimum points for BSc Aquaculture and Water Resources Management?",
                "What's the required points for BSc Aquaculture and Water Resources Management?",
                "How much do I need to score to get into BSc Aquaculture and Water Resources Management?",
                "What's the score requirement for BSc Aquaculture and Water Resources Management?",
                "What's the point requirement for BSc Aquaculture and Water Resources Management?",
                "What's the aggregate score for BSc Aquaculture and Water Resources Management?",
                "How high does my aggregate need to be for BSc Aquaculture and Water Resources Management?",
                "What's the minimum score requirement for BSc Aquaculture and Water Resources Management?",
                "What's the minimum aggregate score for BSc Aquaculture and Water Resources Management?",
                "What's the lowest score needed for BSc Aquaculture and Water Resources Management?",
                "What score do I need for BSc Aquaculture and Water Resources Management?",
                "What's the cutoff aggregate for BSc Aquaculture and Water Resources Management?",
                "How many points to qualify for BSc Aquaculture and Water Resources Management?",
                "What's the minimum required score for BSc Aquaculture and Water Resources Management?",
                "What's the required cutoff for BSc Aquaculture and Water Resources Management?",
                "What's the minimum threshold for BSc Aquaculture and Water Resources Management?",
                "What's the admission score for BSc Aquaculture and Water Resources Management?",
                "What's the required mark for BSc Aquaculture and Water Resources Management?",
                "What's the lowest score requirement for BSc Aquaculture and Water Resources Management?",
                "How many points are required to get into BSc Aquaculture and Water Resources Management?",
                "What's the cutoff entry point for BSc Aquaculture and Water Resources Management?",
                "How many points do I need to be accepted into BSc Aquaculture and Water Resources Management?",
                "What's the minimum cutoff score for BSc Aquaculture and Water Resources Management?",
                "What's the score needed for BSc Aquaculture and Water Resources Management admission?",
                "What's the aggregate cutoff for BSc Aquaculture and Water Resources Management?",
                "What's the required entry score for BSc Aquaculture and Water Resources Management?",
                "How high must my score be for BSc Aquaculture and Water Resources Management?",
                "What's the point aggregate for BSc Aquaculture and Water Resources Management?",
                "What's the threshold score for BSc Aquaculture and Water Resources Management?",
                "How much do I need to get into BSc Aquaculture and Water Resources Management?",
                "What's the lowest score required for BSc Aquaculture and Water Resources Management?",
                "What's the entry mark for BSc Aquaculture and Water Resources Management?",
                "What's the required score to get into BSc Aquaculture and Water Resources Management?",
                "What's the entry threshold for BSc Aquaculture and Water Resources Management?",
                "What's the score cutoff for BSc Aquaculture and Water Resources Management?",
                "How many points must I score for BSc Aquaculture and Water Resources Management?",
                "What's the aggregate required for BSc Aquaculture and Water Resources Management?",
                "What's the minimum points needed for BSc Aquaculture and Water Resources Management?",
                "What's the minimum mark for BSc Aquaculture and Water Resources Management?",
                "What's the lowest entry score for BSc Aquaculture and Water Resources Management?",
                "What's the cutoff mark to get into BSc Aquaculture and Water Resources Management?",
                "How high does my score have to be for BSc Aquaculture and Water Resources Management?",
                "What's the minimum aggregate points for BSc Aquaculture and Water Resources Management?",
                "What's the required entry aggregate for BSc Aquaculture and Water Resources Management?",
                "How many points are needed to get into BSc Aquaculture and Water Resources Management?",
                "What's the score threshold for BSc Aquaculture and Water Resources Management?",
                "What's the aggregate to get into BSc Aquaculture and Water Resources Management?",
                "What's the minimum score needed to get into BSc Aquaculture and Water Resources Management?",
                "What's the minimum cutoff mark for BSc Aquaculture and Water Resources Management?",
                "What's the lowest score to get into BSc Aquaculture and Water Resources Management?",
                "What's the admission cutoff mark for BSc Aquaculture and Water Resources Management?",
                "What's the minimum entry score for BSc Aquaculture and Water Resources Management?",
                "What's the point cutoff for getting into BSc Aquaculture and Water Resources Management?",
                "What's the lowest points needed for BSc Aquaculture and Water Resources Management?",
                "What's the required cutoff points for BSc Aquaculture and Water Resources Management?",
                "How much do I need to score to be accepted into BSc Aquaculture and Water Resources Management?",
                "What's the lowest score accepted into BSc Aquaculture and Water Resources Management?",
                "What's the required aggregate to get into BSc Aquaculture and Water Resources Management?",
                "What's the cutoff for BSc Aquaculture and Water Resources Management admission?",
                "How many points to be accepted into BSc Aquaculture and Water Resources Management?",
                "What's the minimum points requirement for BSc Aquaculture and Water Resources Management?",
                "What's the entry cutoff score for BSc Aquaculture and Water Resources Management?",
                "What's the minimum points to get into BSc Aquaculture and Water Resources Management?",
                "What's the required points to get into BSc Aquaculture and Water Resources Management?",
                "What's the lowest score requirement for BSc Aquaculture and Water Resources Management admission?",
                "What's the cutoff point requirement for BSc Aquaculture and Water Resources Management?",
                "How high does my score need to be to get into BSc Aquaculture and Water Resources Management?",
                "What's the minimum mark requirement for BSc Aquaculture and Water Resources Management?",
                "How many points do I need to be eligible for BSc Aquaculture and Water Resources Management?",
                "What's the required score for BSc Aquaculture and Water Resources Management entry?",
                "What's the cutoff points for BSc Aquaculture and Water Resources Management?",
                "What's the minimum threshold points for BSc Aquaculture and Water Resources Management?",
                "What's the score requirement to get into BSc Aquaculture and Water Resources Management?",
                "What's the minimum required points for BSc Aquaculture and Water Resources Management?",
                "What's the admission score requirement for BSc Aquaculture and Water Resources Management?",
                "What's the cutoff aggregate points for BSc Aquaculture and Water Resources Management?",
                "How many points do I need to qualify for BSc Aquaculture and Water Resources Management?",
                "What's the minimum entry points for BSc Aquaculture and Water Resources Management?",
                "What's the required cutoff mark for BSc Aquaculture and Water Resources Management?",
                "What's the lowest points requirement for BSc Aquaculture and Water Resources Management?",
                "What's the cutoff score requirement for BSc Aquaculture and Water Resources Management?",
                "How high must my aggregate be for BSc Aquaculture and Water"
            ],
            "responses": [
                "The cutoff points for BSc. Aquaculture and Water Resources Management are typically around aggregate 22. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc_Aquaculture_Water_Resource_Management_fees",
            "patterns": [
                "what is the fees for Aquaculture Water Resource Management",
                "Can I know the amount I will pay for Aquaculture Water Resource Management",
                "Can i pay the fees in installment for Aquaculture Water Resource Managemen?",
                "When should i pay the fees for Aquaculture Water Resource Management?",
                "Can i book for a hall before paying fees for Aquaculture Water Resource Managemen",
                "How much are the fees for BSc. Aquaculture Water Resource Management?",
                "What are the tuition fees for BSc. Aquaculture Water Resource Management?",
                "How much do I need to pay for BSc. Aquaculture Water Resource Management?",
                "What is the cost of the BSc. Aquaculture Water Resource Management programme?",
                "Can you provide the fee details for BSc. Aquaculture Water Resource Management?",
                "What is the tuition cost for BSc. Aquaculture Water Resource Management?",
                "How much is the fee for studying Aquaculture Water Resource Management?",
                "What is the payment schedule for BSc. Aquaculture Water Resource Management fees?",
                "Do I have to pay the full fee for BSc. Aquaculture Water Resource Management upfront?",
                "What is the fee structure for BSc. Aquaculture Water Resource Management?",
                "Can I pay my BSc. Aquaculture Water Resource Management fees in installments?",
                "What are the fee payment options for BSc. Aquaculture Water Resource Management?",
                "How are the fees for BSc. Aquaculture Water Resource Management calculated?",
                "Are there any additional costs for BSc. Aquaculture Water Resource Management?",
                "What is the total cost of BSc. Aquaculture Water Resource Management for a year?",
                "Are there any extra fees for BSc. Aquaculture Water Resource Management?",
                "Can I get a breakdown of the BSc. Aquaculture Water Resource Management fees?",
                "What is the annual fee for BSc. Aquaculture Water Resource Management?",
                "How much does each semester cost for BSc. Aquaculture Water Resource Management?",
                "What are the miscellaneous fees for BSc. Aquaculture Water Resource Management?",
                "Are there any lab fees for BSc. Aquaculture Water Resource Management?",
                "What are the accommodation fees for BSc. Aquaculture Water Resource Management?",
                "How much are the hostel fees for BSc. Aquaculture Water Resource Management students?",
                "What is the fee for international students in BSc. Aquaculture Water Resource Management?",
                "Do international students pay higher fees for BSc. Aquaculture Water Resource Management?",
                "What is the fee for fee-paying students in BSc. Aquaculture Water Resource Management?",
                "Are there fee waivers for BSc. Aquaculture Water Resource Management?",
                "Are scholarships available to cover BSc. Aquaculture Water Resource Management fees?",
                "What are the financial aid options for BSc. Aquaculture Water Resource Management?",
                "How much should I budget for BSc. Aquaculture Water Resource Management fees?",
                "Is there a fee refund policy for BSc. Aquaculture Water Resource Management?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Aquaculture Water Resource Management?",
                "What is the refund policy for BSc. Aquaculture Water Resource Management fees?",
                "What is the deadline for paying BSc. Aquaculture Water Resource Management fees?",
                "Can I get a fee extension for BSc. Aquaculture Water Resource Management?",
                "What is the penalty for late payment of BSc. Aquaculture Water Resource Management fees?",
                "Can I pay BSc. Aquaculture Water Resource Management fees in multiple payments?",
                "Are there any hidden costs for BSc. Aquaculture Water Resource Management?",
                "What are the compulsory fees for BSc. Aquaculture Water Resource Management?",
                "Can I pay BSc. Aquaculture Water Resource Management fees with a payment plan?",
                "How often do I need to pay fees for BSc. Aquaculture Water Resource Management?",
                "What are the semester fees for BSc. Aquaculture Water Resource Management?",
                "Is there an application fee for BSc. Aquaculture Water Resource Management?",
                "What is the registration fee for BSc. Aquaculture Water Resource Management?",
                "Are the fees for BSc. Aquaculture Water Resource Management fixed or variable?",
                "What is the cost per credit hour for BSc. Aquaculture Water Resource Management?",
                "Are there any discounts available for BSc. Aquaculture Water Resource Management fees?",
                "Can I get a fee breakdown for BSc. Aquaculture Water Resource Management?",
                "What are the non-tuition fees for BSc. Aquaculture Water Resource Management?",
                "Are there any additional charges for BSc. Aquaculture Water Resource Management?",
                "How much is the acceptance fee for BSc. Aquaculture Water Resource Management?",
                "Can I book a hall without paying the BSc. Aquaculture Water Resource Management fees?",
                "What are the hostel booking requirements for BSc. Aquaculture Water Resource Management?",
                "When are the BSc. Aquaculture Water Resource Management fees due?",
                "What is the initial deposit for BSc. Aquaculture Water Resource Management fees?",
                "How do I pay my BSc. Aquaculture Water Resource Management fees online?",
                "Are there any late fees for BSc. Aquaculture Water Resource Management?",
                "What is the mode of payment for BSc. Aquaculture Water Resource Management fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Aquaculture Water Resource Management?",
                "How do I access my fee statement for BSc. Aquaculture Water Resource Management?",
                "What is the last date to pay fees for BSc. Aquaculture Water Resource Management?",
                "Is there an online payment option for BSc. Aquaculture Water Resource Management fees?",
                "What is the procedure for paying BSc. Aquaculture Water Resource Management fees?",
                "What is the tuition fee for the first year of BSc. Aquaculture Water Resource Management?",
                "Are there any financial aid options for BSc. Aquaculture Water Resource Management?",


                "What is included in the BSc. Aquaculture Water Resource Management fee?",
                "Can I get a fee waiver for BSc. Aquaculture Water Resource Management?"


            ],
            "responses": [
                "The fees for BSc. Aquaculture Water Resource Management programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_packaging_technology_requirements",
            "patterns": [
                "What are the requirements for BSc. Packaging Technology?",
                "Can you provide the admission criteria for BSc. Packaging Technology?",
                "Requirements for BSc. Packaging Technology programme?",
                "What are the prerequisites for BSc. Packaging Technology?",
                "BSc. Packaging Technology admission requirements?",
                "Information on eligibility for BSc. Packaging Technology programme?",
                "What are the entry requirements for BSc. Packaging Technology programme?",
                "Criteria for admission into BSc. Packaging Technology?",
                "BSc. Packaging Technology programme prerequisites?",
                "What are the requirements for BSc. Packaging Technology?",
                "What do I need to qualify for BSc. Packaging Technology?",
                "What qualifications are needed for BSc. Packaging Technology?",
                "What are the entry requirements for BSc. Packaging Technology?",
                "What are the admission requirements for BSc. Packaging Technology?",
                "What prerequisites are required for BSc. Packaging Technology?",
                "What are the academic requirements for BSc. Packaging Technology?",
                "What grades do I need for BSc. Packaging Technology?",
                "What subjects are required for BSc. Packaging Technology?",
                "What criteria do I need to meet for BSc. Packaging Technology?",
                "What qualifications must I have for BSc. Packaging Technology?",
                "What are the eligibility requirements for BSc. Packaging Technology?",
                "What academic qualifications are required for BSc. Packaging Technology?",
                "What educational background is needed for BSc. Packaging Technology?",
                "What high school subjects are required for BSc. Packaging Technology?",
                "What are the subject requirements for BSc. Packaging Technology?",
                "What qualifications do I need for BSc. Packaging Technology?",
                "What are the mandatory subjects for BSc. Packaging Technology?",
                "What qualifications should I have for BSc. Packaging Technology?",
                "What grades are needed for BSc. Packaging Technology?",
                "What entry qualifications are required for BSc. Packaging Technology?",
                "What are the course requirements for BSc. Packaging Technology?",
                "What qualifications are necessary for BSc. Packaging Technology?",
                "What do I need to study BSc. Packaging Technology?",
                "What qualifications do I need to pursue BSc. Packaging Technology?",
                "What are the minimum requirements for BSc. Packaging Technology?",
                "What credentials are required for BSc. Packaging Technology?",
                "What is needed to apply for BSc. Packaging Technology?",
                "What are the required subjects for BSc. Packaging Technology?",
                "What qualifications do I need to enroll in BSc. Packaging Technology?",
                "What are the academic prerequisites for BSc. Packaging Technology?",
                "What high school qualifications are needed for BSc. Packaging Technology?",
                "What requirements must be met for BSc. Packaging Technology?",
                "What are the admission criteria for BSc. Packaging Technology?",
                "What are the necessary qualifications for BSc. Packaging Technology?",
                "What are the educational requirements for BSc. Packaging Technology?",
                "What do I need to be eligible for BSc. Packaging Technology?",
                "What academic background is required for BSc. Packaging Technology?",
                "What prerequisites do I need for BSc. Packaging Technology?",
                "What qualifications are needed to apply for BSc. Packaging Technology?",
                "What qualifications do I need to get into BSc. Packaging Technology?",
                "What subjects do I need to study for BSc. Packaging Technology?",
                "What qualifications are needed to enroll in BSc. Packaging Technology?",
                "What are the qualification requirements for BSc. Packaging Technology?",
                "What subjects must I take for BSc. Packaging Technology?",
                "What grades do I need to get into BSc. Packaging Technology?",
                "What are the required qualifications for BSc. Packaging Technology?",
                "What educational qualifications are needed for BSc. Packaging Technology?",
                "What qualifications are required to study BSc. Packaging Technology?",
                "What requirements do I need to fulfill for BSc. Packaging Technology?",
                "What subjects should I have studied for BSc. Packaging Technology?",
                "What do I need to have to qualify for BSc. Packaging Technology?",
                "What subjects do I need to qualify for BSc. Packaging Technology?",
                "What qualifications do I need to meet for BSc. Packaging Technology?",
                "What qualifications must be met for BSc. Packaging Technology?",
                "What are the needed qualifications for BSc. Packaging Technology?",
                "What academic subjects are required for BSc. Packaging Technology?",
                "What requirements must I meet for BSc. Packaging Technology?",
                "What do I need to qualify for a BSc. in Packaging Technology?",
                "What grades are required for BSc. Packaging Technology?",
                "What academic credentials are needed for BSc. Packaging Technology?",
                "What subjects are necessary for BSc. Packaging Technology?",
                "What qualifications do I need for a BSc. in Packaging Technology?",
                "What educational qualifications must I have for BSc. Packaging Technology?",
                "What criteria must be met for BSc. Packaging Technology?",
                "What qualifications are necessary to study BSc. Packaging Technology?",
                "What subjects are required to study BSc. Packaging Technology?",
                "What prerequisites do I need to study BSc. Packaging Technology?",
                "What subjects must be taken for BSc. Packaging Technology?",
                "What are the requirements for enrolling in BSc. Packaging Technology?",
                "What qualifications do I need for admission to BSc. Packaging Technology?",
                "What are the required grades for BSc. Packaging Technology?",
                "What subjects are required for admission to BSc. Packaging Technology?",
                "What subjects should I study for BSc. Packaging Technology?",
                "What prerequisites are needed for BSc. Packaging Technology?",
                "What do I need to be admitted to BSc. Packaging Technology?",
                "What qualifications are needed for a BSc. in Packaging Technology?",
                "What academic qualifications must be met for BSc. Packaging Technology?",
                "What subjects are required to get into BSc. Packaging Technology?",
                "What are the eligibility criteria for BSc. Packaging Technology?",
                "What requirements do I need to be admitted to BSc. Packaging Technology?",
                "What qualifications are required for admission to BSc. Packaging Technology?",
                "What educational background do I need for BSc. Packaging Technology?",
                "What qualifications do I need for applying to BSc. Packaging Technology?",
                "What subjects do I need to meet the requirements for BSc. Packaging Technology?",
                "What prerequisites do I need to fulfill for BSc. Packaging Technology?",
                "What subjects do I need to take for BSc. Packaging Technology?",
                "What are the academic requirements to get into BSc. Packaging Technology?",
                "What qualifications are needed to be admitted to BSc. Packaging Technology?",
                "What academic subjects must be studied for BSc. Packaging Technology?",
                "What are the needed subjects for BSc. Packaging Technology?",
                "What do I need to study to qualify for BSc. Packaging Technology?",
                "What qualifications are needed to pursue a BSc. in Packaging Technology?"
            ],
            "responses": [
                "Here are the requirements for BSc. Packaging Technology <ul><li><b><u>WASSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:</b> Credit Passes in THREE (3) from any of the following options: Science, General Arts, Visual Art, Technical and Home Economics. </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level:</b>  Credit passes in FIVE (5) subjects including English Language and Mathematics. </p><p><b>'A' Level or equivalent:</b> Credit passes in THREE (3) subjects or equivalent passes from any of the following options: Science, and General Arts. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>An applicant must be a least 25 years at the time of the application. </li><li>EITHER possess FIVE (5) credits at 'O' Level, including Mathematics and English Language, OR </li><li>Credit passes in THREE (3) WASSCE/SSSCE core Subjects plus credits in THREE (3) Elective Subjects in Science, General Arts, Visual Art, Technical, and Home Economics. Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Packaging Technology Cutoff Points",
            "patterns": [
                "cutoff points for BSc Packaging Technology",
                "BSc Packaging Technology cutoff points",
                "minimum score for BSc Packaging Technology",
                "required score for BSc Packaging Technology",
                "aggregate for BSc Packaging Technology",
                "what is the cutoff for BSc Packaging Technology",
                "cutoff marks for BSc Packaging Technology",
                "BSc Packaging Technology required marks",
                "what aggregate do I need for BSc Packaging Technology",
                "score needed for BSc Packaging Technology",
                "cutoff points for Packaging Technology",
                "aggregate requirements for Packaging Technology",
                "what were the cut-off aggregates for Packaging Technology",
                "what are the cut-off aggregates Packaging Technology",
                "What is the cutoff point for BSc Packaging Technology?",
                "Can you tell me the cutoff point for BSc Packaging Technology?",
                "Could you provide the cutoff point for BSc Packaging Technology?",
                "What's the cutoff score for BSc Packaging Technology?",
                "Do you know the cutoff for BSc Packaging Technology?",
                "How many points do I need for BSc Packaging Technology?",
                "What's the required aggregate for BSc Packaging Technology?",
                "What is the entry cutoff for BSc Packaging Technology?",
                "What score is needed for BSc Packaging Technology?",
                "What's the minimum score for BSc Packaging Technology?",
                "What's the admission cutoff for BSc Packaging Technology?",
                "How much do I need to score for BSc Packaging Technology?",
                "What's the cutoff mark for BSc Packaging Technology?",
                "How high does my score need to be for BSc Packaging Technology?",
                "What's the threshold for BSc Packaging Technology?",
                "What's the lowest score accepted for BSc Packaging Technology?",
                "How many points are required for BSc Packaging Technology?",
                "What's the point cutoff for BSc Packaging Technology?",
                "Can you tell me the score needed for BSc Packaging Technology?",
                "What is the cutoff point for entering BSc Packaging Technology?",
                "What's the required score for BSc Packaging Technology?",
                "What's the aggregate needed for BSc Packaging Technology?",
                "How many points to get into BSc Packaging Technology?",
                "What's the minimum aggregate for BSc Packaging Technology?",
                "What's the lowest mark accepted for BSc Packaging Technology?",
                "How many points are needed for BSc Packaging Technology?",
                "What's the cutoff score for getting into BSc Packaging Technology?",
                "How many points do I need to get into BSc Packaging Technology?",
                "What score do I need to enter BSc Packaging Technology?",
                "What's the entry score for BSc Packaging Technology?",
                "What's the minimum points for BSc Packaging Technology?",
                "What's the required points for BSc Packaging Technology?",
                "How much do I need to score to get into BSc Packaging Technology?",
                "What's the score requirement for BSc Packaging Technology?",
                "What's the point requirement for BSc Packaging Technology?",
                "What's the aggregate score for BSc Packaging Technology?",
                "How high does my aggregate need to be for BSc Packaging Technology?",
                "What's the minimum score requirement for BSc Packaging Technology?",
                "What's the minimum aggregate score for BSc Packaging Technology?",
                "What's the lowest score needed for BSc Packaging Technology?",
                "What score do I need for BSc Packaging Technology?",
                "What's the cutoff aggregate for BSc Packaging Technology?",
                "How many points to qualify for BSc Packaging Technology?",
                "What's the minimum required score for BSc Packaging Technology?",
                "What's the required cutoff for BSc Packaging Technology?",
                "What's the minimum threshold for BSc Packaging Technology?",
                "What's the admission score for BSc Packaging Technology?",
                "What's the required mark for BSc Packaging Technology?",
                "What's the lowest score requirement for BSc Packaging Technology?",
                "How many points are required to get into BSc Packaging Technology?",
                "What's the cutoff entry point for BSc Packaging Technology?",
                "How many points do I need to be accepted into BSc Packaging Technology?",
                "What's the minimum cutoff score for BSc Packaging Technology?",
                "What's the score needed for BSc Packaging Technology admission?",
                "What's the aggregate cutoff for BSc Packaging Technology?",
                "What's the required entry score for BSc Packaging Technology?",
                "How high must my score be for BSc Packaging Technology?",
                "What's the point aggregate for BSc Packaging Technology?",
                "What's the threshold score for BSc Packaging Technology?",
                "How much do I need to get into BSc Packaging Technology?",
                "What's the lowest score required for BSc Packaging Technology?",
                "What's the entry mark for BSc Packaging Technology?",
                "What's the required score to get into BSc Packaging Technology?",
                "What's the entry threshold for BSc Packaging Technology?",
                "What's the score cutoff for BSc Packaging Technology?",
                "How many points must I score for BSc Packaging Technology?",
                "What's the aggregate required for BSc Packaging Technology?",
                "What's the minimum points needed for BSc Packaging Technology?",
                "What's the minimum mark for BSc Packaging Technology?",
                "What's the lowest entry score for BSc Packaging Technology?",
                "What's the cutoff mark to get into BSc Packaging Technology?",
                "How high does my score have to be for BSc Packaging Technology?",
                "What's the minimum aggregate points for BSc Packaging Technology?",
                "What's the required entry aggregate for BSc Packaging Technology?",
                "How many points are needed to get into BSc Packaging Technology?",
                "What's the score threshold for BSc Packaging Technology?",
                "What's the aggregate to get into BSc Packaging Technology?",
                "What's the minimum score needed to get into BSc Packaging Technology?",
                "What's the minimum cutoff mark for BSc Packaging Technology?",
                "What's the lowest score to get into BSc Packaging Technology?",
                "What's the admission cutoff mark for BSc Packaging Technology?",
                "What's the minimum entry score for BSc Packaging Technology?",
                "What's the point cutoff for getting into BSc Packaging Technology?",
                "What's the lowest points needed for BSc Packaging Technology?",
                "What's the required cutoff points for BSc Packaging Technology?",
                "How much do I need to score to be accepted into BSc Packaging Technology?",
                "What's the lowest score accepted into BSc Packaging Technology?",
                "What's the required aggregate to get into BSc Packaging Technology?",
                "What's the cutoff for BSc Packaging Technology admission?",
                "How many points to be accepted into BSc Packaging Technology?",
                "What's the minimum points requirement for BSc Packaging Technology?",
                "What's the entry cutoff score for BSc Packaging Technology?",
                "What's the minimum points to get into BSc Packaging Technology?",
                "What's the required points to get into BSc Packaging Technology?",
                "What's the lowest score requirement for BSc Packaging Technology admission?",
                "What's the cutoff point requirement for BSc Packaging Technology?",
                "How high does my score need to be to get into BSc Packaging Technology?",
                "What's the minimum mark requirement for BSc Packaging Technology?",
                "How many points do I need to be eligible for BSc Packaging Technology?",
                "What's the required score for BSc Packaging Technology entry?",
                "What's the cutoff points for BSc Packaging Technology?",
                "What's the minimum threshold points for BSc Packaging Technology?",
                "What's the score requirement to get into BSc Packaging Technology?",
                "What's the minimum required points for BSc Packaging Technology?",
                "What's the admission score requirement for BSc Packaging Technology?",
                "What's the cutoff aggregate points for BSc Packaging Technology?",
                "How many points do I need to qualify for BSc Packaging Technology?",
                "What's the minimum entry points for BSc Packaging Technology?",
                "What's the required cutoff mark for BSc Packaging Technology?",
                "What's the lowest points requirement for BSc Packaging Technology?",
                "What's the cutoff score requirement for BSc Packaging Technology?",
                "How high must my aggregate be for BSc Packaging Technology?",
                "What's the cutoff points for BSc Packaging Technology?",
                "What's the minimum score needed for BSc Packaging Technology admission?",
                "What's the lowest score needed to be accepted into BSc Packaging Technology?",
                "What's the aggregate score for BSc Packaging Technology?",
                "How many points to be accepted into BSc Packaging Technology?",
                "What's the minimum points requirement for BSc Packaging Technology?",
                "What's the entry cutoff score for BSc Packaging Technology?",
                "What's the minimum points to get into BSc Packaging Technology?",
                "What's the required points to get into BSc Packaging Technology?",
                "What's the lowest score requirement for BSc Packaging Technology admission?",
                "What's the cutoff point requirement for BSc Packaging Technology?",
                "How high does my score need to be to get into BSc Packaging Technology?",
                "What's the minimum mark requirement for BSc Packaging Technology?",
                "How many points do I need to be eligible for BSc Packaging Technology?",
                "What's the required score for BSc Packaging Technology entry?",
                "What's the cutoff points for BSc Packaging Technology?",
                "What's the minimum threshold points for BSc Packaging Technology?",
                "What's the score requirement to get into BSc Packaging Technology?",
                "What's the minimum required points for BSc Packaging Technology?",
                "What's the admission score requirement for BSc Packaging Technology?",
                "What's the cutoff aggregate points for BSc Packaging Technology?",
                "How many points do I need to qualify for BSc Packaging Technology?",
                "What's the minimum entry points for BSc Packaging Technology?",
                "What's the required cutoff mark for BSc Packaging Technology?",
                "What's the lowest points requirement for BSc Packaging Technology?",
                "What's the cutoff score requirement for BSc Packaging Technology?",
                "How high must my aggregate be for BSc Packaging Technology?",
                "What's the cutoff points for BSc Packaging Technology?",
                "What's the minimum score needed for BSc Packaging Technology admission?",
                "What's the lowest score needed to be accepted into BSc Packaging Technology?",
                "What's the aggregate score for BSc Packaging Technology"
            ],
            "responses": [
                "The cutoff points for BSc. Packaging Technology are typically around aggregate 16. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc_Packaging_Technology_fees",
            "patterns": [
                "what is the fees for Packaging Technology",
                "Can I know the amount I will pay for Packaging Technology",
                "Can i pay the fees in installment for Packaging Technology?",
                "When should i pay the fees for Packaging Technology?",
                "Can i book for a hall before paying fees for Packaging Technology",
                "How much are the fees for BSc. Packaging Technology?",
                "What are the tuition fees for BSc. Packaging Technology?",
                "How much do I need to pay for BSc. Packaging Technology?",
                "What is the cost of the BSc. Packaging Technology programme?",
                "Can you provide the fee details for BSc. Packaging Technology?",
                "What is the tuition cost for BSc. Packaging Technology?",
                "How much is the fee for studying Packaging Technology?",
                "What is the payment schedule for BSc. Packaging Technology fees?",
                "Do I have to pay the full fee for BSc. Packaging Technology upfront?",
                "What is the fee structure for BSc. Packaging Technology?",
                "Can I pay my BSc. Packaging Technology fees in installments?",
                "What are the fee payment options for BSc. Packaging Technology?",
                "How are the fees for BSc. Packaging Technology calculated?",
                "Are there any additional costs for BSc. Packaging Technology?",
                "What is the total cost of BSc. Packaging Technology for a year?",
                "Are there any extra fees for BSc. Packaging Technology?",
                "Can I get a breakdown of the BSc. Packaging Technology fees?",
                "What is the annual fee for BSc. Packaging Technology?",
                "How much does each semester cost for BSc. Packaging Technology?",
                "What are the miscellaneous fees for BSc. Packaging Technology?",
                "Are there any lab fees for BSc. Packaging Technology?",
                "What are the accommodation fees for BSc. Packaging Technology?",
                "How much are the hostel fees for BSc. Packaging Technology students?",
                "What is the fee for international students in BSc. Packaging Technology?",
                "Do international students pay higher fees for BSc. Packaging Technology?",
                "What is the fee for fee-paying students in BSc. Packaging Technology?",
                "Are there fee waivers for BSc. Packaging Technology?",
                "Are scholarships available to cover BSc. Packaging Technology fees?",
                "What are the financial aid options for BSc. Packaging Technology?",
                "How much should I budget for BSc. Packaging Technology fees?",
                "Is there a fee refund policy for BSc. Packaging Technology?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Packaging Technology?",
                "What is the refund policy for BSc. Packaging Technology fees?",
                "What is the deadline for paying BSc. Packaging Technology fees?",
                "Can I get a fee extension for BSc. Packaging Technology?",
                "What is the penalty for late payment of BSc. Packaging Technology fees?",
                "Can I pay BSc. Packaging Technology fees in multiple payments?",
                "Are there any hidden costs for BSc. Packaging Technology?",
                "What are the compulsory fees for BSc. Packaging Technology?",
                "Can I pay BSc. Packaging Technology fees with a payment plan?",
                "How often do I need to pay fees for BSc. Packaging Technology?",
                "What are the semester fees for BSc. Packaging Technology?",
                "Is there an application fee for BSc. Packaging Technology?",
                "What is the registration fee for BSc. Packaging Technology?",
                "Are the fees for BSc. Packaging Technology fixed or variable?",
                "What is the cost per credit hour for BSc. Packaging Technology?",
                "Are there any discounts available for BSc. Packaging Technology fees?",
                "Can I get a fee breakdown for BSc. Packaging Technology?",
                "What are the non-tuition fees for BSc. Packaging Technology?",
                "Are there any additional charges for BSc. Packaging Technology?",
                "How much is the acceptance fee for BSc. Packaging Technology?",
                "Can I book a hall without paying the BSc. Packaging Technology fees?",
                "What are the hostel booking requirements for BSc. Packaging Technology?",
                "When are the BSc. Packaging Technology fees due?",
                "What is the initial deposit for BSc. Packaging Technology fees?",
                "How do I pay my BSc. Packaging Technology fees online?",
                "Are there any late fees for BSc. Packaging Technology?",
                "What is the mode of payment for BSc. Packaging Technology fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Packaging Technology?",
                "How do I access my fee statement for BSc. Packaging Technology?",
                "What is the last date to pay fees for BSc. Packaging Technology?",
                "Is there an online payment option for BSc. Packaging Technology fees?",
                "What is the procedure for paying BSc. Packaging Technology fees?",
                "What is the tuition fee for the first year of BSc. Packaging Technology?",
                "Are there any financial aid options for BSc. Packaging Technology?",
                "What is included in the BSc. Packaging Technology fee?",
                "Can I get a fee waiver for BSc. Packaging Technology?"


            ],
            "responses": [
                "The fees for BSc. Packaging Technology programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        }
    ]
}