{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "good evening",
                "hey there",
                "good",
                "hello",
                "hey hoaw are you doingi",
                "hi"
            ],
            "responses": [
                "Hello! How can I help you?  <br>",
                "Good evening to you too! What can I help you with concerning KNUST admissions? 😊",
                "Okay, what can I help you with regarding KNUST admissions?",
                "Hi there! How can I help you with admissions to KNUST?  <br>",
                "How can I help you? <br>",
                "Hi there, how can I help?  <br>",
                "I'm doing well, thanks for asking! What can I do for you?",
                "Okay, what's up about KNUST admissions?",
                "Hi, how can I help you with KNUST admissions?  <br>",
                "Hi there, how can I help?",
                "Hello! Welcome to KNUST. How can I help you?  <br>"
            ]
        },
        {
            "tag": "name",
            "patterns": [
                "names of your creator",
                "what is your name?"
            ],
            "responses": [
                "I'm TechChat.  <br>",
                "TechChat.",
                "My name is TechChat. How can I help you with KNUST admissions today? <br>"
            ]
        },
        {
            "tag": "Chatbot Capabilities",
            "patterns": [
                "what are the things you can do?",
                "how are you doing?"
            ],
            "responses": [
                "You can ask me questions regarding KNUST undergraduate admissions, and I will try to answer them.  <br>",
                "Ask me your questions about KNUST undergraduate admissions."
            ]
        },
        {
            "tag": "how_to_apply",
            "patterns": [
                "tell me how to apply",
                "what is the application process like?"
            ],
            "responses": [
                "<ol><li>Purchase an eVoucher from an approved vendor. </li><li>Visit https:<br>//apps. knust. edu. gh/admissions/apply/Account/Login and enter the eVoucher details to access the application form. </li><li>Complete the application form accurately, providing all required information. </li><li>Upload necessary documents, including your results slip, birth certificate, and a passport-sized photograph. </li><li>Review your application thoroughly before submitting it. </li><li>Print a copy of the completed application form for your records. </li></ol>",
                "The provided response is a very detailed, step-by-step guide which may be overwhelming for a prospective student simply asking about the application process. Here's a more suitable response:<br>KNUST uses an online application process. You can find the application portal on the KNUST admissions website, [https:<br>//apps. knust. edu. gh/admissions/](https:<br>//apps. knust. edu. gh/admissions/).  You'll need to create an account, fill out the application form, upload necessary documents like your academic transcripts and certificates, and pay the application fee. Make sure to review the entry requirements for your chosen program before applying.",
                "First, you'll need to buy a voucher and go to https:<br>//apps. knust. edu. gh/admissions/apply/Account/Login to begin your application.  Fill out all the required fields, making sure to include your educational background and exam results.  You'll need to upload some documents, like your birth certificate and result slips.  Finally, review your application, agree to the terms, and submit!",
                "The application process at KNUST is entirely online. You can find a step-by-step guide on how to apply on the university's admissions portal. Basically, you will be required to create an account, fill in your information, upload supporting documents, select your program of study, and submit your application. I highly recommend checking the specific requirements for your chosen program before you begin the application. You can find this information on the KNUST website.",
                "The provided response outlines detailed steps for online application, but it lacks a general overview of the KNUST admission process. A more suitable response is:<br>To apply to KNUST, you need to purchase an e-voucher from approved vendors, which grants access to the online application portal.  You'll then create an account, fill out the application form, and upload necessary documents like your academic certificates and transcripts.  Be sure to carefully review your application before submitting it and pay attention to specific deadlines and requirements for your chosen program.",
                "To apply to KNUST, you need to:<br>1. Buy an eVoucher from an approved vendor. 2. Visit the KNUST admissions portal and log in with the eVoucher details. 3. Fill out all the required sections accurately, including your personal information, educational background, and exam results. 4. Upload the necessary documents, such as your birth certificate and certificates. 5. Select your preferred program of study and stream (regular or fee-paying). 6. Review all the information provided and submit your application.",
                "The KNUST application process is entirely online. You can find a comprehensive guide, including downloadable brochures and FAQs, on the official KNUST admissions portal at [https://apps. knust. edu. gh/admissions/](https://apps. knust. edu. gh/admissions/).",
                "The provided response outlines steps specific to filling out the KNUST online application form, not a general overview of the application process. Here's a more suitable response:<br>To apply to KNUST, prospective students need to purchase an eVoucher, available at various banks and mobile money platforms.  This voucher provides access to the online application portal where you'll create an account and complete the application form.  You'll need to provide personal details, academic history, program choices, and upload necessary documents like certificates and transcripts. Make sure to review your application thoroughly before submitting it before the deadline.",
                "To apply to KNUST, prospective students need to purchase an eVoucher and then follow these steps: <br> <br>1. Visit the KNUST online admissions portal at <a href=\"https://apps.knust.edu.gh/admissions/apply/Account/Login\">https://apps.knust.edu.gh/admissions/apply/Account/Login</a>  <br>2. Enter the eVoucher credentials to access the application form. <br>3. Carefully complete all sections of the application, ensuring all required fields marked with an asterisk are filled.  <br>4. Save your progress as you go. You can exit and return to the application later if needed. <br>5. Provide your educational background, including details of your previous schools and certificates. If your specific institution is not listed, you can choose the \"Private\" option. <br>6. Enter your examination results accurately. If your examination type isn't listed, select \"Certification/Diploma/Degree.\" For the sitting, select \"May/June (School)\" if your exam wasn't WASSCE/SSSCE. Choose the correct year and input your Index Number (Candidate Number or Examination ID). <br>7. Select the subjects you took and input the corresponding grades. If you're awaiting results, choose the \"Awaiting\" option. For other certificates, input the grade/class accordingly. You can add multiple results or certificates as needed. <br>8. Upload all required documents in PDF format. These typically include your birth certificate and results slips or certificates. <br>9. Carefully read and agree to the applicant declaration. <br>10. Select your program choices, indicating your preferred stream (e.g., Regular). You can also indicate if you'd like to be considered for fee-paying options. <br>11. Upload a copy of your identification document (Ghana Card or Passport) in PDF format. <br>12. Review all information thoroughly before proceeding. <br>13. Agree to the final declaration confirming the accuracy of your application. <br>14. Submit your application and keep a copy for your reference.  <br> <br>Important Notes: <br> <br>*  Do not leave your application inactive for more than 5 minutes, as this will log you out. <br>* You can edit your application multiple times until the deadline. <br>* Review the specific entry requirements for your desired program to ensure you meet the criteria.  <br>* Applicants with international high school qualifications may need to have their certificates evaluated by the Ghana Tertiary Commission (GTEC) or an equivalent international credential evaluation agency.  <br>* Opting for the fee-paying option applies to the entire duration of your program of study.  <br>  <br>If you have further questions or require clarification, feel free to contact the KNUST admissions office for assistance.  <br>"
            ]
        },
        {
            "tag": "Application Deadline",
            "patterns": [
                "what is the price for application",
                "when is the application deadline?"
            ],
            "responses": [
                "The application deadline is October 31, 2024.",
                "The cost of the application form is GHc 250 for Ghanaian students. <br>"
            ]
        },
        {
            "tag": "Purchasing/buying Undergraduate Application Forms in Ghana",
            "patterns": [
                "which type of form should i buy for undergraduate distance programe?",
                "is there a short code i can use to buy the forms?",
                "where can i purchase application form in ghana?"
            ],
            "responses": [
                "Application forms can be purchased from all Ghana Post Regional and Designated Post Offices, including selected banks. <br> <br>You can also purchase forms via mobile money by:  <br> <br>1. Dialing *885# <br>2. Selecting \"Forms and E-voucher\" <br>3. Choosing \"KNUST\" <br>4. Selecting the specific form  <br>5. Authorizing the payment <br>6. Receiving your E-voucher via SMS <br> <br>To retrieve your E-voucher: <br> <br>1. Dial *885# <br>2. Select \"Forms and E-voucher\" <br>3. Enter \"1\" to retrieve the voucher code <br>4. Enter your Transaction ID <br>5. Your E-voucher details will be displayed.  <br> <br>For the most up-to-date pricing information, please visit the official KNUST website. Please note that there are no refunds after purchase.  <br>",
                "Application forms can be purchased from all Ghana Post Regional and Designated Post Offices, including selected banks. <br> <br>You can also purchase application forms via mobile money by: <br> <br>Dialing *885# <br> <br>1. Select Forms and E-voucher <br>2. Choose KNUST <br>3. Select the form you wish to purchase <br>4. Authorize Payment <br>5. Receive E-voucher via SMS  <br> <br>To retrieve your E-voucher: <br> <br>1. Dial *885# <br>2. Select Forms and E-voucher <br>3. Enter 1 to retrieve voucher code <br>4. Enter Transaction ID <br>5. E-voucher details will be displayed. <br> <br>For the most up-to-date information on application fees, please visit the official KNUST website. Please note that there are no refunds after purchase.  <br>",
                "<ul><li>Application forms can be purchased from all Ghana Post Regional and Designated Post Offices, including selected banks</li><li>Application forms can also be purchased via mobile:<br></li><br><ol><u>6 Easy Steps</u><li>Dial . <br>885#</li><li>Select Forms and E-voucher</li><li>Choose KNUST</li><li>Select the form you wish to purchase</li><li>Authorise Payment</li><li>Receive E-voucher via SMS</li></ol><br><ol><u>To Retrieve E-voucher</u><li>Dial <br>885#</li><li>Select Forms and E-voucher</li><li>Enter 1 to retrieve voucher code</li><li>Enter Transaction ID</li><li>E-voucher details displayed</li></ol></ul><br> The price is something around for Ghanaian undergraduate regular GHc 250. Please confirm the current price from the official KNUST website. No refund after purchase.",
                "Application forms can be purchased from all Ghana Post Regional and Designated Post Offices, including selected banks. <br><br>You can also purchase forms via mobile money by:<br><br>1. Dialing *885#<br>2. Selecting \"Forms and E-voucher\"<br>3. Choosing \"KNUST\"<br>4. Selecting the form you wish to purchase<br>5. Authorizing Payment<br>6. Receiving your E-voucher via SMS<br><br>To retrieve your E-voucher:<br><br>1. Dial *885#<br>2. Select \"Forms and E-voucher\"<br>3. Enter \"1\" to retrieve the voucher code<br>4. Enter your Transaction ID<br>5. Your E-voucher details will be displayed<br><br>I advise you to confirm the current price of the forms from the official KNUST website. Please note that there are no refunds after purchase. <br>"
            ]
        },
        {
            "tag": "institute of distance learning",
            "patterns": [
                "which undergraduate programmes allow distance?"
            ],
            "responses": [
                "As of the time being, I can only answer questions regarding undergraduate admissions."
            ]
        },
        {
            "tag": "multiple_results",
            "patterns": [
                "what are the requirements for political science?",
                "wassce"
            ],
            "responses": [
                "That's right. You can use results from multiple WASSCE sittings for your KNUST application. However, ensure you review the specific admission requirements for your chosen programme, as they may vary.",
                "You can find the specific entry requirements for Political Science at KNUST on the university's official website or prospectus."
            ]
        },
        {
            "tag": "political_studies_requirement",
            "patterns": [
                "i mean requirements for political studies"
            ],
            "responses": [
                "<ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:<br></b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:<br></b> History or Government and any one from Economics, Geography, French, Ghanaian Language, Literature in English, Religious Studies and any other General Arts Elective and a Pass in Social Studies.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level:<br></b> Credit passes in FIVE (5) subjects including English Language and Mathematics </p><p><b>'A' Level or equivalent:<br></b> Credit passes including History and/or Government and any One (1) or Two (2) from Economics, Geography, French, Religious Studies and Ghanaian Language.  Applicants must also have a pass in General Paper. </p><br><li><b><u>Mature applicants </u></b></li><ul><li>An applicant must be at least 25 years at the time of the application.  </li><li>An applicant must also satisfy the requirements for WASSCE/SSSCE OR 'A' Level. </li></ul></ul>"
            ]
        },
        {
            "tag": "shs_general_arts",
            "patterns": [
                "what are the requirements for supply chain and procurement?"
            ],
            "responses": [
                "To find the specific requirements for Supply Chain and Procurement at KNUST, you should check the university's official website or prospectus."
            ]
        },
        {
            "tag": "bsc_business_admin_requirements_logistics_supply_chain_mgmt_business_info_tech",
            "patterns": [
                "requirements for logistics and supply chain management"
            ],
            "responses": [
                "<ul><li> WASSCE/SSSCE:<br> Credit passes in English, Mathematics, Integrated Science, and three (3) electives from Business, General Arts, or General Science. <li> 'A' Level:<br> Five (5) 'O' Level credits (including English and Mathematics) and three (3) 'A' Level credits in General Arts, Business, and General Science. <li> Mature Applicants (25+ years):<br>  Meet WASSCE/SSSCE or 'A' Level requirements with credits in Business, General Arts, and General Science. Pass an entrance exam and interview. <li> GBCE/ABCE:<br>  Six (6) GBCE credits (including English and Business Mathematics) OR three (3) ABCE credits in compulsory and optional subjects. <li> ACCA/ICA/ACIB/CIM:<br> Three (3) WASSCE/SSSCE core and three (3) elective credits OR five (5) 'O' Level credits (including English and Mathematics). Admitted to year one. <li> HND (Second Class Lower Division or higher):<br> Three (3) WASSCE/SSSCE core and three (3) elective credits OR five (5) 'O' Level credits (including English and Mathematics). Placement in Year Two or Three after an entrance exam/interview. </ul>"
            ]
        },
        {
            "tag": "sociology_requirements",
            "patterns": [
                "what are the requirements for sociology?"
            ],
            "responses": [
                "Here are the requirements for BA. Sociology <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:<br></b> Credit passes in English Language, Mathematics, and Integrated Science </p><p><b>Elective Subjects:<br></b> Credit passes in THREE (3) from History, Geography, Literature in English, French, Ghanaian Language, Government, Business Management, Elective Mathematics, Economics and other General Arts Elective and Science Electives.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level:<br></b> Credit passes in FIVE (5) subjects including English Language and Mathematics. </p><p><b>'A' Level or equivalent:<br></b> Credit passes in THREE (3) subjects from Government, Religious Studies, History, Economics, and Literature in English, French, Ghanaian Language and Elective Mathematics. They must also have a pass in General Paper. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>An applicant must be at least 25 years at the time of the application.  </li><li>An applicant must also satisfy the requirements for WASSCE/SSSCE OR 'A' Level. </li></ul><br><li><b><u>DIPLOMA APPLICANTS </u></b></li><ul><li>Diploma in Social Work/Social Administration and any other relevant Diploma from an accredited university or Institution. </li><li>An applicant must pass a written examination and interview. Such candidates would be admitted into the second year of the Programme. </li></ul></ul>"
            ]
        },
        {
            "tag": "bsc_hospitality_tourism_management_requirements",
            "patterns": [
                "what are the requirements for hospitality management?"
            ],
            "responses": [
                "<ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:<br></b> Credit passes in English Language, Mathematics, and Integrated Science.  </p><p><b>Elective Subjects:<br></b> Credit passes in THREE (3) subjects from any of the following groups:<br> Business, General Arts, General Science, and Vocational/Home Economics. </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level:<br></b> Credit passes in FIVE (5) subjects including English Language and Mathematics. </p><p><b>'A' Level or equivalent:<br></b>  Credit passes in THREE (3) subjects in General Arts, Business, and General Science. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>An applicant should be at least 25 years at the time of submitting the application. </li><li>An applicant must satisfy the requirement for either 'A' Level or WASSCE/SSSCE with credit passes in THREE (3) Elective Subjects in Business, General Arts, General Science, and Vocational/Home Economics.  </li><li>Short-listed Applicants shall take an entrance examination and pass an interview.  </li></ul><br><li><b><u>OTHER APPLICANTS  </u></b></li><ul><li>General Business Certificate (GBCE) and/or Advanced Business Certificate (ABCE):<br>  </li><ul><li>Credit passes in at least SIX (6) subjects including English Language and Business Mathematics at the GBCE, or  </li><li>Credit passes in the THREE (3) relevant Compulsory Subjects and THREE (3) Optional Subjects at the ABCE.  </li><li>Applicants need both GBCE and ABCE to qualify. </li></ul><br><li>ACCA, ICA, ACIB or CIM:<br> </li><ul><li>Credit passes at WASSCE/SSSCE in THREE (3) Core Subjects and THREE Electives OR, </li><li>FIVE (5) credit passes at the 'O' Level including English Language and Mathematics. Applicants in this category are admitted into year one. </li></ul><br><li>HND with Second Class (Lower Division) and above:<br> </li><ul><li>Credit passes at WASSCE/SSSCE in THREE (3) Core subjects and THREE (3) Electives OR, </li><li>FIVE (5) credit passes at 'O' level including English language and mathematics. These applicants would be placed in either Year Two (2) or Year Three (3) after passing an entrance examination/interview. </li></ul></ul></ul>"
            ]
        },
        {
            "tag": "shs_general_science",
            "patterns": [
                "social sciences programmes",
                "college of social sciences programmes"
            ],
            "responses": [
                "The College of Social Sciences at KNUST offers programmes such as Sociology, Geography, Economics, Political Science, and Psychology.",
                "KNUST offers various Social Sciences programs such as Economics, Sociology, Geography, History, Political Studies, and Psychology. You can find specific requirements for each program in the KNUST admissions brochure."
            ]
        },
        {
            "tag": "humanities_and_social_sciences_programmes",
            "patterns": [
                "provide all programmes under college of humanities and social sciences including business school",
                "humanities and social sciences programmes",
                "provide all programmes under college of humanities and social sciences"
            ],
            "responses": [
                "<ul><li><b>Faculty Of Law</b><ul><li>Bachelor of Laws (LLB)</li></ul><br></li><li><b>Faculty of Social Science</b><ul><li>BA. Economics</li><li>BA. English</li><li>BA. Geography and Rural Development</li><li>BA. History</li><li>BA. Political Studies</li><li>BA. Akan Language and Culture</li><li>BA. French and Francophone Studies</li><li>BA. Linguistics</li><li>BA. Media and Communication Studies</li><li>BA. Religious Studies</li><li>BA. Sociology</li><li>BA. Social Work</li></ul></li></ul>",
                "<ul>  <li>    <b>Faculty Of Law</b>    <ul>      <li>Bachelor of Laws (LLB)</li>      <li>LLB (Degree Holders Only) (Fee-Paying)</li>    </ul>  </li>  <br/>  <li>    <b>Faculty of Social Science</b>    <ul>      <li>BA. Economics</li>      <li>BA. English</li>      <li>BA. Geography and Rural Development</li>      <li>BA. History</li>      <li>BA. Political Studies</li>      <li>BA. Akan Language and Culture</li>      <li>BA. French and Francophone Studies</li>      <li>BA. Linguistics</li>      <li>BA. Media and Communication Studies</li>      <li>BA. Religious Studies</li>      <li>BA. Sociology</li>      <li>BA. Social Work</li>    </ul>  </li></ul>",
                "<ul><li><b>Faculty Of Law</b><ul><li>Bachelor of Laws (LLB)</li><li>LLB (Degree Holders Only) (Fee-Paying)</li></ul><br></li><li><b>Faculty of Social Science</b><ul><li>BA. Economics</li><li>BA. English</li><li>BA. Geography and Rural Development</li><li>BA. History</li><li>BA. Political Studies</li><li>BA. Akan Language and Culture</li><li>BA. French and Francophone Studies</li><li>BA. Linguistics</li><li>BA. Media and Communication Studies</li><li>BA. Religious Studies</li><li>BA. Sociology</li><li>BA. Social Work</li></ul><br></li><li><b>KNUST School of Business</b><ul><li>BSc. Business Administration (Human Resource Management /Management)</li><li>BSc. Business Administration (Marketing/International Business)</li><li>BSc. Business Administration (Accounting / Banking and Finance)</li><li>BSc. Business Administration (Logistics and Supply Chain Management/Business Information Technology)</li><li>BSc. Hospitality and Tourism Management</li></ul></li></ul>"
            ]
        },
        {
            "tag": "Application Form Fees for Foreign Students",
            "patterns": [
                "what is the cost of application forms for foreign students?"
            ],
            "responses": [
                "Application forms for foreign students cost $150 (USD) for undergraduate programs and $170 (USD) for postgraduate programs. You can purchase the e-voucher from Ecobank, Ghana.  <br>",
                "The cost of application forms for foreign students can be found on the KNUST admissions website:<br> www. knust. edu. gh/admissions/prospective/applying",
                "The cost of application forms for foreign students is available at www. knust. edu. gh/admissions/prospective/applying."
            ]
        },
        {
            "tag": "Admission Portal Information",
            "patterns": [
                "what is the address for the knust admission portal?"
            ],
            "responses": [
                "You can access the KNUST admission portal at <a href=\"https://apps.knust.edu.gh/admissions/.\">https://apps.knust.edu.gh/admissions/.</a>  <br>",
                "You can access the KNUST admission portal at https:<br>//apps. knust. edu. gh/admissions/.",
                "You can access the KNUST admission portal via <a href=\"https://apps.knust.edu.gh/admissions/\">https://apps.knust.edu.gh/admissions/</a>  <br>",
                "You can access the KNUST admission portal through this link: <a href=\"https://apps.knust.edu.gh/admissions/\">https://apps.knust.edu.gh/admissions/</a> <br>"
            ]
        },
        {
            "tag": "Accommodation for Foreign/international Students on Campus",
            "patterns": [
                "where are foreign students accommodated on campus?"
            ],
            "responses": [
                "International students have a dedicated block at the university's main hostel,  Republic Hall. You can find other off-campus accommodation options within the university environs.  <br>",
                "International students have a variety of accommodation options both on and off campus. On-campus options include the various halls of residence, while off-campus options include private hostels and apartments. The university does not have a specific hostel designated only for foreign students. <br>",
                "International students at KNUST have various accommodation options both on and off-campus, including private hostels. GUSSS Hostel is one such option within the university campus."
            ]
        },
        {
            "tag": "sciences_programmes",
            "patterns": [
                "programmes available at college of science"
            ],
            "responses": [
                "The College of Science at KNUST offers a wide array of programs. Here's a comprehensive list:Faculty of Biosciences<br> BSc. Biochemistry<br> BSc. Food Science and Technology<br> BSc. Dietetics<br> BSc. Human Nutrition<br> BSc. Biological Science<br> BSc. Environmental Science<br> BSc. Environmental Science (Obuasi Campus)<br> Doctor of OptometryFaculty of Physical and Computational Sciences<br> BSc. Chemistry<br> BSc. Mathematics<br> BSc. Physics<br> BSc. Computer Science<br> BSc. Statistics<br> BSc. Actuarial Science<br> BSc. Meteorology and Climate Science",
                "The College of Science offers a variety of programs under its two faculties:<br><br>Faculty of Biosciences<br><br>* BSc. Biochemistry<br>* BSc. Food Science and Technology<br>* BSc. Dietetics<br>* BSc. Human Nutrition<br>* BSc. Biological Science<br>* BSc. Environmental Science<br>* BSc. Environmental Science (Obuasi Campus)<br>* Doctor of Optometry<br><br>Faculty of Physical and Computational Sciences<br><br>* BSc. Chemistry<br>* BSc. Mathematics<br>* BSc. Physics<br>* BSc. Computer Science <br>* BSc. Statistics<br>* BSc. Actuarial Science<br>* BSc. Meteorology and Climate Science <br>",
                "The College of Science offers a variety of programmes under two faculties:Faculty of Biosciences<br> BSc. Biochemistry<br> BSc. Food Science and Technology<br> BSc. Dietetics<br> BSc. Human Nutrition<br> BSc. Biological Science<br> BSc. Environmental Science<br> BSc. Environmental Science (Obuasi Campus)<br> Doctor of OptometryFaculty of Physical and Computational Sciences<br> BSc. Chemistry<br> BSc. Mathematics<br> BSc. Physics<br> BSc. Computer Science<br> BSc. Statistics<br> BSc. Actuarial Science<br> BSc. Meteorology and Climate Science",
                "The College of Science at KNUST offers a wide range of programmes under two faculties:<br>Faculty of Biosciences<br> BSc. Biochemistry<br> BSc. Food Science and Technology<br> BSc. Dietetics<br> BSc. Human Nutrition<br> BSc. Biological Science<br> BSc. Environmental Science<br> BSc. Environmental Science (Obuasi Campus)<br> Doctor of OptometryFaculty of Physical and Computational Sciences<br> BSc. Chemistry<br> BSc. Mathematics<br> BSc. Physics<br> BSc. Computer Science<br> BSc. Statistics<br> BSc. Actuarial Science<br> BSc. Meteorology and Climate Science"
            ]
        },
        {
            "tag": "Academic Resumption Dates",
            "patterns": [
                "when do we come to school?"
            ],
            "responses": [
                "The academic calendar is available on the university's website. Please visit www.knust.edu.gh, navigate to the 'Academics' section, and click on 'Academic Calendar' for the reporting dates for fresh and continuing students.  <br>",
                "The academic calendar with specific reporting dates for freshmen and continuing students is available on the university website. Please visit www. knust. edu. gh, navigate to the 'Academics' section, and click on 'Academic Calendar' for detailed information.",
                "The academic calendar for the academic year is available on the university website. Kindly visit www.knust.edu.gh/ , click on Academics, and then on the Academic Calendar to access the reporting dates for freshers and continuing students.  <br>",
                "The academic calendar is available on the university's website. Please visit www.knust.edu.gh, click on Academics, and then on Academic Calendar for the  resumption dates for freshmen and continuing students.  <br>",
                "The academic calendar is available on the university's website.  You can find it by visiting www.knust.edu.gh, clicking on Academics, and then on Academic Calendar.  <br>",
                "Kindly visit the university's website at www.knust.edu.gh, navigate to the 'Academics' section, and click on 'Academic Calendar' to find the resumption dates for both freshmen and continuing students.  <br>"
            ]
        },
        {
            "tag": "Commencement of Undergraduate Application Form Sales",
            "patterns": [
                "when do we start the sale of undergraduate application forms for each successive academic year?"
            ],
            "responses": [
                "The sale of undergraduate application forms typically commences between February and May each year. However, I highly recommend you confirm the exact dates on the official KNUST admissions portal closer to the time. You can find this information at www.knust.edu.gh/admissions.  <br>",
                "The sale of undergraduate application forms for the next academic year usually begins around February.  However, I highly recommend checking the exact dates on the KNUST admissions website closer to that time for the most accurate information:<br> www. knust. edu. gh/admissions/prospective/applying.",
                "The sale of undergraduate application forms typically begins in February/March for the following academic year. For specific dates and deadlines, please refer to the admission guidelines on our website: www.knust.edu.gh/admissions/prospective/applying. <br>"
            ]
        },
        {
            "tag": "Post-Admission Procedures (Undergraduate)",
            "patterns": [
                "what do i do when i get to know i have been admitted (undergraduate)?"
            ],
            "responses": [
                "Congratulations on gaining admission to KNUST! To complete your registration process, please follow these steps:1. Access the admission portal:<br>Visit [https://apps. knust. edu. gh/admissions/](https://apps. knust. edu. gh/admissions/)2. Log in:<br>Enter your application serial number and PIN. 3. Confirm Admission:<br>Click on 'Check Status' and confirm your admission offer. Print a copy for your records. 4. Print Important Documents:<br> Print your acceptance form and obtain your fee schedule from [www. knust. edu. gh/academic-fees](www. knust. edu. gh/academic-fees)5. Pay Fees:<br>Settle your academic fees as indicated on the fee schedule. 6. Accommodation:<br>Secure your accommodation through [https://accommodation. knust. edu. gh/](https://accommodation. knust. edu. gh/)7. Student Portal:<br>Log in to your student portal or download the AIM app (available on Apple App Store and Google Play Store). 8. Course Registration:<br> Register for your courses through the 'Course Registration' section on your student portal. 9. Assistance:<br>If you need help, visit the UITS Support Center located in the basement of the Casely-Hayford Building.",
                "Congratulations on gaining admission to KNUST! To officially accept your offer and commence your academic journey, kindly follow these steps: <br> <br>1. Visit the KNUST admissions portal at [<a href=\"https://apps.knust.edu.gh/admissions/](https://apps.knust.edu.gh/admissions/).\">https://apps.knust.edu.gh/admissions/](https://apps.knust.edu.gh/admissions/).</a> <br>2. Log in using your application serial number and PIN. <br>3. Check your admission status and print your admission letter.  <br>4. Print your acceptance form and obtain your fee schedule from [www.knust.edu.gh/academic-fees](www.knust.edu.gh/academic-fees). <br>5. Settle your academic fees promptly. <br>6. Secure your accommodation via [<a href=\"https://accommodation.knust.edu.gh/](https://accommodation.knust.edu.gh/).\">https://accommodation.knust.edu.gh/](https://accommodation.knust.edu.gh/).</a>  <br>7. Access the student portal or download the AIM app (available on Apple App Store and Google Play Store). <br>8. Proceed to register your courses for the semester through the \"Course Registration\" section on the portal. <br>9. If you require further assistance, visit the UITS Support Center located in the basement of the Casely-Hayford Building.  <br>",
                "Congratulations on gaining admission to KNUST! To finalize your enrollment, please follow these steps:<br><br>1. Access the admissions portal: Visit [<a href=\"https://apps.knust.edu.gh/admissions/](https://apps.knust.edu.gh/admissions/).<br>2.\">https://apps.knust.edu.gh/admissions/](https://apps.knust.edu.gh/admissions/).<br>2.</a> Log in: Enter your application serial number and PIN.<br>3. Confirm admission: Click on \"Check Status\" and confirm your admission offer. Print a copy for your records.<br>4. Print essential documents: Print your acceptance form and fee schedule. You can find the fee schedule at [www.knust.edu.gh/academic-fees](<a href=\"http://www.knust.edu.gh/academic-fees).<br>5.\">http://www.knust.edu.gh/academic-fees).<br>5.</a> Pay your fees: Follow the instructions provided on the fee schedule to make the necessary payment. <br>6. Secure accommodation (optional):  Visit [<a href=\"https://accommodation.knust.edu.gh/](https://accommodation.knust.edu.gh/)\">https://accommodation.knust.edu.gh/](https://accommodation.knust.edu.gh/)</a> to explore accommodation options and apply if needed.<br>7. Access your student portal: Log in to your student portal or download the AIM app from the Apple App Store or Google Play Store.<br>8. Register for courses: Click on \"Course Registration\" in the portal and register for your courses for the semester.<br>9. Seek assistance (if needed): Visit the UITS Support Center located in the basement of the Casely-Hayford Building if you require further assistance. <br>",
                "Congratulations on gaining admission to KNUST! To begin the process:<br>1. Access the admissions portal:<br> https:<br>//apps. knust. edu. gh/admissions/ 2. Log in:<br> Use your application serial number and PIN. 3. Confirmation:<br> Click \"Check Status\" to confirm your admission and print the document. 4. Print essential documents:<br> Print your admission letter and fee schedule:<br> www. knust. edu. gh/academic-fees 5. Fee Payment:<br> Settle your required fees. 6. Accommodation:<br> Secure your accommodation:<br> https:<br>//accommodation. knust. edu. gh/ 7. Student Portal:<br> Log in to the student portal or download the AIM app (available on Apple App Store and Google Play Store). 8. Course Registration:<br> Navigate to \"Course Registration\" within the portal and enroll in your courses for the semester. 9. Assistance:<br> Visit the UITS Support Center (located in the basement of the Casely-Hayford Building) if you require any further assistance."
            ]
        },
        {
            "tag": "general_admission_requirement",
            "patterns": [
                "what is the general admission requirement?"
            ],
            "responses": [
                "The provided response accurately addresses the user's question about KNUST's general admission requirements. It's comprehensive and covers various qualifications. However, it can be improved for clarity and readability:General Admission Requirements for Kwame Nkrumah University of Science and Technology (KNUST)KNUST accepts various qualifications for admission. Below are the general entry requirements:1. WASSCE/SSSCE<br> Credit passes (A1-C6 in WASSCE and A-D in SSSCE) in three core subjects:<br>English Language, Mathematics, and Integrated Science. <br> Credit passes in three WASSCE/SSSCE elective subjects relevant to your chosen program. <br> Aggregate score of 24 or better. 2. GCE/IGCSE (Cambridge) 'A' & 'O' Levels/Mature Applicants<br> Five credits at the 'O' Level, including English Language and Mathematics (or equivalent). <br> Passes in at least three subjects at the Advanced Level (or three credits for mature applicants). <br> Fulfillment of specific faculty or departmental requirements. 3. General Business Certificate Examination (GBCE) / Advanced Business Certificate Examination (ABCE)<br> GBCE:<br>Passes in three compulsory subjects, including English Language, and passes in three elective subjects, including Business Mathematics. <br> ABCE:<br>Passes in three compulsory subjects and three optional subjects relevant to your program. 4. International Baccalaureate (IB)<br> Minimum grade of 4 at the Higher Level (HL) in three subjects relevant to your program. <br> Minimum grade of 5 in Chemistry for Health and Allied Sciences programs. <br> Minimum grade of 5 at the Higher Level (HL) in Mathematics for Engineering programs. <br> Minimum grade of 4 in English Language and Mathematics at the Standard Level (SL). <br> At least grade C in a Science subject at the IGCSE level. 5. American High School Grade 12<br> Final Grade Point Average (GPA) of at least 3. 0 (3. 25 for the University School of Medicine and Dentistry). <br> Admission will be to Year 1. Other Important Information<br> Ghanaian/International Applicants with Foreign Certificates:<br> KNUST requires an evaluation from the Ghana Tertiary Commission (GTEC) and/or an international credential evaluation agency. <br> French-Speaking Applicants:<br>A minimum one-year English Proficiency Certificate is required. <br> Non-English Documents:<br>Provide accredited English translations. <br> Transfer Applicants:<br>Submit your official transcript, high school results, and a cover letter to the Deputy Registrar, Academic Affairs (admissions@knust. edu. gh) or the International Programmes Office (ipo@knust. edu. gh). Include proof of English proficiency and an English translation of your transcript if necessary.",
                "Below are the general entry requirements for candidates with WASSCE / SSSCE, GCE / IGCSE 'A' & 'O' LEVELS, ABCE / GBCE, MATURE and equivalent qualifications:<br><br>WASSCE/SSSCE APPLICANTS<br><br>An applicant for admission to a degree programme at KNUST must have CREDIT passes (A1 - C6 in WASSCE and A - D in SSSCE) in the THREE WASSCE/SSSCE Core Subjects (English Language, Mathematics, and Integrated Science), and CREDIT passes in THREE WASSCE/SSSCE Elective Subjects or its equivalent relevant to the chosen programme with aggregate 24 or better. It is worth noting that the THREE Core Subjects are prerequisite for all programmes of study at our university.<br><br>GCE/IGCSE (CAMBRIDGE) 'A' & 'O' LEVELS/MATURE APPLICANTS<br><br>Holders of GCE/IGCSE must have FIVE credits at the 'O' Level including English Language and Mathematics (or its approved equivalent), plus passes in at least THREE (3) subjects at the Advanced Level/Three Credits in the case of mature applicants. In addition, the applicant must fulfil the appropriate Faculty or Departmental requirements.<br><br>GENERAL BUSINESS CERTIFICATE EXAMINATION (GBCE)/ ADVANCED BUSINESS CERTIFICATE EXAMINATION (ABCE)<br><br>ABCE and GBCE are both needed to qualify an applicant for a programme. Holders of GBCE must have passes in THREE Compulsory Subjects including English Language and passes in THREE Elective Subjects including Business Mathematics. Holders of ABCE must have passes in THREE Compulsory Subjects plus THREE (3) Optional Subjects relevant to the programme of study.<br><br>INTERNATIONAL BACCALAUREATE (IB)<br><br>Holders of International Baccalaureate (IB) should have a minimum of grade 4 at the Higher Level (HL) in Three (3) Subjects relevant to the programme of choice and a minimum of grade 5 in Chemistry for Health and Allied Sciences. For Engineering, at least grade 5 at the Higher level (HL) in Mathematics. In addition, one must have a minimum of grade 4 in English Language and Mathematics at the Standard Level (SL) and at least grade C in a Science subject at the IGCSE.<br><br>AMERICAN HIGH SCHOOL GRADE 12<br><br>An applicant for admission to a degree programme at KNUST must have a Final Grade Point of at least 3.0. For admission to the University School of Medicine and Dentistry, an applicant must have a Final Grade Point of at least 3.25. Admissions will be to Year 1.<br><br>Other relevant information<br><br>*   Ghanaian/Other Applicants with Foreign Results/Certificate: The University requests an evaluation of results/Certificate other than those mentioned above from the Ghana Tertiary Commission (GTEC) and/or other International Credential Evaluation Agency to determine the suitability of the applicant for admission.<br>*   Applicants from French Speaking Countries must provide a minimum of one-year English Proficiency Certificate.<br>*   Documents not in English should be accompanied by accredited translations in English.<br>*   Transfer of Applicants: Applicants from other universities (local and international) seeking admission to continue their programme are required to submit official transcripts, high school results and a cover letter through the Deputy Registrar, Academic Affairs [here](<a href=\"mailto:admissions@knust.edu.gh\">admissions@knust.edu.gh</a>) or the International Programmes Office [here](<a href=\"mailto:ipo@knust.edu.gh\">ipo@knust.edu.gh</a>) to the Head of Department. Proof of English proficiency and English translation of the transcript must be added, where necessary.<br>",
                "Below are the general entry requirements for candidates with WASSCE / SSSCE, GCE / IGCSE 'A' & 'O' LEVELS, ABCE / GBCE, MATURE and equivalent qualifications:WASSCE/SSSCE APPLICANTSAn applicant for admission to a degree program at KNUST must have CREDIT passes (A1 - C6 in WASSCE and A - D in SSSCE) in the THREE WASSCE/SSSCE Core Subjects (English Language, Mathematics, and Integrated Science), and CREDIT passes in THREE WASSCE/SSSCE Elective Subjects or its equivalent relevant to the chosen program with an aggregate of 24 or better. The THREE Core Subjects are prerequisite for all programs of study at KNUST.GCE/IGCSE (CAMBRIDGE) 'A' & 'O' LEVELS/MATURE APPLICANTSHolders of GCE/IGCSE must have FIVE credits at the 'O' Level including English Language and Mathematics (or its approved equivalent), plus passes in at least THREE (3) subjects at the Advanced Level/Three Credits in the case of mature applicants. Applicants must also fulfill the appropriate Faculty or Departmental requirements.GENERAL BUSINESS CERTIFICATE EXAMINATION (GBCE)/ ADVANCED BUSINESS CERTIFICATE EXAMINATION (ABCE)ABCE and GBCE are both needed to qualify an applicant for a program. Holders of GBCE must have passes in THREE Compulsory Subjects including English Language and passes in THREE Elective Subjects including Business Mathematics. Holders of ABCE must have passes in THREE Compulsory Subjects plus THREE (3) Optional Subjects relevant to the program of study.INTERNATIONAL BACCALAUREATE (IB)Holders of the International Baccalaureate (IB) should have a minimum of grade 4 at the Higher Level (HL) in Three (3) Subjects relevant to the program of choice and a minimum of grade 5 in Chemistry for Health and Allied Sciences. For Engineering, at least grade 5 at the Higher level (HL) in Mathematics is required.  Applicants must also have a minimum of grade 4 in English Language and Mathematics at the Standard Level (SL) and at least grade C in a Science subject at the IGCSE.AMERICAN HIGH SCHOOL GRADE 12An applicant for admission to a degree program at KNUST must have a Final Grade Point of at least 3.0. For admission to the University School of Medicine and Dentistry, an applicant must have a Final Grade Point of at least 3.25. Admissions will be to Year 1. Other relevant information<br>   Ghanaian/Other Applicants with Foreign Results/Certificate:<br>KNUST requests an evaluation of results/certificates other than those mentioned above from the Ghana Tertiary Commission (GTEC) and/or other International Credential Evaluation Agency to determine applicant admission eligibility. <br>   Applicants from French Speaking Countries must provide a minimum of a one-year English Proficiency Certificate.<br>   Documents not in English should be accompanied by accredited translations in English.<br>   Transfer of Applicants:<br>Applicants from other universities (local and international) seeking admission to continue their program are required to submit official transcripts, high school results, and a cover letter through the Deputy Registrar of Academic Affairs ( [admissions@knust.edu.gh](mailto:admissions@knust.edu.gh) ) or the International Programmes Office ( [ipo@knust.edu.gh](mailto:ipo@knust.edu.gh) ) to the Head of Department. Proof of English proficiency and English translation of the transcript must be added, where necessary.",
                "The response, while accurate, is too verbose and poorly formatted. Here's a better option:KNUST has specific entry requirements depending on your chosen program and qualification type.  To help me guide you better, please tell me:<br> What program are you interested in?<br> What qualifications do you have (e.g., WASSCE, GBCE, etc.)?Once I have this information, I can provide you with the specific entry requirements. You can also find general admission guidelines on the KNUST website at [website address].",
                "The provided response is a good attempt at answering the question; however, it's too long and contains some information irrelevant to the user's intent. Here's a more suitable response:<br>To be eligible for admission to a degree program at KNUST, you must have obtained the following:<br> Core Subjects:<br>Credit passes (A1-C6 in WASSCE; A-D in SSSCE) in English Language, Mathematics, and Integrated Science. <br> Elective Subjects:<br>Credit passes (A1-C6 in WASSCE; A-D in SSSCE) in three elective subjects relevant to your chosen program. <br> Aggregate Score:<br>An aggregate score of 24 or better in your WASSCE/SSSCE results. For detailed entry requirements specific to different qualifications (GCE, ABCE, IB, etc. ), please visit the official KNUST website or contact the admissions office.",
                "Below are the general entry requirements for candidates with WASSCE / SSSCE, GCE / IGCSE 'A' & 'O' LEVELS, ABCE / GBCE, MATURE and equivalent qualifications:<br><br><li> <li><li>WASSCE/SSSCE APPLICANTS<li><li></li><br>An applicant for admission to a degree programme at KNUST must have CREDIT passes <li><li>(A1 - C6 in WASSCE and A - D in SSSCE)<li><li> in the THREE WASSCE/SSSCE Core Subjects <li><li>(English Language, Mathematics, and Integrated Science)<li><li>, and CREDIT passes in THREE WASSCE/SSSCE Elective Subjects or its equivalent relevant to the chosen programme with aggregate <li><li>24 or better<li><li>. It is worth noting that the THREE Core Subjects are prerequisite for all programmes of study at our university.</li><br><br><li> <li><li>GCE/IGCSE (CAMBRIDGE) 'A' & 'O' LEVELS/MATURE APPLICANTS<li><li></li><br>Holders of GCE/IGCSE must have FIVE credits at the 'O' Level including English Language and Mathematics (or its approved equivalent), plus passes in at least THREE (3) subjects at the Advanced Level/Three Credits in the case of mature applicants. In addition, the applicant must fulfil the appropriate Faculty or Departmental requirements.<br><br><li> <li><li>GENERAL BUSINESS CERTIFICATE EXAMINATION (GBCE)/ ADVANCED BUSINESS CERTIFICATE EXAMINATION (ABCE)<li><li></li><br>ABCE and GBCE are both needed to qualify an applicant for a programme. Holders of GBCE must have passes in THREE Compulsory Subjects including English Language and passes in THREE Elective Subjects including Business Mathematics. Holders of ABCE must have passes in THREE Compulsory Subjects plus THREE (3) Optional Subjects relevant to the programme of study.<br><br><li> <li><li>INTERNATIONAL BACCALAUREATE (IB)<li><li></li><br>Holders of the International Baccalaureate (IB) should have a minimum of grade 4 at the Higher Level (HL) in Three (3) Subjects relevant to the programme of choice and a minimum of grade 5 in Chemistry for Health and Allied Sciences. For Engineering, at least grade 5 at the Higher level (HL) in Mathematics. In addition, one must have a minimum of grade 4 in English Language and Mathematics at the Standard Level (SL) and at least grade C in a Science subject at the IGCSE.<br><br><li> <li><li>AMERICAN HIGH SCHOOL GRADE 12<li><li></li><br>An applicant for admission to a degree programme at KNUST must have a Final Grade Point of at least 3.0. For admission to the University School of Medicine and Dentistry, an applicant must have a Final Grade Point of at least 3.25. Admissions will be to Year 1.<br><br><br><li><li>Other relevant information<li><li>:</li><br><br><li> <li><li>Ghanaian/Other Applicants with Foreign Results/Certificate:<li><li> KNUST shall request an evaluation of results/Certificate other than those mentioned above from the Ghana Tertiary Commission (GTEC) and/or other International Credential Evaluation Agency to facilitate determining the applicant's suitability for admission.</li><br><li> Applicants from French Speaking Countries must provide a minimum of one-year English Proficiency Certificate.</li><br><li> Documents not in English should be accompanied by accredited translations in English.</li><br><li> <li><li>Transfer of Applicants:<li><li> Applicants from other universities (local and international) seeking admission to continue their programme are required to submit official transcripts, high school results and a cover letter through the Deputy Registrar, Academic Affairs [here](<a href=\"mailto:admissions@knust.edu.gh\">admissions@knust.edu.gh</a>) or the International Programmes Office [here](<a href=\"mailto:ipo@knust.edu.gh\">ipo@knust.edu.gh</a>) to the Head of Department. Proof of English proficiency and an English translation of the transcript must be added, where necessary.</li><br>",
                "Below are the general entry requirements for candidates with WASSCE / SSSCE, GCE / IGCSE 'A' & 'O' LEVELS, ABCE / GBCE, MATURE and equivalent qualifications: <br> <br>*   WASSCE/SSSCE APPLICANTS <br>    An applicant for admission to a degree programme at KNUST must have CREDIT passes (A1 - C6 in WASSCE and A - D in SSSCE) in the THREE WASSCE/SSSCE Core Subjects (English Language, Mathematics, and Integrated Science), and CREDIT passes in THREE WASSCE/SSSCE Elective Subjects or its equivalent relevant to the chosen programme with aggregate 24 or better. It is worth noting that the THREE Core Subjects are prerequisite for all programmes of study at our university. <br> <br>*   GCE/IGCSE (CAMBRIDGE) 'A' & 'O' LEVELS/MATURE APPLICANTS <br>    Holders of GCE/IGCSE must have FIVE credits at the 'O' Level including English Language and Mathematics (or its approved equivalent), plus passes in at least THREE (3) subjects at the Advanced Level/Three Credits in the case of mature applicants. In addition, the applicant must fulfil the appropriate Faculty or Departmental requirements. <br> <br>*   GENERAL BUSINESS CERTIFICATE EXAMINATION (GBCE)/ ADVANCED BUSINESS CERTIFICATE EXAMINATION (ABCE) <br>    ABCE and GBCE are both needed to qualify an applicant for a programme. Holders of GBCE must have passes in THREE Compulsory Subjects including English Language and passes in THREE Elective Subjects including Business Mathematics. Holders of ABCE must have passes in THREE Compulsory Subjects plus THREE (3) Optional Subjects relevant to the programme of study. <br> <br>*   INTERNATIONAL BACCALAUREATE (IB) <br>    Holders of International Baccalaureate (IB) should have a minimum of grade 4 at the Higher Level (HL) in Three (3) Subjects relevant to the programme of choice and a minimum of grade 5 in Chemistry for Health and Allied Sciences. For Engineering, at least grade 5 at the Higher level (HL) in Mathematics. In addition, one must have a minimum of grade 4 in English Language and Mathematics at the Standard Level (SL) and at least grade C in a Science subject at the IGCSE. <br> <br>*   AMERICAN HIGH SCHOOL GRADE 12 <br>    An applicant for admission to a degree programme at KNUST must have a Final Grade Point of at least 3.0. For admission to the University School of Medicine and Dentistry, an applicant must have a Final Grade Point of at least 3.25. Admissions will be to Year 1. <br> <br>Other relevant information <br> <br>*   Ghanaian/Other Applicants with Foreign Results/Certificate: KNUST shall request an evaluation of results/Certificate other than those mentioned above from the Ghana Tertiary Commission (GTEC) and/or other International Credential Evaluation Agency to facilitate the determination of the suitability of the applicant for admission. <br>*   Applicants from French Speaking Countries must provide a minimum of one-year English Proficiency Certificate. <br>*   Documents not in English should be accompanied by accredited translations in English. <br>*   Transfer of Applicants: Applicants from other universities (local and international) who are seeking admission to continue their programme are required to submit official transcripts, high school results and a cover letter through the Deputy Registrar, Academic Affairs [here](<a href=\"mailto:admissions@knust.edu.gh\">admissions@knust.edu.gh</a>) or the International Programmes Office [here](<a href=\"mailto:ipo@knust.edu.gh\">ipo@knust.edu.gh</a>) to the Head of Department. Proof of English proficiency and English translation of the transcript must be added, where necessary. <br>",
                "Below are the general entry requirements for candidates with WASSCE / SSSCE, GCE / IGCSE 'A' & 'O' LEVELS, ABCE / GBCE, MATURE and equivalent qualifications:<br> WASSCE/SSSCE APPLICANTSAn applicant for admission to a degree programme at KNUST must have CREDIT passes (A1 - C6 in WASSCE and A - D in SSSCE) in the THREE WASSCE/SSSCE Core Subjects (English Language, Mathematics, and Integrated Science), and CREDIT passes in THREE WASSCE/SSSCE Elective Subjects or its equivalent relevant to the chosen programme with aggregate 24 or better. It is worth noting that the THREE Core Subjects are prerequisite for all programmes of study at our university.<br> GCE/IGCSE (CAMBRIDGE) 'A' & 'O' LEVELS/MATURE APPLICANTSHolders of GCE/IGCSE must have FIVE credits at the 'O' Level including English Language and Mathematics (or its approved equivalent), plus passes in at least THREE (3) subjects at the Advanced Level/Three Credits in the case of mature applicants. In addition, the applicant must fulfil the appropriate Faculty or Departmental requirements.<br> GENERAL BUSINESS CERTIFICATE EXAMINATION (GBCE)/ ADVANCED BUSINESS CERTIFICATE EXAMINATION (ABCE)ABCE and GBCE are both needed to qualify an applicant for a programme. Holders of GBCE must have passes in THREE Compulsory Subjects including English Language and passes in THREE Elective Subjects including Business Mathematics. Holders of ABCE must have passes in THREE Compulsory Subjects plus THREE (3) Optional Subjects relevant to the programme of study.<br> INTERNATIONAL BACCALAUREATE (IB)Holders of International Baccalaureate (IB) should have a minimum of grade 4 at the Higher Level (HL) in Three (3) Subjects relevant to the programme of choice and a minimum of grade 5 in Chemistry for Health and Allied Sciences. For Engineering, at least grade 5 at the Higher level (HL) in Mathematics. In addition, one must have a minimum of grade 4 in English Language and Mathematics at the Standard Level (SL) and at least grade C in a Science subject at the IGCSE.<br> AMERICAN HIGH SCHOOL GRADE 12An applicant for admission to a degree programme at KNUST must have a Final Grade Point of at least 3.0. For admission to the University School of Medicine and Dentistry, an applicant must have a Final Grade Point of at least 3.25. Admissions will be to Year 1.Other relevant information:<br> Ghanaian/Other Applicants with Foreign Results/Certificate:<br>KNUST shall request an evaluation of results/Certificate other than those mentioned above from the Ghana Tertiary Commission (GTEC) and/or other International Credential Evaluation Agency to facilitate determining the applicant's suitability for admission.<br> Applicants from French Speaking Countries must provide a minimum of one-year English Proficiency Certificate.<br> Documents not in English should be accompanied by accredited translations in English.<br> Transfer of Applicants:<br>Applicants from other universities (local and international) seeking admission to continue their programme are required to submit official transcripts, high school results and a cover letter through the Deputy Registrar, Academic Affairs [here](admissions@knust.edu.gh) or the International Programmes Office [here](ipo@knust.edu.gh) to the Head of Department. Proof of English proficiency and English translation of the transcript must be added, where necessary.",
                "<ul>Below are the general entry requirements for candidates with WASSCE / SSSCE, GCE / IGCSE 'A' & 'O' LEVELS, ABCE / GBCE, MATURE, and equivalent qualifications:<br><br><li><li>WASSCE/SSSCE APPLICANTS<li><li></li><br><br>An applicant for admission to a degree programme at KNUST must have CREDIT passes <li><li>(A1 - C6 in WASSCE and A - D in SSSCE)<li><li> in the THREE WASSCE/SSSCE Core Subjects <li><li>(English Language, Mathematics, and Integrated Science)<li><li>, and CREDIT passes in THREE WASSCE/SSSCE Elective Subjects or their equivalent relevant to the chosen programme with an aggregate of <li><li>24 or better<li><li>. The THREE Core Subjects are prerequisite for all programmes of study at KNUST.</li><br><br><li><li>GCE/IGCSE (CAMBRIDGE) 'A' & 'O' LEVELS/MATURE APPLICANTS<li><li></li><br><br>Holders of GCE/IGCSE must have FIVE credits at the 'O' Level, including English Language and Mathematics (or their approved equivalent), plus passes in at least THREE (3) subjects at the Advanced Level/Three Credits in the case of mature applicants. Applicants must also fulfil the appropriate Faculty or Departmental requirements.<br><br><li><li>GENERAL BUSINESS CERTIFICATE EXAMINATION (GBCE)/ ADVANCED BUSINESS CERTIFICATE EXAMINATION (ABCE)<li><li></li><br><br>ABCE and GBCE are both needed to qualify an applicant for a programme. Holders of GBCE must have passes in THREE Compulsory Subjects, including English Language, and passes in THREE Elective Subjects, including Business Mathematics. Holders of ABCE must have passes in THREE Compulsory Subjects plus THREE (3) Optional Subjects relevant to the programme of study.<br><br><li><li>INTERNATIONAL BACCALAUREATE (IB)<li><li></li><br><br>Holders of the International Baccalaureate (IB) should have a minimum grade of 4 at the Higher Level (HL) in Three (3) Subjects relevant to the programme of choice and a minimum grade of 5 in Chemistry for Health and Allied Sciences. For Engineering, at least grade 5 at the Higher level (HL) in Mathematics is required. Applicants must also have a minimum grade of 4 in English Language and Mathematics at the Standard Level (SL) and at least a grade C in a Science subject at the IGCSE.<br><br><li><li>AMERICAN HIGH SCHOOL GRADE 12<li><li></li><br><br>An applicant for admission to a degree programme at KNUST must have a Final Grade Point of at least 3.0. For admission to the University School of Medicine and Dentistry, an applicant must have a Final Grade Point of at least 3.25. Admissions will be to Year 1.<br><br><li><li>Other Relevant Information<li><li></li><br><br><li>   <li><li>Ghanaian/Other Applicants with Foreign Results/Certificate:<li><li> KNUST requests an evaluation of results/certificates other than those mentioned above from the Ghana Tertiary Commission (GTEC) and/or another International Credential Evaluation Agency to determine applicant admission suitability.</li><br><li>   Applicants from French Speaking Countries must provide a minimum of a one-year English Proficiency Certificate.</li><br><li>   Documents not in English should be accompanied by accredited English translations.</li><br><li>   <li><li>Transfer of Applicants:<li><li> Applicants from other universities (local and international) seeking admission to continue their programme are required to submit official transcripts, high school results, and a cover letter through the Deputy Registrar, Academic Affairs ([<a href=\"mailto:admissions@knust.edu.gh\">admissions@knust.edu.gh</a>](mailto:<a href=\"mailto:admissions@knust.edu.gh\">admissions@knust.edu.gh</a>)) or the International Programmes Office ([<a href=\"mailto:ipo@knust.edu.gh\">ipo@knust.edu.gh</a>](mailto:<a href=\"mailto:ipo@knust.edu.gh\">ipo@knust.edu.gh</a>)) to the Head of Department. Proof of English proficiency and an English translation of the transcript must be added, where necessary.</li><br></ul>"
            ]
        },
        {
            "tag": "health_sciences_programmes",
            "patterns": [
                "college of health sciences programmes available"
            ],
            "responses": [
                "The College of Health Sciences offers a variety of programmes under the following schools and faculties:<br><br><li><li>Faculty of Allied Health Sciences<li><li><br><br><li>   BSc. Physiotherapy and Sports Science<br><li>   BSc. Medical Imaging<br><li>   BSc. Medical Laboratory Science<br><li>   <li><li>BSc. Medical Laboratory Science (Obuasi Campus)<li><li><br><br><li><li>School of Nursing and Midwifery<li><li><br><br><li>   BSc. Nursing<br><li>   <li><li>BSc. Nursing (Obuasi Campus)<li><li><br><li>   Nursing (Emergency Option for Practicing Nurses Only)<br><li>   BSc. Midwifery <li><li>(Females only)<li><li><br><li>   BSc. Midwifery (Females practicing Midwives only) <li><li>(Sandwich)<li><li><br><li>   <li><li>BSc. Midwifery (Obuasi Campus)<li><li><br><br><li><li>Faculty of Pharmacy and Pharmaceutical Sciences<li><li><br><br><li>   Bachelor of Herbal Medicine (BHM)<br><li>   Doctor of Pharmacy (Pharm D)<br><li>   Doctor of Pharmacy (Pharm D) - 2 years Top-Up (Practicing Pharmacists only)<br><br><li><li>School of Medicine and Dentistry<li><li><br><br><li>   Human Biology (Medicine) (MBChB)<br><li>   802 Bachelor of Dental Surgery (BDS) (Fee-paying only)<br><br><li><li>School of Veterinary Medicine<li><li><br><br><li>   Doctor of Veterinary Medicine (DVM)<br><br><li><li>School of Public Health<li><li><br><br><li>   BSc. Disability and Rehabilitation Studies <br>"
            ]
        },
        {
            "tag": "engineering_programmes",
            "patterns": [
                "what are the programmes available at college of engineering"
            ],
            "responses": [
                "The College of Engineering at KNUST offers a variety of programmes:<br><br>Faculty of Civil and Geo-Engineering<br><br>* BSc. Civil Engineering<br>* BSc. Civil Engineering (Obuasi Campus)<br>* BSc. Geological Engineering<br>* BSc. Geological Engineering (Obuasi)<br>* BSc. Geomatic Engineering<br>* BSc. Geomatic Engineering (Obuasi Campus)<br>* BSc. Petroleum Engineering<br><br>Faculty of Electrical and Computer Engineering<br><br>* BSc. Biomedical Engineering<br>* BSc. Computer Engineering<br>* BSc. Electrical/Electronic Engineering<br>* BSc. Electrical/Electronic Engineering (Obuasi Campus)<br>* BSc. Telecommunications Engineering<br><br>Faculty of Mechanical and Chemical Engineering<br><br>* BSc. Agricultural Engineering<br>* BSc. Petrochemical Engineering<br>* BSc. Chemical Engineering<br>* BSc. Metallurgical Engineering<br>* BSc. Metallurgical Engineering (Obuasi Campus)<br>* BSc. Materials Engineering<br>* BSc. Materials Engineering (Obuasi Campus)<br>* BSc. Marine Engineering<br>* BSc. Industrial Engineering<br>* BSc. Automobile Engineering<br>* BSc. Mechanical Engineering<br>* BSc. Mechanical Engineering (Obuasi Campus)<br>* BSc. Aerospace Engineering <br>",
                "The College of Engineering at KNUST offers a variety of programmes under three faculties: <br> <br>Faculty of Civil and Geo-Engineering <br>* BSc. Civil Engineering <br>* BSc. Civil Engineering (Obuasi Campus) <br>* BSc. Geological Engineering <br>* BSc. Geological Engineering (Obuasi Campus) <br>* BSc. Geomatic Engineering <br>* BSc. Geomatic Engineering (Obuasi Campus) <br>* BSc. Petroleum Engineering <br> <br>Faculty of Electrical and Computer Engineering <br>* BSc. Biomedical Engineering <br>* BSc. Computer Engineering <br>* BSc. Electrical/Electronic Engineering <br>* BSc. Electrical/Electronic Engineering (Obuasi Campus) <br>* BSc. Telecommunications Engineering <br> <br>Faculty of Mechanical and Chemical Engineering <br>* BSc. Agricultural Engineering <br>* BSc. Petrochemical Engineering <br>* BSc. Chemical Engineering <br>* BSc. Metallurgical Engineering <br>* BSc. Metallurgical Engineering (Obuasi Campus) <br>* BSc. Materials Engineering <br>* BSc. Materials Engineering (Obuasi Campus) <br>* BSc. Marine Engineering <br>* BSc. Industrial Engineering <br>* BSc. Automobile Engineering <br>* BSc. Mechanical Engineering <br>* BSc. Mechanical Engineering (Obuasi Campus) <br>* BSc. Aerospace Engineering <br>"
            ]
        },
        {
            "tag": "accepted_examination_results",
            "patterns": [
                "what are the accepted examination results?"
            ],
            "responses": [
                "Examination results accepted for application:<br><br>* West African Senior Secondary Certificate Examination (WASSCE)/Senior Secondary School Certificate Examination (SSSCE)<br>* WASSCE International<br>* International Baccalaureate<br>* American High School Grade 12<br>* General Business Certificate Examination (GBCE) and Advanced Business Certificate Examination (ABCE)<br>* General Certificate Examination (GCE)/International General Certificate of Secondary Education (IGCSE) (Cambridge) Ordinary and Advanced Level<br>* Higher National Diploma (HND) Applicants: HND Certificate plus High School Results<br>* Post-First-Degree Law Applicants: First-degree certificate plus High School Results<br>* Doctor of Pharmacy Top-Up Applicants: First Degree Certificate (BPharm) plus High School Results and Pharmacy Licensure Certificate.<br>* Other International High School Results <br>",
                "Examination results accepted for application to KNUST include: <br> <br>* West African Senior Secondary Certificate Examination (WASSCE)/Senior Secondary School Certificate Examination (SSSCE) <br>* WASSCE International <br>* International Baccalaureate <br>* American High School Grade 12 <br>* General Business Certificate Examination (GBCE) and Advanced Business Certificate Examination (ABCE) <br>* General Certificate Examination (GCE)/International General Certificate of Secondary Education (IGCSE) (Cambridge) Ordinary and Advanced Level <br>* Higher National Diploma (HND) Applicants: HND Certificate plus High School Results <br>* Post-First-Degree Law Applicants: First-degree certificate plus High School Results <br>* Doctor of Pharmacy Top-Up Applicants: First Degree Certificate (BPharm) plus High School Results and Pharmacy Licensure Certificate. <br>* Other International High School Results  <br>"
            ]
        },
        {
            "tag": "Undergraduate Admission Status",
            "patterns": [
                "when can i check my admission status as an undergraduate student?"
            ],
            "responses": [
                "You can check your admission status by following these steps:<br>1. Visit the KNUST admissions portal: [<a href=\"https://apps.knust.edu.gh/admissions](https://apps.knust.edu.gh/admissions)\">https://apps.knust.edu.gh/admissions](https://apps.knust.edu.gh/admissions)</a> <br>2. Click on \"Login\".<br>3. Enter your application serial number and PIN.<br>4. Click on \"Log in\".<br>5. Click on \"Check Status\". <br>"
            ]
        },
        {
            "tag": "fallback",
            "patterns": [
                "i am eating fufu",
                "can you list anything i can come along to school?"
            ],
            "responses": [
                "I'm sorry, I couldn't understand that. Could you please rephrase or ask a different question? <br>",
                "Items allowed in the halls of residence vary depending on your hall and room type. However, generally, students are permitted to bring personal belongings like clothes, toiletries, bedding, and study materials. It's best to check with your assigned hall for a specific list of permitted and restricted items. <br>"
            ]
        },
        {
            "tag": "random",
            "patterns": [
                "what are you like?"
            ],
            "responses": [
                "I am an admissions advisor here to provide information about Kwame Nkrumah University of Science and Technology and the admissions process.  How can I help you today? <br>"
            ]
        },
        {
            "tag": "creator",
            "patterns": [
                "who made you?",
                "who are you?",
                "who created you?"
            ],
            "responses": [
                "I am an AI chatbot, so I do not have creators in the traditional sense. I was developed using advanced technology to assist you with information about Kwame Nkrumah University of Science and Technology. <br>",
                "I am an admissions advisor here to help you with information about Kwame Nkrumah University of Science and Technology admissions. <br>",
                "I am TechChat, a virtual assistant designed to provide information about KNUST admissions. <br>",
                "I am TechChat, a virtual assistant here to help you with your admissions inquiries at KNUST. How can I be of assistance today? <br>"
            ]
        },
        {
            "tag": "accommodation",
            "patterns": [
                "what is the weather like?",
                "do you know the price of the hostel?",
                "what are the hostels available?"
            ],
            "responses": [
                "KNUST provides six halls of residence for student accommodation: Queen Elizabeth II Hall, Unity Hall, Independence Hall, Republic Hall, University Hall, and Africa Hall. These halls accommodate both male and female students. <br><br>In addition to the halls of residence, there are numerous privately-owned hostels around the KNUST campus.  You can find a list of recommended hostels on the KNUST website at:<br><br>* [www.knust.edu.gh/students/housing](www.knust.edu.gh/students/housing) <br>* [www.knust.edu.gh/index.php/students/recommended-hostels-20202021-academic-year](www.knust.edu.gh/index.php/students/recommended-hostels-20202021-academic-year)<br><br>For hostel fees, visit the hostel websites or contact them directly.  The fee schedule for traditional halls is available on the KNUST website. <br>",
                "Kumasi has a tropical climate with an average temperature of 75°F (24°C).  You can expect a rainy season from March to July, and a relatively dry season from August to February.  I recommend bringing light clothing for the warm weather and an umbrella or raincoat. <br>",
                "To find the cost of accommodation, do well to check the fee schedule for the price of traditional halls. For hostels, do well to visit their website or contact them for the current prices. <br>"
            ]
        },
        {
            "tag": "Positive Feedback/Appreciation",
            "patterns": [
                "thank you"
            ],
            "responses": [
                "You're welcome! Is there anything else I can help you with regarding admissions to KNUST? 😊  <br>",
                "You're welcome! Anything else I can help you with? <br>"
            ]
        },
        {
            "tag": "programme_change",
            "patterns": [
                "what do i do if i do want the programme and i want to change it"
            ],
            "responses": [
                "You can apply for a programme change after admission but before you start your first semester. You will need to meet the entry requirements for the new programme and get approval from both departments. Visit the admissions office for more information and guidance. <br>"
            ]
        },
        {
            "tag": "Scholarships for Needy Students",
            "patterns": [
                "do you have scholarship opportunities for students?"
            ],
            "responses": [
                "KNUST offers various scholarship opportunities for brilliant but needy students to enable them to pursue university education. Some of these include the Edu Fondazione Scholarship, Hulede Foundation KNUST Scholarship, and Educational Pathways International Scholarships.  <br> <br>In addition to these, there are other grants and bursaries available to support students financially. You can also explore external scholarship opportunities.  <br> <br>I advise you to carefully review the requirements for each scholarship as they vary. For detailed information on available scholarships for KNUST students, please visit www.knust.edu.gh/students/scholarships-and-grants.  <br>"
            ]
        },
        {
            "tag": "obuasi_campus_cut_off_aggregate",
            "patterns": [
                "obuasi campus cut off points"
            ],
            "responses": [
                "The cut-off aggregate for KNUST Obuasi Campus is not predetermined. It may vary from year to year based on the pass rate and the available space/resources for each program. However, you can use the cut-off aggregates from the previous academic year as a guide: <br> <br>Faculty of Engineering Sciences: <br> <br>* BSc. Civil Engineering: 14 <br>* BSc. Electrical/Electronic Engineering: 13 <br>* BSc. Geological Engineering: 16 <br>* BSc. Geomatic (Geodetic) Engineering: 17 <br>* BSc. Materials Engineering: 18 <br>* BSc. Mechanical Engineering: 14 <br>* BSc. Metallurgical Engineering: 19 <br> <br>Faculty of Allied Health Sciences: <br> <br>* BSc. Medical Laboratory Sciences: 10 <br>* BSc. Midwifery: 12 <br>* BSc. Nursing: 11 <br> <br>College of Humanities and Social Sciences: <br> <br>* BBA (HRM/Management): 16 <br>* BBA (Marketing/International Business): 17 <br>* BBA (Accounting/Banking and Finance): 13 <br>* BBA (Logistics & Supply Chain Management/Business Information Technology): 15 <br> <br>Faculty of Science: <br> <br>* BSc. Environmental Sciences: 18 <br> <br>Remember that these are just a guide, and the actual cut-off points may be higher or lower. I encourage you to apply to your desired program even if your aggregate is slightly below the previous year's cut-off.  <br>"
            ]
        }
    ]
}