{
    "intents": [
        {
            "tag": "Directions/Reach to KNUST",
            "patterns": [
                "How can you direct me to reach KNUST",
                "How do I get to KNUST from elsewhere?",
                "What's the best way to reach KNUST?",
                "Can you provide directions to reach KNUST?",
                "I'm coming from another city. How can I reach KNUST?",
                "What transportation options are available to reach to KNUST?"
            ],
            "responses": [
                "KNUST is located in Kumasi, the Garden City, in the Ashanti Region of Ghana. For persons within and around the Kumasi Metropolis, the first access point to Ghana's No.1 University is Tech. Junction, a major station just outside the main gate of the University. From any point in and around the metropolis, one can board any vehicle, be it private or commercial to Tech Junction. Outside Kumasi, one can get to KNUST by either driving to Kumasi or by boarding a Kumasi Bound bus and then locating Tech. Junction. From the Tech Junction, there are available options to enable you to reach your destination on campus."
            ],
            "context_set": ""
        },


        {
            "tag": "Transportation/Navigation within KNUST Campus",
            "patterns": [
                "How do I navigate around KNUST campus?",
                "What are the transportation options within KNUST campus?",
                "Can you provide information on getting around KNUST campus?",
                "How do I travel from one place to another within KNUST campus?"
            ],
            "responses": [
                "Getting around campus is easy either by foot, taxi, or shuttle services. Taxis use designated routes that lead you to and fro various halls of residence on campus and to Tech. Junction. Shuttles lead to and fro various halls of residence on campus, academic areas, and also to the commercial area of KNUST. However, shuttles occasionally go to and fro Tech. Junction when more services to transport to the main campus are required."
            ],
            "context_set": ""
        },


        {
            "tag": "Transportation Fare/Price rates to KNUST",
            "patterns": [
                "What are the transportation fare rates to KNUST?",
                "Can you provide information on transportation fares to KNUST?",
                "How much does it cost to get to KNUST from different locations?",
                "What are the prices for transportation to KNUST?"
            ],
            "responses": [
                "Transport fares from various cities, towns, and villages differ based on the distance to Kumasi and the type of vehicle available. You may check fares at various stations to know how much it costs to get to Kumasi from your current location. From Tech. Junction to main campus, it costs a nominal fee to join a shuttle or commercially registered KNUST embossed taxi. However, transport fares for chartered vehicles may vary."
            ],
            "context_set": ""
        },


        {
            "tag": "Driving Directions to KNUST",
            "patterns": [
                "Can you provide driving directions to KNUST?",
                "How do I drive to KNUST?",
                "I'm planning to drive to KNUST. What route should I take?",
                "What are the driving directions from [location] to KNUST?"
            ],
            "responses": [
                "For those driving to KNUST, the university is located in Kumasi, the Garden City, in the Ashanti Region of Ghana. You can plan your route to Tech Junction, a major station just outside the main gate of the University. From Tech Junction, there are available options to enable you to reach your destination on campus."
            ],
            "context_set": ""
        },


        {
            "tag": "facilities",
            "patterns": [
                "What facilities does KNUST offer?",
                "Can you describe the facilities available at KNUST?",
                "What are the different types of facilities at KNUST?",
                "Can you provide an overview of KNUST's facilities?",
                "Tell me about the accommodation options at KNUST.",
                "What accommodation facilities are there at KNUST?",
                "What are the traditional halls of residence at KNUST?",
                "What academic facilities does KNUST have?",
                "Describe the academic resources available at KNUST.",
                "What libraries and research centers are available at KNUST?",
                "What sporting facilities are available at KNUST?",
                "Can you list the sports amenities at KNUST?",
                "What commercial services are provided on the KNUST campus?",
                "Tell me about the commercial area at KNUST.",
                "What kind of healthcare services does KNUST offer?",
                "What medical facilities are available at KNUST?",
                "How does KNUST support student healthcare?"
            ],
            "responses": [
                "Here are the facilities available at KNUST: <ul><li><b><u>Accommodation</u></b></li><p>KNUST has six traditional halls of residence:</p><ul><li>University Hall</li><li>Unity Hall</li><li>Africa Hall</li><li>Queen Elizabeth II Hall</li><li>Independence Hall</li><li>Republic Hall</li></ul><p>Additionally, there are numerous private hostels on and around campus.</p><br><li><b><u>Academic Facilities</u></b></li><p>KNUST boasts a wide range of academic facilities:</p><ul><li>Lecture Halls: Modern and well-equipped for various courses.</li><li>Laboratories: State-of-the-art labs for disciplines such as engineering, science, and health.</li><li>Computer Labs: Accessible to students for research and coursework.</li><li>Libraries: Including the main KNUST Library and various college and departmental libraries.</li><li>Research Centers and Institutes: Examples include the Kumasi Center for Collaborative Research (KCCR) and the West African Science Service Center on Climate Change and Adapted Land Use (WASCAL).</li></ul><br><li><b><u>Sporting Facilities</u></b></li><p>KNUST offers a variety of sports amenities:</p><ul><li>Paa Joe Sports Stadium: Seats about 40,000 spectators and hosts numerous sports events.</li><li>Swimming Pool: For swimming and aquatic sports.</li></ul><br><li><b><u>Commercial Area</u></b></li><p>The KNUST Commercial Area serves as a hub for various services:</p><ul><li>Shops: Provide daily necessities and other goods.</li><li>Restaurants: Offer diverse dining options for students and staff.</li><li>Banks: Ensure financial services are easily accessible.</li><li>Other Businesses: Cater to a wide range of needs, from printing services to electronics.</li></ul><br><li><b><u>Healthcare</u></b></li><p>KNUST has comprehensive healthcare facilities:</p><ul><li>University Hospital: Provides extensive medical care for students, faculty, and staff.</li><li>Students' Clinic: Offer specialized services and general medical consultations.</li></ul></ul>"
            ],
            "context_set": ""
        },


        {
            "tag": "Accommodation Options at KNUST",
            "patterns": [
                "What are the accommodation options available at KNUST?",
                "Can you provide information about housing options at KNUST?",
                "Where can I stay while studying at KNUST?"
            ],
            "responses": [
                "There are Six Halls of residence and a number of hostels on the University Campus. They are Queen Elizabeth II Hall, Unity Hall, Independence Hall, Republic Hall, University Hall, and Africa Hall. All the Six Halls of residence are mixed (Male and Female). Of the five hostels, two are for postgraduate students, one for both undergraduate and graduate students and managed by the Ghana Universities Staff Superannuation Scheme (GUSSS)."
            ],
            "context_set": ""
        },


        {
            "tag": "accommodation_policy_international_students",
            "patterns": [
                "What is the accommodation policy for international students at KNUST?",
                "Where are international students accommodated at KNUST?",
                "Can international students stay off-campus at KNUST?"
            ],
            "responses": [
                "As part of the measures to improve the security of our Students, particularly International Students and to ensure the provision of an enabling residential facility and environment for their studies and stay, it is the policy of the University that all International Students are to be accommodated on Campus in University's Halls of Residence, GUSSS, Hall Seven, and SRC Hostels Facilities. It is therefore an offence for any International Student to lodge outside the designated places."
            ],
            "context_set": ""
        },

        
        {
            "tag": "private_hostel_accommodation",
            "patterns": [
                "Where can I find private hostel accommodation near KNUST?",
                "What are the options for private accommodation in Kumasi?",
                "Can you provide information about off-campus housing near KNUST?",
                "what are some of the hostels off campus",
                "what are some of the hostels outside campus"
            ],
            "responses": [
                "There is a wide range of private hostel accommodation for students of KNUST to consider in Kumasi. These range from hostels with shared kitchen and bathroom facilities to flats, those with the study bedrooms having their own private bathrooms and small kitchenettes. Some of the hostels even have air conditioners and internet connectivity in the study bedrooms. All of them are self-catering. Kumasi is a fantastic city to live in, and living in your own accommodation away from the University will afford you the best opportunity to experience the vibrant and diverse nature of the city. However, private hostel accommodation is not easy to find and costs are considerably high in Kumasi."
            ],
            "context_set": ""
        },


        {
            "tag": "residential_facilities_administration",
            "patterns": [
                "How are residential facilities administered at KNUST?",
                "Who manages the residential facilities at KNUST?",
                "Can you provide information about the administration of halls of residence at KNUST?"
            ],
            "responses": [
                "The University currently has six Halls of Residence. The GUSSS, Graduate Students, Credit Union and the SRC have a Hostel each on campus. Ghana Hostels Limited also has residential facility on campus. The three are managed differently from the main halls. A Hall Council consisting of Senior and Junior members administers each Hall. The Executive Head of the Hall is the Hall Master who is assisted by a Senior Tutor. There is also a Hall Bursar and other supporting staff. The Hall authorities determine the number of students in a room. The Hall authorities of the various Halls constitute the Committee of Hall Administrators who formulates common policies for all the Halls."
            ],
            "context_set": ""
        },


        {
            "tag": "academic_calendar_fees_schedule",
            "patterns": [
                "Where can I find the latest academic schedules and updates?",
                "What should freshmen and continuing students do regarding payments and registrations?",
                "Can you provide information about the academic calendar and fees schedule?"
            ],
            "responses": [
                "All freshmen and continuing students are requested to visit the Academic Calendar page for the latest schedules and updates. Also visit the Fees Schedule page for fees updates."
            ],
            "context_set": ""
        },


        {
            "tag": "provisional_admission_offer",
            "patterns": [
                "How can successful applicants obtain their Provisional Offer of Admission letter?",
                "What is the process for printing the Provisional Offer of Admission letter?",
                "Can you provide information about obtaining the Provisional Offer of Admission?"
            ],
            "responses": [
                "Successful applicants are to Print Provisional Offer of Admission letter online."
            ],
            "context_set": ""
        },


        {
            "tag": "acceptance_letter_submission",
            "patterns": [
                "What should successful applicants do after printing the Provisional Offer of Admission?",
                "How can applicants submit their Acceptance letter?",
                "Can you provide information about submitting the Acceptance letter?"
            ],
            "responses": [
                "Download and print Acceptance letter to be filled and sent to the Deputy Registrar (Academic Affairs), Kwame Nkrumah University of Science & Technology, Private Mail Bag, Kumasi, Ghana."
            ],
            "context_set": ""
        },


        {
            "tag": "submission_original_certificates_international_students",
            "patterns": [
                "What documents do international students need to submit?",
                "How can international students submit their original certificates?",
                "Can you provide information about document submission for international students?"
            ],
            "responses": [
                "International students are to submit original certificates as well as scratch card from WAEC to Room 109 at the Main Administration Block."
            ],
            "context_set": ""
        },


        {
            "tag": "payment_afuf",
            "patterns": [
                "How can students pay the Academic Facility User Fees?",
                "Where should students pay the AFUF?",
                "Can you provide information about paying the AFUF?"
            ],
            "responses": [
                "Students are to pay Academic Facility User Fees (AFUF) into KNUST Fees Collection ACCOUNT at any branch of Ghana Commercial Bank Ltd, Standard Chartered Bank Ltd, Ecobank Ghana Ltd, HFC Bank, CAL Bank, UBA, Ghana Post Company Limited."
            ],
            "context_set": ""
        },


        {
            "tag": "payment_rfuf",
            "patterns": [
                "How can students pay the Residential Facility User Fees?",
                "Where should students pay the RFUF?",
                "Can you provide information about paying the RFUF?"
            ],
            "responses": [
                "Students are to pay Residential Facility User Fees (RFUF) of Halls they have been affiliated to at any Ghana Commercial Bank branch and obtain a receipt."
            ],
            "context_set": ""
        },


        {
            "tag": "booking_accommodation_international_students",
            "patterns": [
                "How can international students book accommodation?",
                "Where should international students book accommodation?",
                "Can you provide information about booking accommodation for international students?"
            ],
            "responses": [
                "International students assigned to GUSSS HOSTEL as Resident Students are to book for accommodation at least 72 hours before arrival. Students should contact the GUSSS Hostel secretariat via email: <a target=\"_blank\" href=\"mailto:gusss@knust.edu.gh\">gusss@knust.edu.gh</a> for further enquiries."
            ],
            "context_set": ""
        },


        {
            "tag": "payment_college_association_dues",
            "patterns": [
                "How can students pay College/Association dues?",
                "Where should students pay the College/Association dues?",
                "Can you provide information about paying College/Association dues?"
            ],
            "responses": [
                "College/Association dues are to be paid separately at any branch of Ghana Commercial bank or HFC."
            ],
            "context_set": ""
        },


        {
            "tag": "freshmen_orientation",
            "patterns": [
                "What does the University offer during freshmen orientation?",
                "Can you provide information about freshmen orientation?",
                "What happens during the orientation for freshmen?"
            ],
            "responses": [
                "The University offers Orientation for freshmen after the admissions processes to inform freshmen about the university community. The Dean of Student’s Office makes two separate presentations at the fresher’s orientation. The first one is on the General services provided to students and the second presentation is on the Guidance and Counselling services available to the students at the Dean of Students Office."
            ],
            "context_set": ""
        },


        {
            "tag": "orientation_areas_covered",
            "patterns": [
                "What are some of the areas covered during freshmen orientation?",
                "Can you list the topics discussed during the orientation?",
                "What topics are included in the orientation sessions?"
            ],
            "responses": [
                "Some of the areas talked about during the University orientation include The University Chaplaincy, The University Library and Its Resources, The University Hospital and Its Resources, Student Affairs, Security on Campus, University Rules and Regulations vis-a-vis the Laws of Ghana, Fire Prevention on Campus, etc."
            ],
            "context_set": ""
        },


        {
            "tag": "orientation_organizers",
            "patterns": [
                "Who organizes the freshmen orientation?",
                "Which department is responsible for the orientation sessions?",
                "Can you provide information about the organizers of the orientation?"
            ],
            "responses": [
                "Orientations, which have been decentralized, are organized by the colleges of the university."
            ],
            "context_set": ""
        },


        {
            "tag": "freshers_medical_examination",
            "patterns": [
                "What is the purpose of the medical examination for Freshers' at KNUST?",
                "Can you provide information about the medical examination for Freshers' at KNUST?",
                "What do Freshers' need to know about the medical examination at KNUST?"
            ],
            "responses": [
                "The University Health Service of the Kwame Nkrumah University of Science and Technology WELCOMES all First Year Students (Freshers’) intending to pursue academic studies in this great university. The University Health Service, in accordance with regulations on admissions of students for academic studies, will be conducting medical examinations for Freshers’ in order to determine their medical fitness to pursue their respective academic programmes."
            ],
            "context_set": ""
        },


        {
            "tag": "medical_examination_period_location",
            "patterns": [
                "When and where will the medical examinations take place?",
                "Can you provide details about the period and location of the medical examinations?",
                "Where can Freshers' go for their medical examinations and during what time?"
            ],
            "responses": [
                "The medical examinations will be done at the Students’ Clinic (located on campus, opposite the Chancellor’s Hall and the main hospital, KNUST Hospital(located on campus, opposite the Ghana Commercial Bank at Tech Junction)). The purpose of the medical examination is to identify diseases that can affect your academic work and guide the medical staff to offer assistance to enable you pursue your studies."
            ],
            "context_set": ""
        },


        {
            "tag": "procedure_medical_examination",
            "patterns": [
                "What is the procedure for the medical examination?",
                "Can you explain how Freshers' should go about the medical examination process?",
                "How should Freshers' proceed with the medical examination?"
            ],
            "responses": [
                " <ol> <li>LOG ONTO the University Health Service MEDICAL EXAMINATION WEB PAGE with your USER NAME and PASSWORD </li> <li>Complete the ON-LINE MEDICAL EXAMINATION FORM (QUESTIONNAIRE). Remember to click the DECLARATION button on completion of questionnaire </li> <li> Report to the STUDENTS' CLINIC for the medical examination </li> </ol>"
            ],
            "context_set": ""
        },


        {
            "tag": "content_medical_examination",
            "patterns": [
                "What will be included in the medical examination?",
                "Can you describe the content of the medical examination?",
                "What tests will be conducted during the medical examination?"
            ],
            "responses": [
                "During the examination your weight, height, blood pressure, temperature will be checked, a chest x-ray taken and a blood test for sickle cell gene done. No test for HIV will be done. A thorough physical examination will be done, by a medical doctor of the University Health Service, who will then discuss with you the outcome of the examination. Please feel free to ask the doctor any questions that you need answers to."
            ],
            "context_set": ""
        },


        {
            "tag": "matriculation_event",
            "patterns": [
                "What is matriculation at KNUST?",
                "Can you explain the process of matriculation at KNUST?",
                "What does matriculation entail at KNUST?"
            ],
            "responses": [
                "Matriculation is the event where a freshman is officially inducted as a student of KNUST. A freshman must fulfill all the requirements and obligations the school sets for him/her to be matriculated. Notable obligations and requirements include compulsory Orientation, Registration, and Medical Screening."
            ],
            "context_set": ""
        },


        {
            "tag": "matriculation_requirements",
            "patterns": [
                "What are the requirements for matriculation at KNUST?",
                "Can you list the obligations for matriculation at KNUST?",
                "What must a freshman do to be matriculated at KNUST?"
            ],
            "responses": [
                "To be matriculated at KNUST, a freshman must fulfill all the requirements and obligations set by the school. Notable obligations and requirements include compulsory Orientation, Registration, and Medical Screening."
            ],
            "context_set": ""
        },


        {
            "tag": "matriculation_failure",
            "patterns": [
                "What happens if a student fails to be matriculated?",
                "Can you explain the consequences of not being matriculated?",
                "What happens if a freshman is not matriculated at KNUST?"
            ],
            "responses": [
                "Any student who fails to be matriculated without any valid reason will not be accepted as a student of KNUST."
            ],
            "context_set": ""
        },


        {
            "tag": "student_name_policy",
            "patterns": [
                "What is the policy regarding student names at KNUST?",
                "Can you explain the rules for student names at KNUST?",
                "How does KNUST handle student names?"
            ],
            "responses": [
                "For the purpose of the University, students are known only by the names used in completing their application for admission and are known by those names only in the sequence in which they are written."
            ],
            "context_set": ""
        },


        {
            "tag": "marriage_name_change",
            "patterns": [
                "What happens if a female student gets married?",
                "Can you explain the process for name change after marriage for female students?",
                "How does marriage affect a female student's name at KNUST?"
            ],
            "responses": [
                "When a female student contracts marriage, she may apply to have her name changed to include the surname acquired by the marriage. The application shall be supported by a marriage certificate or requisite documentary evidence."
            ],
            "context_set": ""
        },


        {
            "tag": "name_change_restrictions",
            "patterns": [
                "Can students change their names at KNUST?",
                "What is the policy on changing names for students at KNUST?",
                "Are there any restrictions on name changes for students at KNUST?"
            ],
            "responses": [
                "The University shall not entertain change of names of any form. Once a student has been registered with a name, he/she goes through his/her programme with that name."
            ],
            "context_set": ""
        },


        {
            "tag": "campus_living",
            "patterns": [
                "What are the facilities like",
                "What are the accommodation options at KNUST?",
                "Can you tell me about living on campus at KNUST?",
                "What are the residential facilities like at KNUST?"
            ],
            "responses": [
                "Living on campus connects you to the full range of opportunities that KNUST has to offer. KNUST boasts of six traditional halls of residence: University, Unity, Africa, Queen Elizabeth II, Independence, and Republic Halls, all of which are mixed-sex halls. Additionally, there are private hostels available around the campus and in Kumasi for students who could not be admitted as resident students due to limited facilities."
            ],
            "context_set": ""
        },


        {
            "tag": "non_resident_facilities",
            "patterns": [
                "Are there facilities for non-resident students at KNUST?",
                "What amenities are available for students who do not live on campus?",
                "Can you tell me about the facilities for non-resident students at KNUST?"
            ],
            "responses": [
                "There are non-resident facilities on campus located near Club 'B' and the Central Classroom Block, where non-resident students can take a rest between lectures and do their own private studies before they leave for their various homes and hostels."
            ],
            "context_set": ""
        },


        {
            "tag": "dining_options",
            "patterns": [
                "What dining options are available at KNUST?",
                "Can you tell me about the food joints at KNUST?",
                "Where can I find food on campus at KNUST?",
                "Are there dining options on campus"
            ],
            "responses": [
                "KNUST and its neighboring suburbs have a diverse range of restaurants serving local and international cuisine. There are over 30 dining locations in and around campus, offering plenty of variety and convenience. The dining halls of the six halls of residence offer a variety of dishes and snacks at affordable prices to students, and most restaurants around campus offer room services."
            ],
            "context_set": ""
        },


        {
            "tag": "business_centers",
            "patterns": [
                "Are there business centers on campus?",
                "What services do the business centers at KNUST offer?",
                "Can you tell me about the commercial area at KNUST?"
            ],
            "responses": [
                "KNUST houses numerous business centers, particularly in the commercial area, which is the main business hub of the university. The commercial area features banks, a post office, a well-resourced bookshop, mini-marts, printing and photocopy shops, as well as a shuttle and taxi station."
            ],
            "context_set": ""
        },


        {
            "tag": "ICT_facilities",
            "patterns": [
                "What ICT facilities are available at KNUST?",
                "Can you tell me about the ICT infrastructure at KNUST?",
                "Where can I find ICT centers at KNUST?"
            ],
            "responses": [
                "KNUST boasts a network of ICT facilities and installations across campus and its neighboring suburbs. All six halls on campus have Wi-Fi installations for easy internet access. Additionally, there are ICT centers, internet hotspots, and Tech Hub facilities, including a fast-speed Vodafone Internet Cafe, to aid students in their academic work."
            ],
            "context_set": ""
        },


        {
            "tag": "student_representation",
            "patterns": [
                "How are students represented at KNUST?",
                "Can you tell me about student associations at KNUST?",
                "What student representative bodies exist at KNUST?"
            ],
            "responses": [
                "KNUST students are officially represented at each level of association. The Students' Representative Council (SRC) represents the whole student body, while students also belong to college, faculty, or department associations. This democratic institution ensures that the voices of major stakeholders are expressed and considered together to enhance university administration."
            ],
            "context_set": ""
        },


        {
            "tag": "clubs_and_societies",
            "patterns": [
                "What clubs and societies are available at KNUST?",
                "Can you tell me about student organizations at KNUST?",
                "Where can I find information about clubs and societies at KNUST?"
            ],
            "responses": [
                "There are numerous clubs and societies on campus, ranging from Old School associations to common interest groups. With over 100 student groups and organizations on campus, students are encouraged to start new clubs to fit their interests, resulting in a continually expanding number of student groups. All student groups are governed and managed by students, providing a diverse range of activities and interests for the KNUST community."
            ],
            "context_set": ""
        },


        {
            "tag": "social_life",
            "patterns": [
                "What social activities are available for students at KNUST?",
                "Can you tell me about student social life at KNUST?",
                "How does KNUST support students' social activities?"
            ],
            "responses": [
                "KNUST recognizes the importance of social activities alongside academics. Outside the classroom, students can engage in a variety of activities to enhance their campus experience. The Junior Common Room Committees organize students' social life on campus and serve as liaisons between the student body and Hall authorities. The Students' Representative Council (SRC) coordinates activities across various Junior Common Room Committees. Additionally, Faculty societies offer extracurricular activities for junior members of specific Faculties, ensuring that students have ample opportunities for social engagement and enjoyment."
            ],
            "context_set": ""
        },


        {
            "tag": "dean_of_students",
            "patterns": [
                "What is the role of the Dean of Students at KNUST?",
                "Can you tell me about the Office of the Dean of Students at KNUST?",
                "Who is responsible for the welfare and discipline of students at KNUST?"
            ],
            "responses": [
                "The Dean of Students at KNUST is responsible for the welfare and discipline of all students, acting in loco parentis. Since its establishment in 1998, the Office of the Dean of Students has provided essential welfare support services to students, fostering both academic and personal success. The office, located in the Commercial Area of campus, aims to assist students in becoming responsible members of the university community through purposeful programs.",
                "The Office of the Dean of Students at KNUST was formally established in 1997 to provide necessary welfare support services for students during their period of study. Over the years, the office has fulfilled its mission by assisting students in understanding university operations at both social and academic levels, understanding regulations and procedures, and getting their needs met. It has also provided opportunities for students to develop and enhance their leadership skills, involve them in decision-making processes, support advocacy for students, and provide conflict resolution techniques. The office is organized into sections to provide support to the student body of the university community, including Administration, Student Guidance and Counselling, International Student Affairs, Student Representative Council Affairs, Students Housing and Residence Life, Student Conduct and Discipline, Student Support Services, and Financial Services."
            ],
            "context_set": ""
        },


        {
            "tag": "library",
            "patterns": [
                "What can you tell me about the KNUST Library?",
                "Can you provide information about the University Library at KNUST?",
                "How old is the University Library at KNUST?",
                "Do you have a library?"
            ],
            "responses": [
                "The KNUST Library has been an integral part of the university since its inception. Established in 1952 with 4,000 volumes from the Teacher Training Department of Achimota College, it has grown significantly over the years. Currently located near the Great Hall, the library boasts a stock of about 214,692 volumes and a journal holding of over 3,850 titles, with a seating capacity of 1,420."
            ],
            "context_set": ""
        },


        {
            "tag": "university_health_services",
            "patterns": [
                "What services does the University Health Services provide?",
                "Can you tell me about the University Hospital at KNUST?",
                "Where is the University Hospital located?"
            ],
            "responses": [
                "The University Health Services at KNUST oversees the University Hospital, a 24-Hour General Hospital located in the North-eastern part of the campus, along the Kumasi-Accra Highway. The hospital consists of 100 beds and cots, an Out-Patient Department (OPD), four wards, an operation theatre, laboratory, X-Ray, maternity, maternal and child health units, dispensary, medical records unit, dental clinic, and eye clinic."
            ],
            "context_set": ""
        },


        {
            "tag": "international_programmes_office",
            "patterns": [
                "What is the purpose of the International Programmes Office at KNUST?",
                "Can you tell me about the International Programmes Office at KNUST?",
                "What services does the International Programmes Office provide?"
            ],
            "responses": [
                "The International Programmes Office at KNUST aims to advance knowledge in science and technology for sustainable development in Africa and the world. Serving as a link between the local community and the outside world, the office provides an environment for teaching, research, and entrepreneurship training in science and technology for the industry and socio-economic development. It is open to all people and positioned to attract scholars, industrialists, and entrepreneurs from Africa and the international community."
            ],
            "context_set": ""
        },


        {
            "tag": "security_service",
            "patterns": [
                "Can you provide information about the security service at KNUST?",
                "What role does the security service play at KNUST?",
                "How does KNUST ensure campus safety?"
            ],
            "responses": [
                "KNUST has its own private security service, with personnel stationed at various vantage points across campus day and night to ensure the safety of all members of the University community. The mission of the KNUST Security Service is to maintain a safe and secure campus by providing quality policing. To ensure maximum safety, the University community also has a role to play."
            ],
            "context_set": ""
        },


        {
            "tag": "security_tips",
            "patterns": [
                "What are some security tips for students on campus?",
                "Can you provide safety advice for students at KNUST?",
                "How can students ensure their safety on campus?"
            ],
            "responses": [
                "Here are some security tips for students at KNUST: <ul> <li>Remember to lock your door whenever you are leaving your room. </li> <li>Change promptly the lock in your door when your key is missing and report the incident </li> <li>Lock your door when asleep</li> <li>Record the registration number of every commercial vehicle you board during your rounds</li> <li>Never board a taxi with all-male occupants already in. Beware also of taxis with a female passenger and two or more male occupants. </li> <li>As much as possible, patronize the campus shuttle vehicles</li> <li>Always walk in pairs, or in groups and at well-lit areas </li> <li>Avoid using isolated footpaths and shortcuts </li> <li>Avoid the services of errand boys; they may monitor your movements and rob you later or give information to their accomplices </li> <li>Do not entertain hawkers in the Halls; they may be criminals </li> <li>Beware of the type of friends you entertain in your rooms; they may be predators and criminals </li> <li>Beware of travel agents on campus; some are fraudsters </li> <li>Report every unusual occurrence promptly to the security office for immediate assistance. </li> </ul>"
            ],
            "context_set": ""
        },


        {
            "tag": "security_contacts",
            "patterns": [
                "What are the important telephone numbers for KNUST Security Service in Kumasi?",
                "Can you provide the hotline and office numbers for KNUST Security Service?",
                "How can students contact the KNUST Security Service?"
            ],
            "responses": [
                "Here are the important telephone numbers for KNUST Security Service in Kumasi: <ul> <li>KNUST Security (Hotline): 03220-62999 </li> <li>Police Buffalo: 03220-33545 </li> <li>KNUST Security (Office): 03220-60229 </li> <li>Police Information: 03220-22323 </li> <li>KNUST Police Station: 03220-60051 </li> </ul>"
            ],
            "context_set": ""
        }
    ]
}