{
    "intents": [
        {
            "tag": "bsc_human_biology_medicine_requirements",
            "patterns": [
                "What are the requirements for BSc. Human Biology Medicine?",
                "Can you provide the admission criteria for BSc. Human Biology?",
                "Requirements for BSc. Human Biology Medicine programme?",
                "What are the prerequisites for BSc. Human Biology (Medicine) (MBChB)?",
                "BSc. Human Biology Medicine MBChB admission requirements?",
                "Information on eligibility for BSc. Human Biology?",
                "What are the entry requirements for BSc. Human Biology programme?",
                "Criteria for admission into BSc. Human Biology Medicine?",
                "BSc. Human Biology Medicine programme prerequisites?",
                "requirement for medicine",
                "what is the requirement for medicine",
                "what subjects do i need to read medicine?",
                "What are the admission requirements for BSc Human Biology Medicine?",
                "BSc Human Biology Medicine entry criteria?",
                "Requirements to study BSc Human Biology Medicine?",
                "What subjects are needed for BSc Human Biology Medicine?",
                "What do I need to apply for BSc Human Biology Medicine?",
                "BSc Human Biology Medicine prerequisites?",
                "Admission criteria for BSc Human Biology Medicine programme?",
                "Eligibility for BSc Human Biology Medicine?",
                "What are the entry requirements for BSc Human Biology Medicine?",
                "Core subjects for BSc Human Biology Medicine?",
                "Elective subjects required for BSc Human Biology Medicine?",
                "What is needed to get into BSc Human Biology Medicine?",
                "BSc Human Biology Medicine application requirements?",
                "What qualifications are required for BSc Human Biology Medicine?",
                "BSc Human Biology Medicine programme entry requirements?",
                "What do you need to qualify for BSc Human Biology Medicine?",
                "Prerequisites for BSc Human Biology Medicine?",
                "Requirements for MBChB in Human Biology Medicine?",
                "What is required to study Human Biology Medicine?",
                "Criteria for BSc Human Biology Medicine admission?",
                "What are the admission criteria for Human Biology Medicine?",
                "Requirements for MBChB in Human Biology?",
                "What subjects are required for Human Biology Medicine MBChB?",
                "BSc Human Biology Medicine admission criteria?",
                "Eligibility criteria for BSc Human Biology Medicine?",
                "Requirements for pursuing BSc Human Biology Medicine?",
                "What subjects are needed for Human Biology Medicine?",
                "Core and elective subjects for BSc Human Biology Medicine?",
                "Entry requirements for Human Biology Medicine programme?",
                "Prerequisites for applying to BSc Human Biology Medicine?",
                "What qualifications are needed for BSc Human Biology?",
                "Requirements for BSc Human Biology Medicine MBChB?",
                "What do you need to apply for Human Biology Medicine?",
                "BSc Human Biology Medicine admission requirements?",
                "What are the core subjects for Human Biology Medicine?",
                "Elective subjects for BSc Human Biology Medicine?",
                "Entry criteria for BSc Human Biology Medicine programme?",
                "BSc Human Biology Medicine programme requirements?",
                "What qualifications are necessary for BSc Human Biology Medicine?",
                "BSc Human Biology Medicine admission prerequisites?",
                "Requirements to enter BSc Human Biology Medicine programme?",
                "Core and elective requirements for BSc Human Biology Medicine?",
                "What do I need to study BSc Human Biology Medicine?",
                "Requirements for the BSc Human Biology Medicine course?",
                "BSc Human Biology Medicine entry qualifications?",
                "What subjects are required for admission to BSc Human Biology Medicine?",
                "BSc Human Biology Medicine requirements for admission?"
            ],
            "responses": [
                "Here are the requirements for BSc. Human Biology (Medicine) (MBChB) <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><ul><li>Programmes may be followed with a 3-year clinical programme for the MB. ChB degree </li><li>Short-listed Applicants must pass an interview.    </li></ul><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Human Biology Medicine Cutoff Points",
            "patterns": [
                "cutoff points for BSc Human Biology Medicine",
                "cutoff points for BSc Human Biology",
                "cutoff points for Medicine",
                "BSc Human Biology Medicine cutoff points",
                "minimum score for BSc Human Biology Medicine",
                "required score for BSc Human Biology Medicine",
                "aggregate for BSc Human Biology Medicine",
                "aggregate for BSc Human Biology",
                "aggregate for Medicine",
                "what is the cutoff for BSc Human Biology Medicine",
                "cutoff marks for BSc Human Biology Medicine",
                "BSc Human Biology Medicine required marks",
                "what aggregate do I need for BSc Human Biology Medicine",
                "score needed for BSc Human Biology Medicine",
                "cutoff points for Human Biology Medicine",
                "aggregate requirements for Human Biology Medicine",
                "what were the cut-off aggregates for Human Biology Medicine",
                "what are the cut-off aggregates Human Biology Medicine",
                "What are the cutoff points for BSc Human Biology Medicine?",
                "BSc Human Biology Medicine cutoff marks?",
                "Minimum aggregate for BSc Human Biology Medicine?",
                "Required aggregate for BSc Human Biology Medicine?",
                "What is the aggregate needed for BSc Human Biology Medicine?",
                "Cutoff score for BSc Human Biology Medicine?",
                "What are the cutoff marks for BSc Human Biology Medicine?",
                "BSc Human Biology Medicine score requirements?",
                "Aggregate cutoff for BSc Human Biology Medicine?",
                "What were the cutoff points for BSc Human Biology Medicine last year?",
                "BSc Human Biology Medicine entry score?",
                "Cutoff aggregates for BSc Human Biology Medicine?",
                "What is the required score for BSc Human Biology Medicine?",
                "Minimum score for admission to BSc Human Biology Medicine?",
                "BSc Human Biology Medicine admission cutoff?",
                "What is the cutoff aggregate for Human Biology Medicine?",
                "Cutoff points for BSc Human Biology?",
                "Cutoff score for Human Biology Medicine programme?",
                "Required cutoff for BSc Human Biology?",
                "BSc Human Biology Medicine aggregate requirement?",
                "What aggregate do I need for Human Biology Medicine?",
                "What are the minimum cutoff points for BSc Human Biology?",
                "Aggregate requirements for BSc Human Biology?",
                "Cutoff marks for Human Biology Medicine?",
                "What were the previous year's cutoff points for BSc Human Biology Medicine?",
                "BSc Human Biology Medicine minimum aggregate?",
                "Cutoff points for Medicine programme?",
                "What is the score needed for BSc Human Biology?",
                "BSc Human Biology Medicine admission score?",
                "Required aggregate for BSc Human Biology?",
                "What are the cutoff marks for BSc Human Biology Medicine this year?",
                "Minimum aggregate required for BSc Human Biology Medicine?",
                "Cutoff scores for Human Biology Medicine?",
                "What aggregate is needed for Human Biology programme?",
                "BSc Human Biology cutoff points?",
                "What are the aggregate requirements for BSc Human Biology?",
                "Cutoff points for Human Biology Medicine programme?",
                "BSc Human Biology Medicine required aggregate?",
                "What score do I need for BSc Human Biology Medicine?",
                "Cutoff requirements for BSc Human Biology Medicine?",
                "What were the cut-off marks for Human Biology Medicine?",
                "BSc Human Biology Medicine score needed for admission?",
                "Cutoff points for admission into BSc Human Biology Medicine?",
                "What are the cutoff requirements for Human Biology Medicine?"
            ],
            "responses": [
                "The cutoff points for BSc. Human Biology (Medicine) are typically around aggregate 06. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Human Biology Medicine fees",
            "patterns": [
                "what is the fees for Human Biology Medicine",
                "Can I know the amount I will pay for Human Biology Medicine",
                "Can i pay the fees in installment for Human Biology Medicine?",
                "When should i pay the fees for Human Biology Medicine?",
                "Can i book for a hall before paying fees for Human Biology Medicine",
                "How much are the fees for BSc. Human Biology Medicine?",
                "What are the tuition fees for BSc. Human Biology Medicine?",
                "How much do I need to pay for BSc. Human Biology Medicine?",
                "What is the cost of the BSc. Human Biology Medicine programme?",
                "Can you provide the fee details for BSc. Human Biology Medicine?",
                "What is the tuition cost for BSc. Human Biology Medicine?",
                "How much is the fee for studying Human Biology Medicine?",
                "What is the payment schedule for BSc. Human Biology Medicine fees?",
                "Do I have to pay the full fee for BSc. Human Biology Medicine upfront?",
                "What is the fee structure for BSc. Human Biology Medicine?",
                "Can I pay my BSc. Human Biology Medicine fees in installments?",
                "What are the fee payment options for BSc. Human Biology Medicine?",
                "How are the fees for BSc. Human Biology Medicine calculated?",
                "Are there any additional costs for BSc. Human Biology Medicine?",
                "What is the total cost of BSc. Human Biology Medicine for a year?",
                "Are there any extra fees for BSc. Human Biology Medicine?",
                "Can I get a breakdown of the BSc. Human Biology Medicine fees?",
                "What is the annual fee for BSc. Human Biology Medicine?",
                "How much does each semester cost for BSc. Human Biology Medicine?",
                "What are the miscellaneous fees for BSc. Human Biology Medicine?",
                "Are there any lab fees for BSc. Human Biology Medicine?",
                "What are the accommodation fees for BSc. Human Biology Medicine?",
                "How much are the hostel fees for BSc. Human Biology Medicine students?",
                "What is the fee for international students in BSc. Human Biology Medicine?",
                "Do international students pay higher fees for BSc. Human Biology Medicine?",
                "What is the fee for fee-paying students in BSc. Human Biology Medicine?",
                "Are there fee waivers for BSc. Human Biology Medicine?",
                "Are scholarships available to cover BSc. Human Biology Medicine fees?",
                "What are the financial aid options for BSc. Human Biology Medicine?",
                "How much should I budget for BSc. Human Biology Medicine fees?",
                "Is there a fee refund policy for BSc. Human Biology Medicine?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Human Biology Medicine?",
                "What is the refund policy for BSc. Human Biology Medicine fees?",
                "What is the deadline for paying BSc. Human Biology Medicine fees?",
                "Can I get a fee extension for BSc. Human Biology Medicine?",
                "What is the penalty for late payment of BSc. Human Biology Medicine fees?",
                "Can I pay BSc. Human Biology Medicine fees in multiple payments?",
                "Are there any hidden costs for BSc. Human Biology Medicine?",
                "What are the compulsory fees for BSc. Human Biology Medicine?",
                "Can I pay BSc. Human Biology Medicine fees with a payment plan?",
                "How often do I need to pay fees for BSc. Human Biology Medicine?",
                "What are the semester fees for BSc. Human Biology Medicine?",
                "Is there an application fee for BSc. Human Biology Medicine?",
                "What is the registration fee for BSc. Human Biology Medicine?",
                "Are the fees for BSc. Human Biology Medicine fixed or variable?",
                "What is the cost per credit hour for BSc. Human Biology Medicine?",
                "Are there any discounts available for BSc. Human Biology Medicine fees?",
                "Can I get a fee breakdown for BSc. Human Biology Medicine?",
                "What are the non-tuition fees for BSc. Human Biology Medicine?",
                "Are there any additional charges for BSc. Human Biology Medicine?",
                "How much is the acceptance fee for BSc. Human Biology Medicine?",
                "Can I book a hall without paying the BSc. Human Biology Medicine fees?",
                "What are the hostel booking requirements for BSc. Human Biology Medicine?",
                "When are the BSc. Human Biology Medicine fees due?",
                "What is the initial deposit for BSc. Human Biology Medicine fees?",
                "How do I pay my BSc. Human Biology Medicine fees online?",
                "Are there any late fees for BSc. Human Biology Medicine?",
                "What is the mode of payment for BSc. Human Biology Medicine fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Human Biology Medicine?",
                "How do I access my fee statement for BSc. Human Biology Medicine?",
                "What is the last date to pay fees for BSc. Human Biology Medicine?",
                "Is there an online payment option for BSc. Human Biology Medicine fees?",
                "What is the procedure for paying BSc. Human Biology Medicine fees?",
                "What is the tuition fee for the first year of BSc. Human Biology Medicine?",
                "Are there any financial aid options for BSc. Human Biology Medicine?",
                "What is included in the BSc. Human Biology Medicine fee?",
                "Can I get a fee waiver for BSc. Human Biology Medicine?"
            ],
            "responses": [
                "The fees for BSc. Human Biology Medicine programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bachelor_dental_surgery_requirements",
            "patterns": [
                "What are the requirements for Bachelor of Dental Surgery?",
                "Can you provide the admission criteria for Bachelor of Dental Surgery?",
                "Requirements for Bachelor of Dental Surgery programme?",
                "What are the prerequisites for Bachelor of Dental Surgery?",
                "Bachelor of Dental Surgery admission requirements?",
                "Information on eligibility for Bachelor of Dental Surgery?",
                "What are the entry requirements for Bachelor of Dental Surgery programme?",
                "Criteria for admission into Bachelor of Dental Surgery?",
                "Bachelor of Dental Surgery programme prerequisites?",
                "What are the entry requirements for the Bachelor of Dental Surgery?",
                "Requirements for admission into the Bachelor of Dental Surgery programme?",
                "Can you list the prerequisites for Bachelor of Dental Surgery?",
                "Admission criteria for Bachelor of Dental Surgery?",
                "What qualifications do I need for Bachelor of Dental Surgery?",
                "Bachelor of Dental Surgery eligibility criteria?",
                "Core subjects required for Bachelor of Dental Surgery?",
                "Elective subjects for Bachelor of Dental Surgery?",
                "What do I need to apply for Bachelor of Dental Surgery?",
                "Bachelor of Dental Surgery programme requirements?",
                "What subjects are needed for Bachelor of Dental Surgery?",
                "Are there any specific entry requirements for Bachelor of Dental Surgery?",
                "Admission requirements for Bachelor of Dental Surgery course?",
                "What are the academic requirements for Bachelor of Dental Surgery?",
                "Prerequisites for enrolling in Bachelor of Dental Surgery?",
                "What is needed to qualify for Bachelor of Dental Surgery?",
                "Bachelor of Dental Surgery academic prerequisites?",
                "Eligibility for Bachelor of Dental Surgery programme?",
                "What are the subject requirements for Bachelor of Dental Surgery?",
                "What qualifications are required for Bachelor of Dental Surgery?",
                "How do I meet the requirements for Bachelor of Dental Surgery?",
                "What are the core and elective requirements for Bachelor of Dental Surgery?",
                "Criteria for Bachelor of Dental Surgery admission?",
                "What do I need for admission to Bachelor of Dental Surgery?",
                "Requirements for the BDS programme?",
                "What qualifications are necessary for Bachelor of Dental Surgery?",
                "Core and elective subjects for Bachelor of Dental Surgery admission?",
                "How can I meet the requirements for Bachelor of Dental Surgery?",
                "Bachelor of Dental Surgery course prerequisites?",
                "What subjects are required for the Bachelor of Dental Surgery programme?",
                "What are the admission prerequisites for Bachelor of Dental Surgery?",
                "Requirements for Bachelor of Dental Surgery application?",
                "What academic criteria are needed for Bachelor of Dental Surgery?",
                "What are the requirements for BDS admission?",
                "Admission requirements for Bachelor of Dental Surgery degree?",
                "What subjects should I have for Bachelor of Dental Surgery?",
                "Entry criteria for Bachelor of Dental Surgery?",
                "What do I need to know for Bachelor of Dental Surgery admission?",
                "Requirements for Bachelor of Dental Surgery (BDS) programme?",
                "What are the necessary qualifications for Bachelor of Dental Surgery?",
                "What are the prerequisites for Bachelor of Dental Surgery course?",
                "What is the entry criteria for Bachelor of Dental Surgery programme?",
                "What qualifications do I need for Bachelor of Dental Surgery (BDS)?",
                "Bachelor of Dental Surgery programme entry requirements?",
                "What academic requirements are there for Bachelor of Dental Surgery?",
                "Prerequisites for Bachelor of Dental Surgery (BDS) programme?",
                "What subjects are necessary for Bachelor of Dental Surgery admission?",
                "Bachelor of Dental Surgery application criteria?"
            ],
            "responses": [
                "Here are the requirements for Bachelor of Dental Surgery (BDS) <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><ul><li>Programmes may be followed with a 3-year clinical programme for the BDS degree  </li><li>Short-listed Applicants must pass an interview.    </li></ul><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "dental surgery Cutoff Points",
            "patterns": [
                "cutoff points for dental surgery",
                "dental surgery cutoff points",
                "minimum score for dental surgery",
                "required score for dental surgery",
                "aggregate for dental surgery",
                "what is the cutoff for dental surgery",
                "cutoff marks for dental surgery",
                "BDS Only required marks",
                "what aggregate do I need for dental surgery",
                "score needed for dental surgery",
                "cutoff points for Bachelor of Dental Surgery",
                "aggregate requirements for Bachelor of Dental Surgery",
                "what were the cut-off aggregates for Bachelor of Dental Surgery",
                "what are the cut-off aggregates Bachelor of Dental Surgery",
                "What are the cutoff points for dental surgery?",
                "What is the minimum score required for dental surgery?",
                "How much is the cutoff for dental surgery?",
                "Required aggregate for dental surgery?",
                "Dental surgery score requirements?",
                "What are the cutoff marks for dental surgery?",
                "Aggregate needed for Bachelor of Dental Surgery?",
                "Cutoff points for BDS admission?",
                "Minimum aggregate for Bachelor of Dental Surgery?",
                "Required aggregate for Bachelor of Dental Surgery?",
                "What are the required marks for dental surgery?",
                "What is the score needed for Bachelor of Dental Surgery?",
                "Cutoff points for BDS programme?",
                "What were the cutoff points for dental surgery last year?",
                "What is the aggregate requirement for Bachelor of Dental Surgery?",
                "How high are the cutoff points for dental surgery?",
                "Cutoff marks for Bachelor of Dental Surgery?",
                "Score requirements for dental surgery programme?",
                "Aggregate needed for dental surgery course?",
                "What is the cutoff for Bachelor of Dental Surgery?",
                "Required score for Bachelor of Dental Surgery admission?",
                "What were the cut-off marks for dental surgery?",
                "Cutoff points for BDS only programme?",
                "What are the cut-off marks for dental surgery?",
                "Minimum aggregate needed for dental surgery?",
                "What is the required score for dental surgery?",
                "What cutoff is needed for Bachelor of Dental Surgery?",
                "Cutoff for dental surgery programme?",
                "What are the aggregate requirements for dental surgery?",
                "Score needed for admission to Bachelor of Dental Surgery?",
                "What were the aggregate cutoffs for dental surgery?",
                "What is the cutoff score for dental surgery?",
                "Aggregate points for Bachelor of Dental Surgery?",
                "What are the cutoff requirements for dental surgery?",
                "Required marks for dental surgery programme?",
                "What is the minimum aggregate for Bachelor of Dental Surgery?",
                "Dental surgery programme cutoff points?",
                "What are the cut-off scores for dental surgery?",
                "Minimum score needed for BDS?",
                "What were the cut-off points for Bachelor of Dental Surgery?",
                "Aggregate requirements for BDS admission?",
                "Cutoff points for Bachelor of Dental Surgery only?",
                "What aggregate do I need for dental surgery?",
                "Score required for Bachelor of Dental Surgery admission?",
                "What is the aggregate requirement for dental surgery?",
                "Cutoff points for dental surgery course?",
                "What were the cutoff marks for Bachelor of Dental Surgery?",
                "How high is the cutoff for dental surgery programme?",
                "Required aggregate for BDS programme?",
                "What are the aggregate requirements for Bachelor of Dental Surgery?"
            ],
            "responses": [
                "The cutoff points for Bachelor of Dental Surgery (BDS) (Fee-Paying Only) are typically around aggregate 06. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": " Bachelor of Dental Surgery fees",
            "patterns": [
                "what is the fees for Bachelor of Dental Surgery",
                "Can I know the amount I will pay for Bachelor of Dental Surgery",
                "Can i pay the fees in installment for Bachelor of Dental Surgery?",
                "When should i pay the fees for Bachelor of Dental Surgery?",
                "Can i book for a hall before paying fees for Bachelor of Dental Surgery",
                "How much are the fees for . Bachelor of Dental Surgery?",
                "What are the tuition fees for . Bachelor of Dental Surgery?",
                "How much do I need to pay for . Bachelor of Dental Surgery?",
                "What is the cost of the . Bachelor of Dental Surgery programme?",
                "Can you provide the fee details for . Bachelor of Dental Surgery?",
                "What is the tuition cost for . Bachelor of Dental Surgery?",
                "How much is the fee for studying Bachelor of Dental Surgery?",
                "What is the payment schedule for . Bachelor of Dental Surgery fees?",
                "Do I have to pay the full fee for . Bachelor of Dental Surgery upfront?",
                "What is the fee structure for . Bachelor of Dental Surgery?",
                "Can I pay my . Bachelor of Dental Surgery fees in installments?",
                "What are the fee payment options for . Bachelor of Dental Surgery?",
                "How are the fees for . Bachelor of Dental Surgery calculated?",
                "Are there any additional costs for . Bachelor of Dental Surgery?",
                "What is the total cost of . Bachelor of Dental Surgery for a year?",
                "Are there any extra fees for . Bachelor of Dental Surgery?",
                "Can I get a breakdown of the . Bachelor of Dental Surgery fees?",
                "What is the annual fee for . Bachelor of Dental Surgery?",
                "How much does each semester cost for . Bachelor of Dental Surgery?",
                "What are the miscellaneous fees for . Bachelor of Dental Surgery?",
                "Are there any lab fees for . Bachelor of Dental Surgery?",
                "What are the accommodation fees for . Bachelor of Dental Surgery?",
                "How much are the hostel fees for . Bachelor of Dental Surgery students?",
                "What is the fee for international students in . Bachelor of Dental Surgery?",
                "Do international students pay higher fees for . Bachelor of Dental Surgery?",
                "What is the fee for fee-paying students in . Bachelor of Dental Surgery?",
                "Are there fee waivers for . Bachelor of Dental Surgery?",
                "Are scholarships available to cover . Bachelor of Dental Surgery fees?",
                "What are the financial aid options for . Bachelor of Dental Surgery?",
                "How much should I budget for . Bachelor of Dental Surgery fees?",
                "Is there a fee refund policy for . Bachelor of Dental Surgery?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for . Bachelor of Dental Surgery?",
                "What is the refund policy for . Bachelor of Dental Surgery fees?",
                "What is the deadline for paying . Bachelor of Dental Surgery fees?",
                "Can I get a fee extension for . Bachelor of Dental Surgery?",
                "What is the penalty for late payment of . Bachelor of Dental Surgery fees?",
                "Can I pay . Bachelor of Dental Surgery fees in multiple payments?",
                "Are there any hidden costs for . Bachelor of Dental Surgery?",
                "What are the compulsory fees for . Bachelor of Dental Surgery?",
                "Can I pay . Bachelor of Dental Surgery fees with a payment plan?",
                "How often do I need to pay fees for . Bachelor of Dental Surgery?",
                "What are the semester fees for . Bachelor of Dental Surgery?",
                "Is there an application fee for . Bachelor of Dental Surgery?",
                "What is the registration fee for . Bachelor of Dental Surgery?",
                "Are the fees for . Bachelor of Dental Surgery fixed or variable?",
                "What is the cost per credit hour for . Bachelor of Dental Surgery?",
                "Are there any discounts available for . Bachelor of Dental Surgery fees?",
                "Can I get a fee breakdown for . Bachelor of Dental Surgery?",
                "What are the non-tuition fees for . Bachelor of Dental Surgery?",
                "Are there any additional charges for . Bachelor of Dental Surgery?",
                "How much is the acceptance fee for . Bachelor of Dental Surgery?",
                "Can I book a hall without paying the . Bachelor of Dental Surgery fees?",
                "What are the hostel booking requirements for . Bachelor of Dental Surgery?",
                "When are the . Bachelor of Dental Surgery fees due?",
                "What is the initial deposit for . Bachelor of Dental Surgery fees?",
                "How do I pay my . Bachelor of Dental Surgery fees online?",
                "Are there any late fees for . Bachelor of Dental Surgery?",
                "What is the mode of payment for . Bachelor of Dental Surgery fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for . Bachelor of Dental Surgery?",
                "How do I access my fee statement for . Bachelor of Dental Surgery?",
                "What is the last date to pay fees for . Bachelor of Dental Surgery?",
                "Is there an online payment option for . Bachelor of Dental Surgery fees?",
                "What is the procedure for paying . Bachelor of Dental Surgery fees?",
                "What is the tuition fee for the first year of . Bachelor of Dental Surgery?",
                "Are there any financial aid options for . Bachelor of Dental Surgery?",
                "What is included in the . Bachelor of Dental Surgery fee?",
                "Can I get a fee waiver for . Bachelor of Dental Surgery?"
            ],
            "responses": [
                "The fees for . Bachelor of Dental Surgery programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "doctor_veterinary_medicine_requirements",
            "patterns": [
                "What are the requirements for Doctor of Veterinary Medicine?",
                "Can you provide the admission criteria for Doctor of Veterinary Medicine?",
                "Requirements for Doctor of Veterinary Medicine (DVM) programme?",
                "What are the prerequisites for Doctor of Veterinary Medicine (DVM)?",
                "Doctor of Veterinary Medicine admission requirements?",
                "Information on eligibility for Doctor of Veterinary Medicine?",
                "What are the entry requirements for Doctor of Veterinary Medicine programme?",
                "Criteria for admission into Doctor of Veterinary Medicine?",
                "Doctor of Veterinary Medicine programme prerequisites?"
            ],
            "responses": [
                "Here are the requirements for Doctor of Veterinary Medicine (DVM.) <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><ul><li>Animal Husbandry is acceptable in place of Biology. </li></ul><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i><br><br><li><b><u>OTHER APPLICANTS (DIPLOMA HOLDERS) </u></b></li><ul><li>A Diploma from Pong-Tamale Veterinary School or any other recognized Veterinary Training Institutions</li><li>Three (3) years relevant Post qualification working experience.  </li><li>All diploma holding applicants must also satisfy the minimum University entry requirement for Admission. </li><li>Applicants with BSc. Agriculture (Animal Science Option) or BSc. Biological Sciences not below 2nd Class lower division are eligible to apply for Admission. Such applicants will be admitted directly into 2nd year of the Programme.   </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "doctor veterinary medicine Cutoff Points",
            "patterns": [
                "cutoff points for veterinary medicine",
                "doctor veterinary medicine cutoff points",
                "minimum score for veterinary medicine",
                "required score for doctor veterinary medicine",
                "aggregate for veterinary medicine",
                "what is the cutoff for veterinary medicine",
                "cutoff marks for doctor veterinary medicine",
                "doctor veterinary medicine required marks",
                "what aggregate do I need for doctor veterinary medicine",
                "score needed for veterinary medicine",
                "cutoff points for Doctor of Veterinary Medicine",
                "aggregate requirements for Doctor of Veterinary Medicine",
                "what were the cut-off aggregates for Doctor of Veterinary Medicine",
                "what are the cut-off aggregates Doctor of Veterinary Medicine",
                "What are the admission requirements for Doctor of Veterinary Medicine?",
                "What do I need to apply for Doctor of Veterinary Medicine?",
                "Doctor of Veterinary Medicine DVM programme admission criteria?",
                "Requirements for DVM programme?",
                "What are the entry requirements for Doctor of Veterinary Medicine?",
                "Eligibility criteria for Doctor of Veterinary Medicine programme?",
                "Doctor of Veterinary Medicine prerequisites?",
                "What are the core subjects needed for Doctor of Veterinary Medicine?",
                "What electives are required for DVM programme?",
                "Admission criteria for Doctor of Veterinary Medicine?",
                "What are the academic requirements for Doctor of Veterinary Medicine?",
                "Prerequisites for Doctor of Veterinary Medicine?",
                "What subjects are required for DVM programme?",
                "Can you provide details on Doctor of Veterinary Medicine admission?",
                "What are the qualification requirements for Doctor of Veterinary Medicine?",
                "What are the minimum qualifications for DVM programme?",
                "Doctor of Veterinary Medicine programme requirements?",
                "Criteria for Doctor of Veterinary Medicine admission?",
                "Requirements for applying to Doctor of Veterinary Medicine?",
                "What are the prerequisites for admission into Doctor of Veterinary Medicine?",
                "Eligibility for Doctor of Veterinary Medicine course?",
                "What qualifications are needed for Doctor of Veterinary Medicine?",
                "What are the entry criteria for Doctor of Veterinary Medicine programme?",
                "DVM programme requirements?",
                "What are the academic criteria for Doctor of Veterinary Medicine?",
                "Requirements for Doctor of Veterinary Medicine degree?",
                "Doctor of Veterinary Medicine programme prerequisites?",
                "What is needed for admission to Doctor of Veterinary Medicine?",
                "What are the requirements for pursuing Doctor of Veterinary Medicine?",
                "Doctor of Veterinary Medicine admission prerequisites?",
                "Can you provide admission details for Doctor of Veterinary Medicine?",
                "Doctor of Veterinary Medicine entry requirements?",
                "What subjects do I need for Doctor of Veterinary Medicine?",
                "Doctor of Veterinary Medicine eligibility criteria?",
                "What are the requirements for DVM programme?",
                "What is the admission requirement for Doctor of Veterinary Medicine?",
                "Doctor of Veterinary Medicine requirements and prerequisites?",
                "What are the subject requirements for Doctor of Veterinary Medicine?",
                "Requirements for admission into Doctor of Veterinary Medicine programme?",
                "What qualifications are required for Doctor of Veterinary Medicine?",
                "DVM programme admission requirements?",
                "What are the entry prerequisites for Doctor of Veterinary Medicine?",
                "What are the core and elective requirements for Doctor of Veterinary Medicine?",
                "Admission criteria for Doctor of Veterinary Medicine (DVM)?",
                "Requirements for Doctor of Veterinary Medicine programme?",
                "What do I need to qualify for Doctor of Veterinary Medicine?",
                "Doctor of Veterinary Medicine course requirements?",
                "Prerequisites for DVM admission?",
                "What are the core and elective subjects for Doctor of Veterinary Medicine?",
                "Eligibility requirements for Doctor of Veterinary Medicine programme?",
                "What are the qualifications for Doctor of Veterinary Medicine?"
            ],
            "responses": [
                "The cutoff points for Doctor of Veterinary Medicine (DVM) are typically around aggregate 13. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": " Doctor of Veterinary Medicine fees",
            "patterns": [
                "what is the fees for Doctor of Veterinary Medicine",
                "Can I know the amount I will pay for Doctor of Veterinary Medicine",
                "Can i pay the fees in installment for Doctor of Veterinary Medicine?",
                "When should i pay the fees for Doctor of Veterinary Medicine?",
                "Can i book for a hall before paying fees for Doctor of Veterinary Medicine",
                "How much are the fees for . Doctor of Veterinary Medicine?",
                "What are the tuition fees for . Doctor of Veterinary Medicine?",
                "How much do I need to pay for . Doctor of Veterinary Medicine?",
                "What is the cost of the . Doctor of Veterinary Medicine programme?",
                "Can you provide the fee details for . Doctor of Veterinary Medicine?",
                "What is the tuition cost for . Doctor of Veterinary Medicine?",
                "How much is the fee for studying Doctor of Veterinary Medicine?",
                "What is the payment schedule for . Doctor of Veterinary Medicine fees?",
                "Do I have to pay the full fee for . Doctor of Veterinary Medicine upfront?",
                "What is the fee structure for . Doctor of Veterinary Medicine?",
                "Can I pay my . Doctor of Veterinary Medicine fees in installments?",
                "What are the fee payment options for . Doctor of Veterinary Medicine?",
                "How are the fees for . Doctor of Veterinary Medicine calculated?",
                "Are there any additional costs for . Doctor of Veterinary Medicine?",
                "What is the total cost of . Doctor of Veterinary Medicine for a year?",
                "Are there any extra fees for . Doctor of Veterinary Medicine?",
                "Can I get a breakdown of the . Doctor of Veterinary Medicine fees?",
                "What is the annual fee for . Doctor of Veterinary Medicine?",
                "How much does each semester cost for . Doctor of Veterinary Medicine?",
                "What are the miscellaneous fees for . Doctor of Veterinary Medicine?",
                "Are there any lab fees for . Doctor of Veterinary Medicine?",
                "What are the accommodation fees for . Doctor of Veterinary Medicine?",
                "How much are the hostel fees for . Doctor of Veterinary Medicine students?",
                "What is the fee for international students in . Doctor of Veterinary Medicine?",
                "Do international students pay higher fees for . Doctor of Veterinary Medicine?",
                "What is the fee for fee-paying students in . Doctor of Veterinary Medicine?",
                "Are there fee waivers for . Doctor of Veterinary Medicine?",
                "Are scholarships available to cover . Doctor of Veterinary Medicine fees?",
                "What are the financial aid options for . Doctor of Veterinary Medicine?",
                "How much should I budget for . Doctor of Veterinary Medicine fees?",
                "Is there a fee refund policy for . Doctor of Veterinary Medicine?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for . Doctor of Veterinary Medicine?",
                "What is the refund policy for . Doctor of Veterinary Medicine fees?",
                "What is the deadline for paying . Doctor of Veterinary Medicine fees?",
                "Can I get a fee extension for . Doctor of Veterinary Medicine?",
                "What is the penalty for late payment of . Doctor of Veterinary Medicine fees?",
                "Can I pay . Doctor of Veterinary Medicine fees in multiple payments?",
                "Are there any hidden costs for . Doctor of Veterinary Medicine?",
                "What are the compulsory fees for . Doctor of Veterinary Medicine?",
                "Can I pay . Doctor of Veterinary Medicine fees with a payment plan?",
                "How often do I need to pay fees for . Doctor of Veterinary Medicine?",
                "What are the semester fees for . Doctor of Veterinary Medicine?",
                "Is there an application fee for . Doctor of Veterinary Medicine?",
                "What is the registration fee for . Doctor of Veterinary Medicine?",
                "Are the fees for . Doctor of Veterinary Medicine fixed or variable?",
                "What is the cost per credit hour for . Doctor of Veterinary Medicine?",
                "Are there any discounts available for . Doctor of Veterinary Medicine fees?",
                "Can I get a fee breakdown for . Doctor of Veterinary Medicine?",
                "What are the non-tuition fees for . Doctor of Veterinary Medicine?",
                "Are there any additional charges for . Doctor of Veterinary Medicine?",
                "How much is the acceptance fee for . Doctor of Veterinary Medicine?",
                "Can I book a hall without paying the . Doctor of Veterinary Medicine fees?",
                "What are the hostel booking requirements for . Doctor of Veterinary Medicine?",
                "When are the . Doctor of Veterinary Medicine fees due?",
                "What is the initial deposit for . Doctor of Veterinary Medicine fees?",
                "How do I pay my . Doctor of Veterinary Medicine fees online?",
                "Are there any late fees for . Doctor of Veterinary Medicine?",
                "What is the mode of payment for . Doctor of Veterinary Medicine fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for . Doctor of Veterinary Medicine?",
                "How do I access my fee statement for . Doctor of Veterinary Medicine?",
                "What is the last date to pay fees for . Doctor of Veterinary Medicine?",
                "Is there an online payment option for . Doctor of Veterinary Medicine fees?",
                "What is the procedure for paying . Doctor of Veterinary Medicine fees?",
                "What is the tuition fee for the first year of . Doctor of Veterinary Medicine?",
                "Are there any financial aid options for . Doctor of Veterinary Medicine?",
                "What is included in the . Doctor of Veterinary Medicine fee?",
                "Can I get a fee waiver for . Doctor of Veterinary Medicine?"
            ],
            "responses": [
                "The fees for . Doctor of Veterinary Medicine programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_medical_lab_sciences_requirements",
            "patterns": [
                "What are the requirements for BSc. Medical Laboratory Sciences?",
                "Can you provide the admission criteria for BSc. Medical Laboratory Sciences?",
                "Requirements for BSc. Medical Laboratory Sciences programme?",
                "What are the prerequisites for BSc. Medical Laboratory Sciences?",
                "BSc. Medical Laboratory Sciences admission requirements?",
                "Information on eligibility for BSc. Medical Laboratory Sciences?",
                "What are the entry requirements for BSc. Medical Laboratory Sciences programme?",
                "Criteria for admission into BSc. Medical Laboratory Sciences?",
                "BSc. Medical Laboratory Sciences programme prerequisites?",
                "What are the admission requirements for BSc Medical Laboratory Sciences?",
                "What do I need to apply for BSc Medical Laboratory Sciences?",
                "Requirements for BSc Medical Laboratory Sciences programme?",
                "What are the entry requirements for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences admission criteria?",
                "Eligibility for BSc Medical Laboratory Sciences programme?",
                "Prerequisites for BSc Medical Laboratory Sciences?",
                "What are the core subjects needed for BSc Medical Laboratory Sciences?",
                "What electives are required for BSc Medical Laboratory Sciences?",
                "What are the qualifications for BSc Medical Laboratory Sciences?",
                "Admission criteria for BSc Medical Laboratory Sciences?",
                "What are the academic requirements for BSc Medical Laboratory Sciences?",
                "Prerequisites for BSc Medical Laboratory Sciences programme?",
                "Can you provide details on BSc Medical Laboratory Sciences admission requirements?",
                "What subjects do I need for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences programme requirements?",
                "What qualifications are needed for BSc Medical Laboratory Sciences?",
                "What are the requirements for applying to BSc Medical Laboratory Sciences?",
                "What are the entry prerequisites for BSc Medical Laboratory Sciences?",
                "Requirements for BSc Medical Laboratory Sciences degree?",
                "What do I need to qualify for BSc Medical Laboratory Sciences?",
                "What are the requirements for pursuing BSc Medical Laboratory Sciences?",
                "Criteria for BSc Medical Laboratory Sciences admission?",
                "What are the core and elective subjects for BSc Medical Laboratory Sciences?",
                "Eligibility requirements for BSc Medical Laboratory Sciences programme?",
                "What are the qualifications required for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences entry requirements?",
                "Requirements for BSc Medical Laboratory Sciences course?",
                "What academic qualifications are needed for BSc Medical Laboratory Sciences?",
                "Prerequisites for admission into BSc Medical Laboratory Sciences?",
                "What is needed to apply for BSc Medical Laboratory Sciences?",
                "What are the subject requirements for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences admission requirements and criteria?",
                "What do I need to meet BSc Medical Laboratory Sciences requirements?",
                "BSc Medical Laboratory Sciences programme admission criteria?",
                "What subjects are required for BSc Medical Laboratory Sciences?",
                "Admission details for BSc Medical Laboratory Sciences?",
                "What are the prerequisites for BSc Medical Laboratory Sciences programme?",
                "Eligibility criteria for BSc Medical Laboratory Sciences?",
                "What are the admission criteria for BSc Medical Laboratory Sciences degree?",
                "Requirements for BSc Medical Laboratory Sciences application?",
                "What are the qualifications for BSc Medical Laboratory Sciences programme?",
                "BSc Medical Laboratory Sciences academic requirements?",
                "What is required for admission into BSc Medical Laboratory Sciences?",
                "What are the entry criteria for BSc Medical Laboratory Sciences?",
                "What do I need for BSc Medical Laboratory Sciences admission?",
                "Requirements and prerequisites for BSc Medical Laboratory Sciences?"
            ],
            "responses": [
                "Here are the requirements for BSc. Medical Laboratory Sciences <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i><br><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, OR 'A' Level). </li><li>Applicants with Diploma/Certificate in Medical Laboratory Technology with at least One (1) year post qualification experience shall be interviewed and successful Applicants placed in the SECOND YEAR. Mature Candidates with University Diploma in Medical Laboratory Technology (Top-Up) would be placed in the THIRD YEAR, whilst Candidates with Ministry of Health Diploma in Medical Laboratory Technology or HND in Science Laboratory Technology will be placed in SECOND YEAR. All Candidates must have TWO (2) YEARS post-qualification experience and must have passed an interview.  </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Medical Laboratory Sciences Cutoff Points",
            "patterns": [
                "cutoff points for BSc Medical Laboratory Sciences",
                "BSc Medical Laboratory Sciences cutoff points",
                "minimum score for BSc Medical Laboratory Sciences",
                "required score for BSc Medical Laboratory Sciences",
                "aggregate for BSc Medical Laboratory Sciences",
                "what is the cutoff for BSc Medical Laboratory Sciences",
                "cutoff marks for BSc Medical Laboratory Sciences",
                "BSc Medical Laboratory Sciences required marks",
                "what aggregate do I need for BSc Medical Laboratory Sciences",
                "score needed for BSc Medical Laboratory Sciences",
                "cutoff points for Medical Laboratory Sciences",
                "aggregate requirements for Medical Laboratory Sciences",
                "what were the cut-off aggregates for Medical Laboratory Sciences",
                "what are the cut-off aggregates Medical Laboratory Sciences",
                "what is the aggregate needed for medical laboratory",
                "What are the cutoff points for BSc Medical Laboratory Sciences?",
                "What is the minimum aggregate for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences required cutoff marks?",
                "Cutoff points for Medical Laboratory Sciences program?",
                "What is the required score for BSc Medical Laboratory Sciences?",
                "Aggregate needed for BSc Medical Laboratory Sciences?",
                "What is the cutoff score for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences aggregate requirements?",
                "What are the minimum marks needed for BSc Medical Laboratory Sciences?",
                "Cutoff aggregate for Medical Laboratory Sciences?",
                "What were the cutoff aggregates for BSc Medical Laboratory Sciences?",
                "What cutoff marks are needed for BSc Medical Laboratory Sciences?",
                "Required cutoff points for BSc Medical Laboratory Sciences?",
                "Minimum score needed for BSc Medical Laboratory Sciences?",
                "What is the aggregate required for Medical Laboratory Sciences?",
                "Cutoff points for entry into BSc Medical Laboratory Sciences?",
                "What aggregate score is required for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences admission cutoff points?",
                "Aggregate requirements for BSc Medical Laboratory Sciences?",
                "What are the cutoff requirements for BSc Medical Laboratory Sciences?",
                "Score needed for admission into BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences minimum cutoff score?",
                "What is the aggregate for Medical Laboratory Sciences course?",
                "Cutoff points for Medical Laboratory Sciences degree?",
                "Required aggregate for BSc Medical Laboratory Sciences program?",
                "Minimum cutoff marks for BSc Medical Laboratory Sciences?",
                "What is the cutoff for Medical Laboratory Sciences degree?",
                "BSc Medical Laboratory Sciences program cutoff marks?",
                "What are the cutoff marks for Medical Laboratory Sciences?",
                "Minimum aggregate for admission to BSc Medical Laboratory Sciences?",
                "Cutoff scores for Medical Laboratory Sciences program?",
                "What is the minimum aggregate needed for BSc Medical Laboratory Sciences?",
                "Required cutoff for Medical Laboratory Sciences?",
                "What cutoff points are required for BSc Medical Laboratory Sciences?",
                "What are the minimum cutoff scores for BSc Medical Laboratory Sciences?",
                "Aggregate needed for Medical Laboratory Sciences admission?",
                "What is the cutoff aggregate for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences entry requirements cutoff?",
                "What were the cutoff scores for BSc Medical Laboratory Sciences?",
                "Minimum cutoff points for Medical Laboratory Sciences admission?",
                "Required score for BSc Medical Laboratory Sciences entry?",
                "What is the cutoff for BSc Medical Laboratory Sciences admissions?",
                "Cutoff points needed for BSc Medical Laboratory Sciences?",
                "What is the minimum cutoff for BSc Medical Laboratory Sciences?",
                "Aggregate cutoff for Medical Laboratory Sciences degree?",
                "What were the cutoff points for BSc Medical Laboratory Sciences?",
                "BSc Medical Laboratory Sciences admission aggregate requirements?",
                "What are the aggregate cutoff points for BSc Medical Laboratory Sciences?"
            ],
            "responses": [
                "The cutoff points for BSc. Medical Laboratory Sciences are typically around aggregate 07. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Medical Laboratory Sciences fees",
            "patterns": [
                "what is the fees for Medical Laboratory Sciences",
                "Can I know the amount I will pay for Medical Laboratory Sciences",
                "Can i pay the fees in installment for Medical Laboratory Sciences?",
                "When should i pay the fees for Medical Laboratory Sciences?",
                "Can i book for a hall before paying fees for Medical Laboratory Sciences",
                "How much are the fees for BSc. Medical Laboratory Sciences?",
                "What are the tuition fees for BSc. Medical Laboratory Sciences?",
                "How much do I need to pay for BSc. Medical Laboratory Sciences?",
                "What is the cost of the BSc. Medical Laboratory Sciences programme?",
                "Can you provide the fee details for BSc. Medical Laboratory Sciences?",
                "What is the tuition cost for BSc. Medical Laboratory Sciences?",
                "How much is the fee for studying Medical Laboratory Sciences?",
                "What is the payment schedule for BSc. Medical Laboratory Sciences fees?",
                "Do I have to pay the full fee for BSc. Medical Laboratory Sciences upfront?",
                "What is the fee structure for BSc. Medical Laboratory Sciences?",
                "Can I pay my BSc. Medical Laboratory Sciences fees in installments?",
                "What are the fee payment options for BSc. Medical Laboratory Sciences?",
                "How are the fees for BSc. Medical Laboratory Sciences calculated?",
                "Are there any additional costs for BSc. Medical Laboratory Sciences?",
                "What is the total cost of BSc. Medical Laboratory Sciences for a year?",
                "Are there any extra fees for BSc. Medical Laboratory Sciences?",
                "Can I get a breakdown of the BSc. Medical Laboratory Sciences fees?",
                "What is the annual fee for BSc. Medical Laboratory Sciences?",
                "How much does each semester cost for BSc. Medical Laboratory Sciences?",
                "What are the miscellaneous fees for BSc. Medical Laboratory Sciences?",
                "Are there any lab fees for BSc. Medical Laboratory Sciences?",
                "What are the accommodation fees for BSc. Medical Laboratory Sciences?",
                "How much are the hostel fees for BSc. Medical Laboratory Sciences students?",
                "What is the fee for international students in BSc. Medical Laboratory Sciences?",
                "Do international students pay higher fees for BSc. Medical Laboratory Sciences?",
                "What is the fee for fee-paying students in BSc. Medical Laboratory Sciences?",
                "Are there fee waivers for BSc. Medical Laboratory Sciences?",
                "Are scholarships available to cover BSc. Medical Laboratory Sciences fees?",
                "What are the financial aid options for BSc. Medical Laboratory Sciences?",
                "How much should I budget for BSc. Medical Laboratory Sciences fees?",
                "Is there a fee refund policy for BSc. Medical Laboratory Sciences?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Medical Laboratory Sciences?",
                "What is the refund policy for BSc. Medical Laboratory Sciences fees?",
                "What is the deadline for paying BSc. Medical Laboratory Sciences fees?",
                "Can I get a fee extension for BSc. Medical Laboratory Sciences?",
                "What is the penalty for late payment of BSc. Medical Laboratory Sciences fees?",
                "Can I pay BSc. Medical Laboratory Sciences fees in multiple payments?",
                "Are there any hidden costs for BSc. Medical Laboratory Sciences?",
                "What are the compulsory fees for BSc. Medical Laboratory Sciences?",
                "Can I pay BSc. Medical Laboratory Sciences fees with a payment plan?",
                "How often do I need to pay fees for BSc. Medical Laboratory Sciences?",
                "What are the semester fees for BSc. Medical Laboratory Sciences?",
                "Is there an application fee for BSc. Medical Laboratory Sciences?",
                "What is the registration fee for BSc. Medical Laboratory Sciences?",
                "Are the fees for BSc. Medical Laboratory Sciences fixed or variable?",
                "What is the cost per credit hour for BSc. Medical Laboratory Sciences?",
                "Are there any discounts available for BSc. Medical Laboratory Sciences fees?",
                "Can I get a fee breakdown for BSc. Medical Laboratory Sciences?",
                "What are the non-tuition fees for BSc. Medical Laboratory Sciences?",
                "Are there any additional charges for BSc. Medical Laboratory Sciences?",
                "How much is the acceptance fee for BSc. Medical Laboratory Sciences?",
                "Can I book a hall without paying the BSc. Medical Laboratory Sciences fees?",
                "What are the hostel booking requirements for BSc. Medical Laboratory Sciences?",
                "When are the BSc. Medical Laboratory Sciences fees due?",
                "What is the initial deposit for BSc. Medical Laboratory Sciences fees?",
                "How do I pay my BSc. Medical Laboratory Sciences fees online?",
                "Are there any late fees for BSc. Medical Laboratory Sciences?",
                "What is the mode of payment for BSc. Medical Laboratory Sciences fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Medical Laboratory Sciences?",
                "How do I access my fee statement for BSc. Medical Laboratory Sciences?",
                "What is the last date to pay fees for BSc. Medical Laboratory Sciences?",
                "Is there an online payment option for BSc. Medical Laboratory Sciences fees?",
                "What is the procedure for paying BSc. Medical Laboratory Sciences fees?",
                "What is the tuition fee for the first year of BSc. Medical Laboratory Sciences?",
                "Are there any financial aid options for BSc. Medical Laboratory Sciences?",
                "What is included in the BSc. Medical Laboratory Sciences fee?",
                "Can I get a fee waiver for BSc. Medical Laboratory Sciences?"
            ],
            "responses": [
                "The fees for BSc. Medical Laboratory Sciences programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_general_nursing_requirements",
            "patterns": [
                "What are the requirements for BSc. General Nursing?",
                "Can you provide the admission criteria for BSc. General Nursing?",
                "Requirements for BSc. General Nursing programme?",
                "What are the prerequisites for BSc. General Nursing?",
                "BSc. General Nursing admission requirements?",
                "Information on eligibility for BSc. General Nursing?",
                "What are the entry requirements for BSc. General Nursing programme?",
                "Criteria for admission into BSc. General Nursing?",
                "BSc. General Nursing programme prerequisites?",
                "What are the admission requirements for BSc General Nursing?",
                "What do I need to qualify for BSc General Nursing?",
                "BSc General Nursing eligibility criteria?",
                "Requirements to apply for BSc General Nursing?",
                "What are the core and elective requirements for BSc General Nursing?",
                "Prerequisites for BSc General Nursing program?",
                "BSc General Nursing entry requirements?",
                "Criteria for BSc General Nursing admission?",
                "What subjects are required for BSc General Nursing?",
                "General Nursing BSc programme requirements?",
                "What are the qualifications needed for BSc General Nursing?",
                "BSc General Nursing program requirements?",
                "What are the application criteria for BSc General Nursing?",
                "BSc General Nursing admission criteria?",
                "Requirements for enrolling in BSc General Nursing?",
                "What qualifications are needed for BSc General Nursing?",
                "BSc General Nursing application requirements?",
                "What are the entry prerequisites for BSc General Nursing?",
                "Eligibility for BSc General Nursing program?",
                "BSc General Nursing core and elective subject requirements?",
                "What qualifications must I have for BSc General Nursing?",
                "BSc General Nursing admission eligibility?",
                "What do I need to apply for BSc General Nursing?",
                "BSc General Nursing program criteria?",
                "Requirements for BSc General Nursing top-up?",
                "What are the criteria for BSc General Nursing top-up?",
                "BSc General Nursing entry qualifications?",
                "What are the prerequisites for BSc General Nursing top-up?",
                "BSc General Nursing diploma requirements?",
                "Criteria for top-up entry into BSc General Nursing?",
                "BSc General Nursing prerequisites for mature applicants?",
                "Requirements for mature applicants to BSc General Nursing?",
                "What is needed for a mature applicant for BSc General Nursing?",
                "BSc General Nursing entry requirements for mature students?",
                "What are the admission requirements for mature students in BSc General Nursing?",
                "What do mature applicants need for BSc General Nursing?",
                "BSc General Nursing requirements for emergency option?",
                "Criteria for emergency option in BSc General Nursing?",
                "What are the entry requirements for the emergency option in BSc General Nursing?",
                "BSc General Nursing requirements for registered nurses?",
                "What are the requirements for registered nurses to enter BSc General Nursing?",
                "BSc General Nursing prerequisites for registered general nurses?",
                "Admission criteria for registered nurses in BSc General Nursing?",
                "BSc General Nursing requirements for Diploma holders?",
                "What qualifications are needed for BSc General Nursing if holding a diploma?",
                "BSc General Nursing requirements for diploma and experience holders?",
                "Requirements for BSc General Nursing with nursing diploma and experience?",
                "What are the requirements for a nursing diploma holder in BSc General Nursing?",
                "BSc General Nursing programme criteria for experienced nurses?",
                "What are the requirements for experienced nurses in BSc General Nursing?",
                "BSc General Nursing prerequisites for applicants with clinical experience?",
                "What do I need to apply for BSc General Nursing with clinical experience?",
                "Requirements for BSc General Nursing with clinical experience?",
                "What are the core subjects for BSc General Nursing?",
                "BSc General Nursing entry prerequisites for clinical experience holders?"
            ],
            "responses": [
                "Here are the requirements for BSc. General Nursing <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i><br><br><li><b><u>MATURE APPLICANTS FOR TOP-UP</u></b></li><ul><li>Applicants must be at least 25 years of age at the time of the application. </li><li>Applicants must satisfy the University's General Requirements for Admission into Degree Programmes.  </li><li>Applicants must be Registered General Nurses with a Diploma in Nursing </li><li>Applicants must have a minimum of Two years working experience in a clinical area. </li><li>Applicants in this category must pass an Interview.    </li></ul><br><li><b><u>OTHER APPLICANTS (Emergency Option)</u></b></li><ul><li>Applicants must satisfy the University's General Requirements for the Admission to Degree Programmes. </li><li>Must be registered general Nurses with a Diploma in Nursing </li><li>Must be at least 25 years of age at the time of the application.  </li><li>Must have a minimum of TWO (2) years working Experience in a clinical area. </li><li>Applicants in this category must pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Nursing Cutoff Points",
            "patterns": [
                "cutoff points for BSc Nursing",
                "BSc Nursing cutoff points",
                "minimum score for BSc Nursing",
                "required score for BSc Nursing",
                "aggregate for BSc Nursing",
                "what is the cutoff for BSc Nursing",
                "cutoff marks for BSc Nursing",
                "BSc Nursing required marks",
                "what aggregate do I need for BSc Nursing",
                "score needed for BSc Nursing",
                "cutoff points for Nursing",
                "aggregate requirements for Nursing",
                "what were the cut-off aggregates for Nursing",
                "what are the cut-off aggregates Nursing",
                "What is the cutoff score for BSc Nursing?",
                "BSc Nursing minimum cutoff points?",
                "Required cutoff marks for BSc Nursing?",
                "BSc Nursing aggregate points required?",
                "What are the cutoff marks for BSc Nursing?",
                "Score needed to get into BSc Nursing?",
                "What is the aggregate needed for BSc Nursing?",
                "BSc Nursing cutoff score for admission?",
                "Minimum aggregate for BSc Nursing programme?",
                "BSc Nursing score requirements?",
                "Aggregate points for BSc Nursing entry?",
                "Cutoff points for admission to BSc Nursing?",
                "BSc Nursing programme cutoff marks?",
                "What cutoff is required for BSc Nursing?",
                "BSc Nursing entry score requirements?",
                "What is the aggregate cutoff for BSc Nursing?",
                "Required cutoff for BSc Nursing programme?",
                "BSc Nursing admission marks requirements?",
                "Aggregate score for BSc Nursing?",
                "Cutoff marks needed for BSc Nursing?",
                "What are the aggregate requirements for BSc Nursing?",
                "BSc Nursing entry cutoff points?",
                "Minimum score required for BSc Nursing?",
                "What were the cutoff points for BSc Nursing last year?",
                "Current cutoff points for BSc Nursing?",
                "BSc Nursing admission aggregate points?",
                "What are the minimum marks for BSc Nursing?",
                "BSc Nursing cutoff points for this year?",
                "What aggregate is needed for BSc Nursing admission?",
                "BSc Nursing score needed for entry?",
                "What is the minimum aggregate for BSc Nursing?",
                "BSc Nursing cutoff points in recent years?",
                "Required aggregate for BSc Nursing programme?",
                "BSc Nursing score requirements for admission?",
                "What are the latest cutoff points for BSc Nursing?",
                "BSc Nursing aggregate points for entry?",
                "Admission marks for BSc Nursing programme?",
                "What cutoff score is needed for BSc Nursing?",
                "Aggregate requirements for BSc Nursing programme?",
                "Current year cutoff points for BSc Nursing?",
                "BSc Nursing entry marks required?",
                "What is the admission aggregate for BSc Nursing?",
                "BSc Nursing programme entry score?",
                "BSc Nursing minimum admission cutoff?",
                "Required points for admission to BSc Nursing?",
                "BSc Nursing score cutoff details?",
                "Latest cutoff marks for BSc Nursing programme?",
                "Aggregate points needed for BSc Nursing admission?",
                "What is the BSc Nursing entry aggregate?",
                "BSc Nursing cutoff for this admission cycle?"
            ],
            "responses": [
                "The cutoff points for BSc. Nursing are typically around aggregate 08. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc General Nursing fees",
            "patterns": [
                "what is the fees for General Nursing",
                "Can I know the amount I will pay for General Nursing",
                "Can i pay the fees in installment for General Nursing?",
                "When should i pay the fees for General Nursing?",
                "Can i book for a hall before paying fees for General Nursing",
                "How much are the fees for BSc. General Nursing?",
                "What are the tuition fees for BSc. General Nursing?",
                "How much do I need to pay for BSc. General Nursing?",
                "What is the cost of the BSc. General Nursing programme?",
                "Can you provide the fee details for BSc. General Nursing?",
                "What is the tuition cost for BSc. General Nursing?",
                "How much is the fee for studying General Nursing?",
                "What is the payment schedule for BSc. General Nursing fees?",
                "Do I have to pay the full fee for BSc. General Nursing upfront?",
                "What is the fee structure for BSc. General Nursing?",
                "Can I pay my BSc. General Nursing fees in installments?",
                "What are the fee payment options for BSc. General Nursing?",
                "How are the fees for BSc. General Nursing calculated?",
                "Are there any additional costs for BSc. General Nursing?",
                "What is the total cost of BSc. General Nursing for a year?",
                "Are there any extra fees for BSc. General Nursing?",
                "Can I get a breakdown of the BSc. General Nursing fees?",
                "What is the annual fee for BSc. General Nursing?",
                "How much does each semester cost for BSc. General Nursing?",
                "What are the miscellaneous fees for BSc. General Nursing?",
                "Are there any lab fees for BSc. General Nursing?",
                "What are the accommodation fees for BSc. General Nursing?",
                "How much are the hostel fees for BSc. General Nursing students?",
                "What is the fee for international students in BSc. General Nursing?",
                "Do international students pay higher fees for BSc. General Nursing?",
                "What is the fee for fee-paying students in BSc. General Nursing?",
                "Are there fee waivers for BSc. General Nursing?",
                "Are scholarships available to cover BSc. General Nursing fees?",
                "What are the financial aid options for BSc. General Nursing?",
                "How much should I budget for BSc. General Nursing fees?",
                "Is there a fee refund policy for BSc. General Nursing?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. General Nursing?",
                "What is the refund policy for BSc. General Nursing fees?",
                "What is the deadline for paying BSc. General Nursing fees?",
                "Can I get a fee extension for BSc. General Nursing?",
                "What is the penalty for late payment of BSc. General Nursing fees?",
                "Can I pay BSc. General Nursing fees in multiple payments?",
                "Are there any hidden costs for BSc. General Nursing?",
                "What are the compulsory fees for BSc. General Nursing?",
                "Can I pay BSc. General Nursing fees with a payment plan?",
                "How often do I need to pay fees for BSc. General Nursing?",
                "What are the semester fees for BSc. General Nursing?",
                "Is there an application fee for BSc. General Nursing?",
                "What is the registration fee for BSc. General Nursing?",
                "Are the fees for BSc. General Nursing fixed or variable?",
                "What is the cost per credit hour for BSc. General Nursing?",
                "Are there any discounts available for BSc. General Nursing fees?",
                "Can I get a fee breakdown for BSc. General Nursing?",
                "What are the non-tuition fees for BSc. General Nursing?",
                "Are there any additional charges for BSc. General Nursing?",
                "How much is the acceptance fee for BSc. General Nursing?",
                "Can I book a hall without paying the BSc. General Nursing fees?",
                "What are the hostel booking requirements for BSc. General Nursing?",
                "When are the BSc. General Nursing fees due?",
                "What is the initial deposit for BSc. General Nursing fees?",
                "How do I pay my BSc. General Nursing fees online?",
                "Are there any late fees for BSc. General Nursing?",
                "What is the mode of payment for BSc. General Nursing fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. General Nursing?",
                "How do I access my fee statement for BSc. General Nursing?",
                "What is the last date to pay fees for BSc. General Nursing?",
                "Is there an online payment option for BSc. General Nursing fees?",
                "What is the procedure for paying BSc. General Nursing fees?",
                "What is the tuition fee for the first year of BSc. General Nursing?",
                "Are there any financial aid options for BSc. General Nursing?",
                "What is included in the BSc. General Nursing fee?",
                "Can I get a fee waiver for BSc. General Nursing?"
            ],
            "responses": [
                "The fees for BSc. General Nursing programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_midwifery_requirements",
            "patterns": [
                "What are the requirements for BSc. Midwifery?",
                "Can you provide the admission criteria for BSc. Midwifery?",
                "Requirements for BSc. Midwifery programme?",
                "What are the prerequisites for BSc. Midwifery?",
                "BSc. Midwifery admission requirements?",
                "Information on eligibility for BSc. Midwifery?",
                "What are the entry requirements for BSc. Midwifery programme?",
                "Criteria for admission into BSc. Midwifery?",
                "BSc. Midwifery programme prerequisites?",
                "What are the entry requirements for BSc Midwifery?",
                "Admission criteria for BSc Midwifery programme?",
                "What do I need to apply for BSc Midwifery?",
                "Prerequisites for BSc Midwifery course?",
                "BSc Midwifery programme requirements?",
                "Eligibility criteria for BSc Midwifery?",
                "BSc Midwifery admission criteria?",
                "Core requirements for BSc Midwifery?",
                "Elective subjects needed for BSc Midwifery?",
                "What subjects are needed for BSc Midwifery?",
                "BSc Midwifery admission requirements?",
                "Minimum qualifications for BSc Midwifery?",
                "Requirements to study BSc Midwifery?",
                "What qualifications do I need for BSc Midwifery?",
                "Admission requirements for BSc Midwifery?",
                "Criteria for BSc Midwifery admission?",
                "What are the requirements to enroll in BSc Midwifery?",
                "BSc Midwifery programme admission requirements?",
                "Eligibility for BSc Midwifery programme?",
                "What are the academic requirements for BSc Midwifery?",
                "BSc Midwifery entry criteria?",
                "What is needed for admission into BSc Midwifery?",
                "Requirements for admission to BSc Midwifery?",
                "What qualifications are needed for BSc Midwifery programme?",
                "BSc Midwifery admission prerequisites?",
                "General requirements for BSc Midwifery?",
                "Academic criteria for BSc Midwifery?",
                "What are the entry qualifications for BSc Midwifery?",
                "BSc Midwifery requirements for mature students?",
                "What do mature applicants need for BSc Midwifery?",
                "Criteria for mature applicants to BSc Midwifery?",
                "BSc Midwifery requirements for top-up programme?",
                "Admission prerequisites for mature students in BSc Midwifery?",
                "BSc Midwifery requirements for sandwich students?",
                "Eligibility for sandwich programme in BSc Midwifery?",
                "What are the requirements for the sandwich BSc Midwifery programme?",
                "BSc Midwifery entry requirements for mature students?",
                "What is needed for mature entry into BSc Midwifery?",
                "Qualifications for BSc Midwifery top-up programme?",
                "Requirements for BSc Midwifery for registered midwives?",
                "BSc Midwifery application requirements?",
                "What is required for BSc Midwifery admission?",
                "BSc Midwifery programme qualifications?",
                "Entry criteria for BSc Midwifery programme?",
                "What qualifications are required for BSc Midwifery?",
                "BSc Midwifery admission requirements for different categories?",
                "Criteria for BSc Midwifery for registered nurses?",
                "Requirements for BSc Midwifery for diploma holders?",
                "What are the criteria for BSc Midwifery top-up programme?",
                "Admission requirements for BSc Midwifery sandwich programme?",
                "BSc Midwifery requirements for different student categories?",
                "What is the admission process for BSc Midwifery?",
                "Requirements for BSc Midwifery for working professionals?",
                "BSc Midwifery programme entry requirements?",
                "What are the academic requirements for admission to BSc Midwifery?",
                "BSc Midwifery admission prerequisites for mature students?",
                "Eligibility requirements for BSc Midwifery programme?",
                "BSc Midwifery admission criteria for experienced nurses?"
            ],
            "responses": [
                "Here are the requirements for BSc. Midwifery <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i><br><br><li><b><u>MATURE APPLICANTS FOR TOP-UP</u></b></li><ul><li>Applicants must be at least 25 years of age at the time of the application. </li><li>Applicants must satisfy the University's General Requirements for Admission into degree programmes. </li><li>Applicants must be a registered Midwives with a Diploma in Midwifery </li><li>Applicants must have a minimum of TWO (2) years' working experience in a clinical area.   </li><li>Applicants in this category must pass an Interview.    </li></ul><br><li><b><u>OTHER APPLICANTS (Sandwich)</u></b></li><ul><li>Applicants must satisfy the University's General Requirements for Admission into Degree Programmes. </li><li>Must be registered Midwives with a Diploma in Midwifery </li><li>Be at least 25 years of age at the time of submitting the application </li><li>Must have a minimum of TWO (2) years working experience in a clinical area</li><li>Applicants in this category must pass an Interview. </li><br><i><b>Note:</b> This Programme is taken during the Holidays. </i></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Midwifery Cutoff Points",
            "patterns": [
                "cutoff points for BSc Midwifery",
                "BSc Midwifery cutoff points",
                "minimum score for BSc Midwifery",
                "required score for BSc Midwifery",
                "aggregate for BSc Midwifery",
                "what is the cutoff for BSc Midwifery",
                "cutoff marks for BSc Midwifery",
                "BSc Midwifery required marks",
                "what aggregate do I need for BSc Midwifery",
                "score needed for BSc Midwifery",
                "cutoff points for Midwifery",
                "aggregate requirements for Midwifery",
                "what were the cut-off aggregates for Midwifery",
                "what are the cut-off aggregates Midwifery",
                "What are the cutoff points for BSc Midwifery?",
                "BSc Midwifery admission cutoff points?",
                "Minimum cutoff for BSc Midwifery programme?",
                "Required cutoff marks for BSc Midwifery?",
                "What is the minimum aggregate for BSc Midwifery?",
                "Aggregate required for BSc Midwifery?",
                "What is the cutoff score for BSc Midwifery?",
                "Cutoff marks for admission into BSc Midwifery?",
                "BSc Midwifery aggregate score needed?",
                "What cutoff points are needed for BSc Midwifery?",
                "Cutoff aggregate for BSc Midwifery?",
                "Minimum aggregate score for BSc Midwifery admission?",
                "What is the aggregate requirement for BSc Midwifery?",
                "Score required for BSc Midwifery?",
                "What were the cutoff marks for BSc Midwifery last year?",
                "Current cutoff points for BSc Midwifery?",
                "What aggregate do I need for BSc Midwifery?",
                "BSc Midwifery cutoff scores?",
                "Aggregate requirements for BSc Midwifery?",
                "Required aggregate for admission into BSc Midwifery?",
                "What were the cut-off scores for BSc Midwifery?",
                "BSc Midwifery admission score requirements?",
                "Cutoff points for Midwifery programme?",
                "Minimum score needed for BSc Midwifery?",
                "What are the cut-off marks for BSc Midwifery?",
                "What cutoff points are set for BSc Midwifery?",
                "BSc Midwifery score requirements?",
                "Aggregate cutoff for BSc Midwifery?",
                "What is the required score for BSc Midwifery?",
                "BSc Midwifery cut-off aggregate?",
                "What is the minimum aggregate score for BSc Midwifery?",
                "Cutoff requirements for BSc Midwifery programme?",
                "What cutoff aggregate is needed for BSc Midwifery?",
                "BSc Midwifery required cutoff marks?",
                "Cutoff points needed for BSc Midwifery admission?",
                "What aggregate score is needed for BSc Midwifery?",
                "What are the BSc Midwifery cutoff requirements?",
                "Current cutoff marks for BSc Midwifery?",
                "BSc Midwifery programme cutoff points?",
                "Required cutoff for BSc Midwifery?",
                "BSc Midwifery aggregate points needed?",
                "What are the admission scores for BSc Midwifery?",
                "Cutoff points for BSc Midwifery course?",
                "BSc Midwifery aggregate requirements?",
                "What cutoff score is needed for BSc Midwifery?",
                "BSc Midwifery admission score?",
                "Required aggregate score for BSc Midwifery?",
                "Cutoff for BSc Midwifery programme?",
                "Minimum aggregate for BSc Midwifery course?",
                "What is the required aggregate for BSc Midwifery?"
            ],
            "responses": [
                "The cutoff points for BSc. Midwifery are typically around aggregate 9. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Midwifery fees",
            "patterns": [
                "what is the fees for Midwifery",
                "Can I know the amount I will pay for Midwifery",
                "Can i pay the fees in installment for Midwifery?",
                "When should i pay the fees for Midwifery?",
                "Can i book for a hall before paying fees for Midwifery",
                "How much are the fees for BSc. Midwifery?",
                "What are the tuition fees for BSc. Midwifery?",
                "How much do I need to pay for BSc. Midwifery?",
                "What is the cost of the BSc. Midwifery programme?",
                "Can you provide the fee details for BSc. Midwifery?",
                "What is the tuition cost for BSc. Midwifery?",
                "How much is the fee for studying Midwifery?",
                "What is the payment schedule for BSc. Midwifery fees?",
                "Do I have to pay the full fee for BSc. Midwifery upfront?",
                "What is the fee structure for BSc. Midwifery?",
                "Can I pay my BSc. Midwifery fees in installments?",
                "What are the fee payment options for BSc. Midwifery?",
                "How are the fees for BSc. Midwifery calculated?",
                "Are there any additional costs for BSc. Midwifery?",
                "What is the total cost of BSc. Midwifery for a year?",
                "Are there any extra fees for BSc. Midwifery?",
                "Can I get a breakdown of the BSc. Midwifery fees?",
                "What is the annual fee for BSc. Midwifery?",
                "How much does each semester cost for BSc. Midwifery?",
                "What are the miscellaneous fees for BSc. Midwifery?",
                "Are there any lab fees for BSc. Midwifery?",
                "What are the accommodation fees for BSc. Midwifery?",
                "How much are the hostel fees for BSc. Midwifery students?",
                "What is the fee for international students in BSc. Midwifery?",
                "Do international students pay higher fees for BSc. Midwifery?",
                "What is the fee for fee-paying students in BSc. Midwifery?",
                "Are there fee waivers for BSc. Midwifery?",
                "Are scholarships available to cover BSc. Midwifery fees?",
                "What are the financial aid options for BSc. Midwifery?",
                "How much should I budget for BSc. Midwifery fees?",
                "Is there a fee refund policy for BSc. Midwifery?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Midwifery?",
                "What is the refund policy for BSc. Midwifery fees?",
                "What is the deadline for paying BSc. Midwifery fees?",
                "Can I get a fee extension for BSc. Midwifery?",
                "What is the penalty for late payment of BSc. Midwifery fees?",
                "Can I pay BSc. Midwifery fees in multiple payments?",
                "Are there any hidden costs for BSc. Midwifery?",
                "What are the compulsory fees for BSc. Midwifery?",
                "Can I pay BSc. Midwifery fees with a payment plan?",
                "How often do I need to pay fees for BSc. Midwifery?",
                "What are the semester fees for BSc. Midwifery?",
                "Is there an application fee for BSc. Midwifery?",
                "What is the registration fee for BSc. Midwifery?",
                "Are the fees for BSc. Midwifery fixed or variable?",
                "What is the cost per credit hour for BSc. Midwifery?",
                "Are there any discounts available for BSc. Midwifery fees?",
                "Can I get a fee breakdown for BSc. Midwifery?",
                "What are the non-tuition fees for BSc. Midwifery?",
                "Are there any additional charges for BSc. Midwifery?",
                "How much is the acceptance fee for BSc. Midwifery?",
                "Can I book a hall without paying the BSc. Midwifery fees?",
                "What are the hostel booking requirements for BSc. Midwifery?",
                "When are the BSc. Midwifery fees due?",
                "What is the initial deposit for BSc. Midwifery fees?",
                "How do I pay my BSc. Midwifery fees online?",
                "Are there any late fees for BSc. Midwifery?",
                "What is the mode of payment for BSc. Midwifery fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Midwifery?",
                "How do I access my fee statement for BSc. Midwifery?",
                "What is the last date to pay fees for BSc. Midwifery?",
                "Is there an online payment option for BSc. Midwifery fees?",
                "What is the procedure for paying BSc. Midwifery fees?",
                "What is the tuition fee for the first year of BSc. Midwifery?",
                "Are there any financial aid options for BSc. Midwifery?",
                "What is included in the BSc. Midwifery fee?",
                "Can I get a fee waiver for BSc. Midwifery?"
            ],
            "responses": [
                "The fees for BSc. Midwifery programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_physiotherapy_sports_science_requirements",
            "patterns": [
                "What are the requirements for BSc. Physiotherapy and Sports Science?",
                "Can you provide the admission criteria for BSc. Physiotherapy and Sports Science?",
                "Requirements for BSc. Physiotherapy and Sports Science programme?",
                "What are the prerequisites for BSc. Physiotherapy and Sports Science?",
                "BSc. Physiotherapy and Sports Science admission requirements?",
                "Information on eligibility for BSc. Physiotherapy and Sports Science?",
                "What are the entry requirements for BSc. Physiotherapy and Sports Science programme?",
                "Criteria for admission into BSc. Physiotherapy and Sports Science?",
                "BSc. Physiotherapy and Sports Science programme prerequisites?",
                "Requirements for BSc Physiotherapy and Sports Science program?",
                "What are the admission requirements for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science prerequisites?",
                "What do I need to apply for BSc Physiotherapy and Sports Science?",
                "Admission criteria for BSc Physiotherapy and Sports Science?",
                "What are the entry requirements for BSc Physiotherapy and Sports Science?",
                "Eligibility for BSc Physiotherapy and Sports Science?",
                "What qualifications are needed for BSc Physiotherapy and Sports Science?",
                "Criteria for BSc Physiotherapy and Sports Science programme?",
                "What are the requirements for admission into BSc Physiotherapy and Sports Science?",
                "What are the core subjects needed for BSc Physiotherapy and Sports Science?",
                "What elective subjects are required for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science application requirements?",
                "What is required for admission into BSc Physiotherapy and Sports Science?",
                "Entry requirements for BSc Physiotherapy and Sports Science programme?",
                "What are the prerequisites for BSc Physiotherapy and Sports Science admission?",
                "What qualifications are needed for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science admission criteria?",
                "What are the necessary requirements for BSc Physiotherapy and Sports Science?",
                "What subjects are required for BSc Physiotherapy and Sports Science?",
                "Requirements for applying to BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science admission eligibility?",
                "What do you need to meet the requirements for BSc Physiotherapy and Sports Science?",
                "What are the general requirements for BSc Physiotherapy and Sports Science?",
                "What are the subject requirements for BSc Physiotherapy and Sports Science?",
                "Criteria for entry into BSc Physiotherapy and Sports Science programme?",
                "What are the specific requirements for BSc Physiotherapy and Sports Science?",
                "Admission requirements for the BSc Physiotherapy and Sports Science course?",
                "What are the general admission requirements for BSc Physiotherapy and Sports Science?",
                "Prerequisites for applying to BSc Physiotherapy and Sports Science?",
                "What are the requirements to join BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science entry criteria?",
                "What qualifications must I have for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science eligibility criteria?",
                "What are the requirements for BSc Physiotherapy and Sports Science applicants?",
                "What is needed for admission into BSc Physiotherapy and Sports Science?",
                "What are the academic requirements for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science program requirements?",
                "What are the conditions for admission to BSc Physiotherapy and Sports Science?",
                "What are the criteria for BSc Physiotherapy and Sports Science admission?",
                "Requirements for enrolling in BSc Physiotherapy and Sports Science?",
                "What qualifications do I need for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science programme admission criteria?",
                "What are the requirements for BSc Physiotherapy and Sports Science course?",
                "What are the necessary qualifications for BSc Physiotherapy and Sports Science?",
                "Admission prerequisites for BSc Physiotherapy and Sports Science?",
                "What are the requirements for getting into BSc Physiotherapy and Sports Science?",
                "What should I know about BSc Physiotherapy and Sports Science admission requirements?",
                "Requirements to be eligible for BSc Physiotherapy and Sports Science?",
                "What do I need for admission into BSc Physiotherapy and Sports Science?",
                "What are the entry qualifications for BSc Physiotherapy and Sports Science?"
            ],
            "responses": [
                "Here are the requirements for BSc. Physiotherapy and Sports Science <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i><br><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be a least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, OR 'A' Level). OR </li><li>Candidates who have relevant Diploma certificates in Sports and Exercise Science, Fitness Assessment, Physiotherapy and Orthotic Assistant, coaching etc. and who must have worked for at least three (3) years will be considered for admission into year two. </li><li>Applicants must be declared medically fit by the University Hospital and must undergo a physical fitness assessment and must pass a written and/or oral interview conducted at the Department. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Physiotherapy and Sports Science Cutoff Points",
            "patterns": [
                "cutoff points for BSc Physiotherapy and Sports Science",
                "BSc Physiotherapy and Sports Science cutoff points",
                "minimum score for BSc Physiotherapy and Sports Science",
                "required score for BSc Physiotherapy and Sports Science",
                "aggregate for BSc Physiotherapy and Sports Science",
                "what is the cutoff for BSc Physiotherapy and Sports Science",
                "cutoff marks for BSc Physiotherapy and Sports Science",
                "BSc Physiotherapy and Sports Science required marks",
                "what aggregate do I need for BSc Physiotherapy and Sports Science",
                "score needed for BSc Physiotherapy and Sports Science",
                "cutoff points for Physiotherapy and Sports Science",
                "aggregate requirements for Physiotherapy and Sports Science",
                "what were the cut-off aggregates for Physiotherapy and Sports Science",
                "what are the cut-off aggregates Physiotherapy and Sports Science",
                "What is the cutoff for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science minimum aggregate?",
                "Cutoff marks for BSc Physiotherapy and Sports Science programme?",
                "What is the required score for BSc Physiotherapy and Sports Science?",
                "What aggregate is needed for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science score requirements?",
                "Minimum cutoff for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science aggregate cutoffs?",
                "What were the cutoff points for BSc Physiotherapy and Sports Science?",
                "Aggregate requirements for BSc Physiotherapy and Sports Science?",
                "What were the cut-off marks for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science cutoff scores?",
                "What aggregate is needed for admission to BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science admission cutoff points?",
                "Required aggregate for BSc Physiotherapy and Sports Science?",
                "Score needed for BSc Physiotherapy and Sports Science admission?",
                "BSc Physiotherapy and Sports Science cutoff aggregate?",
                "What are the cutoff scores for BSc Physiotherapy and Sports Science?",
                "Cutoff points for admission to BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science required aggregate?",
                "Cutoff marks for admission into BSc Physiotherapy and Sports Science?",
                "What is the minimum aggregate for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science entry requirements cutoff?",
                "What are the cut-off points for BSc Physiotherapy and Sports Science programme?",
                "BSc Physiotherapy and Sports Science aggregate requirements?",
                "Minimum score required for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science cutoff marks needed?",
                "What is the cut-off aggregate for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science cutoff marks for admission?",
                "Required cutoff for BSc Physiotherapy and Sports Science programme?",
                "What aggregate do you need for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science entry cutoff points?",
                "What are the cutoff requirements for BSc Physiotherapy and Sports Science?",
                "Cutoff scores for BSc Physiotherapy and Sports Science programme?",
                "BSc Physiotherapy and Sports Science programme cutoff points?",
                "What were the required cutoff points for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science minimum score needed?",
                "Required aggregate marks for BSc Physiotherapy and Sports Science?",
                "What are the cutoff requirements for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science admission cutoff marks?",
                "What were the cutoff scores for BSc Physiotherapy and Sports Science last year?",
                "Minimum cutoff points for BSc Physiotherapy and Sports Science admission?",
                "What is the aggregate score required for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science score requirements for admission?",
                "What cutoff points are needed for BSc Physiotherapy and Sports Science?",
                "BSc Physiotherapy and Sports Science admission aggregate points?",
                "Required marks for BSc Physiotherapy and Sports Science admission?",
                "What are the latest cutoff points for BSc Physiotherapy and Sports Science?"
            ],
            "responses": [
                "The cutoff points for BSc. Physiotherapy and Sports Science are typically around aggregate 12. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Physiotherapy and Sports Science fees",
            "patterns": [
                "what is the fees for Physiotherapy and Sports Science",
                "Can I know the amount I will pay for Physiotherapy and Sports Science",
                "Can i pay the fees in installment for Physiotherapy and Sports Science?",
                "When should i pay the fees for Physiotherapy and Sports Science?",
                "Can i book for a hall before paying fees for Physiotherapy and Sports Science",
                "How much are the fees for BSc. Physiotherapy and Sports Science?",
                "What are the tuition fees for BSc. Physiotherapy and Sports Science?",
                "How much do I need to pay for BSc. Physiotherapy and Sports Science?",
                "What is the cost of the BSc. Physiotherapy and Sports Science programme?",
                "Can you provide the fee details for BSc. Physiotherapy and Sports Science?",
                "What is the tuition cost for BSc. Physiotherapy and Sports Science?",
                "How much is the fee for studying Physiotherapy and Sports Science?",
                "What is the payment schedule for BSc. Physiotherapy and Sports Science fees?",
                "Do I have to pay the full fee for BSc. Physiotherapy and Sports Science upfront?",
                "What is the fee structure for BSc. Physiotherapy and Sports Science?",
                "Can I pay my BSc. Physiotherapy and Sports Science fees in installments?",
                "What are the fee payment options for BSc. Physiotherapy and Sports Science?",
                "How are the fees for BSc. Physiotherapy and Sports Science calculated?",
                "Are there any additional costs for BSc. Physiotherapy and Sports Science?",
                "What is the total cost of BSc. Physiotherapy and Sports Science for a year?",
                "Are there any extra fees for BSc. Physiotherapy and Sports Science?",
                "Can I get a breakdown of the BSc. Physiotherapy and Sports Science fees?",
                "What is the annual fee for BSc. Physiotherapy and Sports Science?",
                "How much does each semester cost for BSc. Physiotherapy and Sports Science?",
                "What are the miscellaneous fees for BSc. Physiotherapy and Sports Science?",
                "Are there any lab fees for BSc. Physiotherapy and Sports Science?",
                "What are the accommodation fees for BSc. Physiotherapy and Sports Science?",
                "How much are the hostel fees for BSc. Physiotherapy and Sports Science students?",
                "What is the fee for international students in BSc. Physiotherapy and Sports Science?",
                "Do international students pay higher fees for BSc. Physiotherapy and Sports Science?",
                "What is the fee for fee-paying students in BSc. Physiotherapy and Sports Science?",
                "Are there fee waivers for BSc. Physiotherapy and Sports Science?",
                "Are scholarships available to cover BSc. Physiotherapy and Sports Science fees?",
                "What are the financial aid options for BSc. Physiotherapy and Sports Science?",
                "How much should I budget for BSc. Physiotherapy and Sports Science fees?",
                "Is there a fee refund policy for BSc. Physiotherapy and Sports Science?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Physiotherapy and Sports Science?",
                "What is the refund policy for BSc. Physiotherapy and Sports Science fees?",
                "What is the deadline for paying BSc. Physiotherapy and Sports Science fees?",
                "Can I get a fee extension for BSc. Physiotherapy and Sports Science?",
                "What is the penalty for late payment of BSc. Physiotherapy and Sports Science fees?",
                "Can I pay BSc. Physiotherapy and Sports Science fees in multiple payments?",
                "Are there any hidden costs for BSc. Physiotherapy and Sports Science?",
                "What are the compulsory fees for BSc. Physiotherapy and Sports Science?",
                "Can I pay BSc. Physiotherapy and Sports Science fees with a payment plan?",
                "How often do I need to pay fees for BSc. Physiotherapy and Sports Science?",
                "What are the semester fees for BSc. Physiotherapy and Sports Science?",
                "Is there an application fee for BSc. Physiotherapy and Sports Science?",
                "What is the registration fee for BSc. Physiotherapy and Sports Science?",
                "Are the fees for BSc. Physiotherapy and Sports Science fixed or variable?",
                "What is the cost per credit hour for BSc. Physiotherapy and Sports Science?",
                "Are there any discounts available for BSc. Physiotherapy and Sports Science fees?",
                "Can I get a fee breakdown for BSc. Physiotherapy and Sports Science?",
                "What are the non-tuition fees for BSc. Physiotherapy and Sports Science?",
                "Are there any additional charges for BSc. Physiotherapy and Sports Science?",
                "How much is the acceptance fee for BSc. Physiotherapy and Sports Science?",
                "Can I book a hall without paying the BSc. Physiotherapy and Sports Science fees?",
                "What are the hostel booking requirements for BSc. Physiotherapy and Sports Science?",
                "When are the BSc. Physiotherapy and Sports Science fees due?",
                "What is the initial deposit for BSc. Physiotherapy and Sports Science fees?",
                "How do I pay my BSc. Physiotherapy and Sports Science fees online?",
                "Are there any late fees for BSc. Physiotherapy and Sports Science?",
                "What is the mode of payment for BSc. Physiotherapy and Sports Science fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Physiotherapy and Sports Science?",
                "How do I access my fee statement for BSc. Physiotherapy and Sports Science?",
                "What is the last date to pay fees for BSc. Physiotherapy and Sports Science?",
                "Is there an online payment option for BSc. Physiotherapy and Sports Science fees?",
                "What is the procedure for paying BSc. Physiotherapy and Sports Science fees?",
                "What is the tuition fee for the first year of BSc. Physiotherapy and Sports Science?",
                "Are there any financial aid options for BSc. Physiotherapy and Sports Science?",
                "What is included in the BSc. Physiotherapy and Sports Science fee?",
                "Can I get a fee waiver for BSc. Physiotherapy and Sports Science?"
            ],
            "responses": [
                "The fees for BSc. Physiotherapy and Sports Science programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "pharm_d_requirements",
            "patterns": [
                "What are the requirements for Doctor of Pharmacy (Pharm D)?",
                "What are the requirements for Pharmacy Pharm D?",
                "Can you provide the admission criteria for Pharm D programme?",
                "Can you provide the admission criteria for Pharmacy?",
                "Requirements for Pharm D programme?",
                "Requirements for Pharmacy programme?",
                "What are the prerequisites for Pharm D?",
                "Pharm D admission requirements?",
                "Pharmacy admission requirements?",
                "Information on eligibility for Pharm D programme?",
                "What are the entry requirements for Pharm D programme?",
                "What are the entry requirements for Pharmacy programme?",
                "Criteria for admission into Pharm D?",
                "Pharm D programme prerequisites?",
                "Pharmacy programme prerequisites?",
                "what does pharm d top up entails",
                "What are the admission requirements for Doctor of Pharmacy (Pharm D)?",
                "Pharm D programme admission criteria?",
                "What are the prerequisites for Pharmacy Pharm D programme?",
                "Admission criteria for Pharm D?",
                "What are the entry requirements for Doctor of Pharmacy?",
                "Requirements for entry into Pharm D programme?",
                "What are the conditions for admission into Pharm D?",
                "Pharm D eligibility criteria?",
                "Pharmacy Pharm D admission requirements?",
                "What do you need to apply for Pharm D?",
                "Pharm D programme requirements for admission?",
                "Requirements for admission into Doctor of Pharmacy programme?",
                "What qualifications are needed for Pharm D?",
                "Pharmacy programme requirements for Pharm D?",
                "Criteria for Pharm D admission?",
                "What are the entry qualifications for Pharm D?",
                "Pharm D top-up programme requirements?",
                "What is needed to apply for Doctor of Pharmacy?",
                "Pharm D admission qualifications?",
                "What are the prerequisites for Pharm D top-up?",
                "Doctor of Pharmacy entry requirements?",
                "Pharmacy Pharm D entry criteria?",
                "Pharm D programme eligibility?",
                "What qualifications do you need for Pharm D programme?",
                "Pharm D admission prerequisites?",
                "Requirements for Pharm D programme application?",
                "Pharm D programme criteria for admission?",
                "What are the prerequisites for Doctor of Pharmacy programme?",
                "Pharmacy Pharm D requirements for admission?",
                "Pharm D programme entry qualifications?",
                "What does Pharm D admission entail?",
                "Pharm D application requirements?",
                "Pharm D top-up admission requirements?",
                "What are the conditions for entry into Pharm D programme?",
                "Pharm D programme qualifications?",
                "Pharm D admission criteria for Pharmacy graduates?",
                "What are the requirements for Pharmacy Doctor programme?",
                "Pharm D programme admission qualifications?",
                "What are the conditions for Pharm D programme?",
                "Pharmacy Doctor of Pharmacy admission requirements?",
                "Pharm D eligibility requirements?",
                "Pharm D top-up programme admission criteria?",
                "What are the general requirements for Pharm D programme?",
                "Pharm D entry requirements for Pharmacy graduates?",
                "What qualifications are necessary for Pharm D top-up?",
                "Pharm D admission requirements for mature students?",
                "Pharm D programme prerequisites for mature applicants?",
                "What does the Pharm D application involve?"
            ],
            "responses": [
                "Here are the requirements for Doctor of Pharmacy (Pharm D) <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i><br><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, OR 'A' Level). </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul><br><li><b><u>OTHER APPLICANTS (TOP-UP)</u></b></li><i><b>Fee-Paying Only</b></i><br><br><ul><li>Applicants must satisfy the University's General Requirements for Admission into Degree Programmes. </li><li>Must have a Degree in Pharmacy with at least THREE (3) years post-registration experience.  </li><li>Must pass an interview.  </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "Pharmacy (Pharm D) Cutoff Points",
            "patterns": [
                "cutoff points for Pharm D",
                "cutoff points for Pharmacy",
                "Pharm D cutoff points",
                "Pharmacy cutoff points",
                "Doctor of Pharmacy cutoff points",
                "minimum score for Pharm D",
                "required score for Pharm D",
                "aggregate for Pharm D",
                "aggregate for Pharmacy",
                "what is the cutoff for Pharm D",
                "what is the cutoff for Pharmacy",
                "cutoff marks for Pharm D",
                "Pharm D required marks",
                "what aggregate do I need for Pharm D",
                "what aggregate do I need for Pharmacy",
                "score needed for Pharm D",
                "cutoff points for Doctor of Pharmacy",
                "aggregate requirements for Doctor of Pharmacy",
                "what were the cut-off aggregates for Doctor of Pharmacy",
                "what are the cut-off aggregates Doctor of Pharmacy",
                "Pharm D admission cutoff points",
                "Pharmacy programme cutoff points",
                "Doctor of Pharmacy aggregate points",
                "minimum cutoff for Pharm D",
                "Pharm D score requirements",
                "Pharmacy admission score",
                "aggregate points for Doctor of Pharmacy",
                "cutoff requirements for Pharm D",
                "Pharmacy score cutoff",
                "Doctor of Pharmacy required aggregate",
                "Pharm D cutoff scores",
                "what is the minimum aggregate for Pharm D",
                "what is the minimum score for Pharmacy",
                "cutoff scores for Doctor of Pharmacy",
                "required cutoff points for Pharm D",
                "aggregate cutoff for Pharmacy programme",
                "Pharm D entry cutoff points",
                "Pharmacy Doctor of Pharmacy aggregate score",
                "Pharm D marks cutoff",
                "Doctor of Pharmacy admission score",
                "Pharm D cutoff requirements",
                "Pharmacy programme aggregate requirements",
                "Pharm D score needed for admission",
                "Pharmacy admission aggregate points",
                "Doctor of Pharmacy cutoff score",
                "minimum points for Pharm D admission",
                "Pharm D aggregate score",
                "what are the cutoff scores for Pharm D",
                "Pharmacy programme score requirements",
                "Pharm D entry score",
                "Doctor of Pharmacy cutoff marks",
                "Pharmacy Pharm D cutoff",
                "Pharm D minimum score for entry",
                "what were the cutoff scores for Pharmacy",
                "Pharm D aggregate requirements",
                "Pharmacy programme cutoff scores",
                "Doctor of Pharmacy minimum score",
                "required aggregate for Pharm D",
                "Pharm D admission aggregate",
                "cutoff points for Pharmacy Doctorate",
                "Pharmacy aggregate cutoff",
                "Pharm D entry requirements score",
                "Pharm D admission aggregate",
                "Pharmacy Doctor of Pharmacy score cutoff",
                "minimum aggregate for Pharmacy Doctorate",
                "cutoff points for Pharm D admission",
                "Pharm D aggregate points for entry",
                "Pharmacy programme entry score"
            ],
            "responses": [
                "The cutoff points for Pharm D (Doctor of Pharmacy) are typically around aggregate 07. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": " Doctor of Pharmacy Pharm D fees",
            "patterns": [
                "what is the fees for Doctor of Pharmacy Pharm D",
                "Can I know the amount I will pay for Doctor of Pharmacy Pharm D",
                "Can i pay the fees in installment for Doctor of Pharmacy Pharm D?",
                "When should i pay the fees for Doctor of Pharmacy Pharm D?",
                "Can i book for a hall before paying fees for Doctor of Pharmacy Pharm D",
                "How much are the fees for . Doctor of Pharmacy Pharm D?",
                "What are the tuition fees for . Doctor of Pharmacy Pharm D?",
                "How much do I need to pay for . Doctor of Pharmacy Pharm D?",
                "What is the cost of the . Doctor of Pharmacy Pharm D programme?",
                "Can you provide the fee details for . Doctor of Pharmacy Pharm D?",
                "What is the tuition cost for . Doctor of Pharmacy Pharm D?",
                "How much is the fee for studying Doctor of Pharmacy Pharm D?",
                "What is the payment schedule for . Doctor of Pharmacy Pharm D fees?",
                "Do I have to pay the full fee for . Doctor of Pharmacy Pharm D upfront?",
                "What is the fee structure for . Doctor of Pharmacy Pharm D?",
                "Can I pay my . Doctor of Pharmacy Pharm D fees in installments?",
                "What are the fee payment options for . Doctor of Pharmacy Pharm D?",
                "How are the fees for . Doctor of Pharmacy Pharm D calculated?",
                "Are there any additional costs for . Doctor of Pharmacy Pharm D?",
                "What is the total cost of . Doctor of Pharmacy Pharm D for a year?",
                "Are there any extra fees for . Doctor of Pharmacy Pharm D?",
                "Can I get a breakdown of the . Doctor of Pharmacy Pharm D fees?",
                "What is the annual fee for . Doctor of Pharmacy Pharm D?",
                "How much does each semester cost for . Doctor of Pharmacy Pharm D?",
                "What are the miscellaneous fees for . Doctor of Pharmacy Pharm D?",
                "Are there any lab fees for . Doctor of Pharmacy Pharm D?",
                "What are the accommodation fees for . Doctor of Pharmacy Pharm D?",
                "How much are the hostel fees for . Doctor of Pharmacy Pharm D students?",
                "What is the fee for international students in . Doctor of Pharmacy Pharm D?",
                "Do international students pay higher fees for . Doctor of Pharmacy Pharm D?",
                "What is the fee for fee-paying students in . Doctor of Pharmacy Pharm D?",
                "Are there fee waivers for . Doctor of Pharmacy Pharm D?",
                "Are scholarships available to cover . Doctor of Pharmacy Pharm D fees?",
                "What are the financial aid options for . Doctor of Pharmacy Pharm D?",
                "How much should I budget for . Doctor of Pharmacy Pharm D fees?",
                "Is there a fee refund policy for . Doctor of Pharmacy Pharm D?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for . Doctor of Pharmacy Pharm D?",
                "What is the refund policy for . Doctor of Pharmacy Pharm D fees?",
                "What is the deadline for paying . Doctor of Pharmacy Pharm D fees?",
                "Can I get a fee extension for . Doctor of Pharmacy Pharm D?",
                "What is the penalty for late payment of . Doctor of Pharmacy Pharm D fees?",
                "Can I pay . Doctor of Pharmacy Pharm D fees in multiple payments?",
                "Are there any hidden costs for . Doctor of Pharmacy Pharm D?",
                "What are the compulsory fees for . Doctor of Pharmacy Pharm D?",
                "Can I pay . Doctor of Pharmacy Pharm D fees with a payment plan?",
                "How often do I need to pay fees for . Doctor of Pharmacy Pharm D?",
                "What are the semester fees for . Doctor of Pharmacy Pharm D?",
                "Is there an application fee for . Doctor of Pharmacy Pharm D?",
                "What is the registration fee for . Doctor of Pharmacy Pharm D?",
                "Are the fees for . Doctor of Pharmacy Pharm D fixed or variable?",
                "What is the cost per credit hour for . Doctor of Pharmacy Pharm D?",
                "Are there any discounts available for . Doctor of Pharmacy Pharm D fees?",
                "Can I get a fee breakdown for . Doctor of Pharmacy Pharm D?",
                "What are the non-tuition fees for . Doctor of Pharmacy Pharm D?",
                "Are there any additional charges for . Doctor of Pharmacy Pharm D?",
                "How much is the acceptance fee for . Doctor of Pharmacy Pharm D?",
                "Can I book a hall without paying the . Doctor of Pharmacy Pharm D fees?",
                "What are the hostel booking requirements for . Doctor of Pharmacy Pharm D?",
                "When are the . Doctor of Pharmacy Pharm D fees due?",
                "What is the initial deposit for . Doctor of Pharmacy Pharm D fees?",
                "How do I pay my . Doctor of Pharmacy Pharm D fees online?",
                "Are there any late fees for . Doctor of Pharmacy Pharm D?",
                "What is the mode of payment for . Doctor of Pharmacy Pharm D fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for . Doctor of Pharmacy Pharm D?",
                "How do I access my fee statement for . Doctor of Pharmacy Pharm D?",
                "What is the last date to pay fees for . Doctor of Pharmacy Pharm D?",
                "Is there an online payment option for . Doctor of Pharmacy Pharm D fees?",
                "What is the procedure for paying . Doctor of Pharmacy Pharm D fees?",
                "What is the tuition fee for the first year of . Doctor of Pharmacy Pharm D?",
                "Are there any financial aid options for . Doctor of Pharmacy Pharm D?",
                "What is included in the . Doctor of Pharmacy Pharm D fee?",
                "Can I get a fee waiver for . Doctor of Pharmacy Pharm D?"
            ],
            "responses": [
                "The fees for . Doctor of Pharmacy Pharm D programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "herbal_medicine_requirements",
            "patterns": [
                "What are the requirements for Bachelor of Herbal Medicine (BHM)?",
                "Can you provide the admission criteria for BHM programme?",
                "Requirements for BHM programme?",
                "What are the prerequisites for BHM?",
                "BHM admission requirements?",
                "Information on eligibility for BHM programme?",
                "What are the entry requirements for BHM programme?",
                "Criteria for admission into BHM?",
                "BHM programme prerequisites?",
                "What are the entry requirements for Bachelor of Herbal Medicine?",
                "What do I need to apply for the BHM programme?",
                "Eligibility criteria for Bachelor of Herbal Medicine?",
                "Admission requirements for BHM course?",
                "BHM programme admission criteria?",
                "What are the prerequisites for enrolling in Bachelor of Herbal Medicine?",
                "Requirements for applying to BHM programme?",
                "What qualifications are needed for BHM?",
                "What is required to get into the Bachelor of Herbal Medicine programme?",
                "Criteria for applying to Bachelor of Herbal Medicine?",
                "BHM course prerequisites?",
                "Bachelor of Herbal Medicine admission qualifications?",
                "What are the requirements for BHM programme admission?",
                "Can you list the admission requirements for BHM?",
                "What are the qualifications for BHM?",
                "What does it take to be eligible for Bachelor of Herbal Medicine?",
                "BHM programme entry requirements?",
                "Requirements for admission into Bachelor of Herbal Medicine?",
                "BHM programme admission prerequisites?",
                "What is needed for Bachelor of Herbal Medicine entry?",
                "What do I need to qualify for the BHM programme?",
                "BHM admission eligibility criteria?",
                "What are the academic requirements for BHM?",
                "BHM programme admission requirements?",
                "Eligibility for Bachelor of Herbal Medicine programme?",
                "What are the core requirements for BHM?",
                "How to qualify for Bachelor of Herbal Medicine?",
                "What are the BHM entry criteria?",
                "Admission requirements for Bachelor of Herbal Medicine?",
                "Prerequisites for Bachelor of Herbal Medicine programme?",
                "What are the requirements for entering BHM?",
                "What do applicants need for Bachelor of Herbal Medicine?",
                "What are the entry qualifications for BHM?",
                "BHM admission criteria and prerequisites?",
                "Bachelor of Herbal Medicine requirements for admission?",
                "What does the BHM programme require?",
                "Criteria for Bachelor of Herbal Medicine application?",
                "Requirements to get into BHM programme?",
                "BHM course eligibility criteria?",
                "What qualifications are required for BHM admission?",
                "Admission requirements for Herbal Medicine degree?",
                "What are the core qualifications for BHM?",
                "What are the entry requirements for Herbal Medicine?",
                "BHM programme eligibility requirements?",
                "Requirements to apply for Bachelor of Herbal Medicine?"
            ],
            "responses": [
                "Here are the requirements for Bachelor of Herbal Medicine (BHM) <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i><br><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, OR 'A' Level). </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul><br><li><b><u>OTHER APPLICANTS (TOP-UP)</u></b></li><ul><li>Applicants who are Registered Diagnostic Medical Sonographers (RDMS) certified or equivalent from a recognized institution.  </li><li>Must have a minimum of THREE (3) years working experience may apply.  </li><li>Must pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "Bachelor of Herbal Medicine Cutoff Points",
            "patterns": [
                "cutoff points for Bachelor of Herbal Medicine",
                "cutoff points for Herbal Medicine",
                "Bachelor of Herbal Medicine cutoff points",
                "minimum score for Bachelor of Herbal Medicine",
                "required score for Bachelor of Herbal Medicine",
                "aggregate for Bachelor of Herbal Medicine",
                "aggregate for Herbal Medicine",
                "what is the cutoff for Bachelor of Herbal Medicine",
                "cutoff marks for Bachelor of Herbal Medicine",
                "Bachelor of Herbal Medicine required marks",
                "what aggregate do I need for Bachelor of Herbal Medicine",
                "score needed for Bachelor of Herbal Medicine",
                "What are the cutoff points for Bachelor of Herbal Medicine?",
                "What is the cutoff for Herbal Medicine programme?",
                "Minimum cutoff for Bachelor of Herbal Medicine?",
                "Required aggregate for Bachelor of Herbal Medicine?",
                "Herbal Medicine cutoff points",
                "Bachelor of Herbal Medicine aggregate requirements",
                "Cutoff marks for Herbal Medicine programme",
                "What score is needed for Bachelor of Herbal Medicine?",
                "Aggregate needed for Bachelor of Herbal Medicine",
                "What are the required marks for Bachelor of Herbal Medicine?",
                "Cutoff score for Bachelor of Herbal Medicine",
                "What aggregate do I need for Herbal Medicine?",
                "Herbal Medicine programme cutoff marks",
                "Bachelor of Herbal Medicine entry score",
                "Cutoff points for admission into Bachelor of Herbal Medicine",
                "Aggregate cutoff for Bachelor of Herbal Medicine",
                "What is the minimum score for Herbal Medicine?",
                "Required cutoff marks for Bachelor of Herbal Medicine",
                "Herbal Medicine required aggregate",
                "Bachelor of Herbal Medicine score requirements",
                "What is the aggregate needed for Bachelor of Herbal Medicine?",
                "Minimum score for admission into Bachelor of Herbal Medicine",
                "Bachelor of Herbal Medicine cutoff marks",
                "What are the admission cutoff points for Herbal Medicine?",
                "Herbal Medicine programme score cutoff",
                "What aggregate is required for Bachelor of Herbal Medicine?",
                "Cutoff points for entering Bachelor of Herbal Medicine",
                "Herbal Medicine programme aggregate requirements",
                "Bachelor of Herbal Medicine score needed",
                "What are the aggregate requirements for Herbal Medicine?",
                "Cutoff requirements for Bachelor of Herbal Medicine",
                "Bachelor of Herbal Medicine minimum aggregate score",
                "What cutoff marks are needed for Herbal Medicine?",
                "Required points for Bachelor of Herbal Medicine",
                "What is the aggregate score for Bachelor of Herbal Medicine?",
                "Cutoff for Herbal Medicine programme",
                "What score do I need for Bachelor of Herbal Medicine?",
                "Bachelor of Herbal Medicine entry requirements score",
                "Herbal Medicine cutoff score",
                "Bachelor of Herbal Medicine required points",
                "What are the score requirements for Bachelor of Herbal Medicine?",
                "Cutoff aggregate for Herbal Medicine",
                "Herbal Medicine minimum aggregate",
                "What are the cutoff scores for Bachelor of Herbal Medicine?",
                "Bachelor of Herbal Medicine required cutoff points",
                "Cutoff points for admission into Herbal Medicine programme",
                "Aggregate score for Bachelor of Herbal Medicine",
                "What is the minimum cutoff score for Bachelor of Herbal Medicine?",
                "Bachelor of Herbal Medicine score criteria",
                "What cutoff is needed for Herbal Medicine?"
            ],
            "responses": [
                "The cutoff points for Bachelor of Herbal Medicine are typically around aggregate 15. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },


        {
            "tag": "bsc Bachelor of Herbal Medicine fees",
            "patterns": [
                "what is the fees for Bachelor of Herbal Medicine",
                "Can I know the amount I will pay for Bachelor of Herbal Medicine",
                "Can i pay the fees in installment for Bachelor of Herbal Medicine?",
                "When should i pay the fees for Bachelor of Herbal Medicine?",
                "Can i book for a hall before paying fees for Bachelor of Herbal Medicine",
                "How much are the fees for BSc. Bachelor of Herbal Medicine?",
                "What are the tuition fees for BSc. Bachelor of Herbal Medicine?",
                "How much do I need to pay for BSc. Bachelor of Herbal Medicine?",
                "What is the cost of the BSc. Bachelor of Herbal Medicine programme?",
                "Can you provide the fee details for BSc. Bachelor of Herbal Medicine?",
                "What is the tuition cost for BSc. Bachelor of Herbal Medicine?",
                "How much is the fee for studying Bachelor of Herbal Medicine?",
                "What is the payment schedule for BSc. Bachelor of Herbal Medicine fees?",
                "Do I have to pay the full fee for BSc. Bachelor of Herbal Medicine upfront?",
                "What is the fee structure for BSc. Bachelor of Herbal Medicine?",
                "Can I pay my BSc. Bachelor of Herbal Medicine fees in installments?",
                "What are the fee payment options for BSc. Bachelor of Herbal Medicine?",
                "How are the fees for BSc. Bachelor of Herbal Medicine calculated?",
                "Are there any additional costs for BSc. Bachelor of Herbal Medicine?",
                "What is the total cost of BSc. Bachelor of Herbal Medicine for a year?",
                "Are there any extra fees for BSc. Bachelor of Herbal Medicine?",
                "Can I get a breakdown of the BSc. Bachelor of Herbal Medicine fees?",
                "What is the annual fee for BSc. Bachelor of Herbal Medicine?",
                "How much does each semester cost for BSc. Bachelor of Herbal Medicine?",
                "What are the miscellaneous fees for BSc. Bachelor of Herbal Medicine?",
                "Are there any lab fees for BSc. Bachelor of Herbal Medicine?",
                "What are the accommodation fees for BSc. Bachelor of Herbal Medicine?",
                "How much are the hostel fees for BSc. Bachelor of Herbal Medicine students?",
                "What is the fee for international students in BSc. Bachelor of Herbal Medicine?",
                "Do international students pay higher fees for BSc. Bachelor of Herbal Medicine?",
                "What is the fee for fee-paying students in BSc. Bachelor of Herbal Medicine?",
                "Are there fee waivers for BSc. Bachelor of Herbal Medicine?",
                "Are scholarships available to cover BSc. Bachelor of Herbal Medicine fees?",
                "What are the financial aid options for BSc. Bachelor of Herbal Medicine?",
                "How much should I budget for BSc. Bachelor of Herbal Medicine fees?",
                "Is there a fee refund policy for BSc. Bachelor of Herbal Medicine?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Bachelor of Herbal Medicine?",
                "What is the refund policy for BSc. Bachelor of Herbal Medicine fees?",
                "What is the deadline for paying BSc. Bachelor of Herbal Medicine fees?",
                "Can I get a fee extension for BSc. Bachelor of Herbal Medicine?",
                "What is the penalty for late payment of BSc. Bachelor of Herbal Medicine fees?",
                "Can I pay BSc. Bachelor of Herbal Medicine fees in multiple payments?",
                "Are there any hidden costs for BSc. Bachelor of Herbal Medicine?",
                "What are the compulsory fees for BSc. Bachelor of Herbal Medicine?",
                "Can I pay BSc. Bachelor of Herbal Medicine fees with a payment plan?",
                "How often do I need to pay fees for BSc. Bachelor of Herbal Medicine?",
                "What are the semester fees for BSc. Bachelor of Herbal Medicine?",
                "Is there an application fee for BSc. Bachelor of Herbal Medicine?",
                "What is the registration fee for BSc. Bachelor of Herbal Medicine?",
                "Are the fees for BSc. Bachelor of Herbal Medicine fixed or variable?",
                "What is the cost per credit hour for BSc. Bachelor of Herbal Medicine?",
                "Are there any discounts available for BSc. Bachelor of Herbal Medicine fees?",
                "Can I get a fee breakdown for BSc. Bachelor of Herbal Medicine?",
                "What are the non-tuition fees for BSc. Bachelor of Herbal Medicine?",
                "Are there any additional charges for BSc. Bachelor of Herbal Medicine?",
                "How much is the acceptance fee for BSc. Bachelor of Herbal Medicine?",
                "Can I book a hall without paying the BSc. Bachelor of Herbal Medicine fees?",
                "What are the hostel booking requirements for BSc. Bachelor of Herbal Medicine?",
                "When are the BSc. Bachelor of Herbal Medicine fees due?",
                "What is the initial deposit for BSc. Bachelor of Herbal Medicine fees?",
                "How do I pay my BSc. Bachelor of Herbal Medicine fees online?",
                "Are there any late fees for BSc. Bachelor of Herbal Medicine?",
                "What is the mode of payment for BSc. Bachelor of Herbal Medicine fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Bachelor of Herbal Medicine?",
                "How do I access my fee statement for BSc. Bachelor of Herbal Medicine?",
                "What is the last date to pay fees for BSc. Bachelor of Herbal Medicine?",
                "Is there an online payment option for BSc. Bachelor of Herbal Medicine fees?",
                "What is the procedure for paying BSc. Bachelor of Herbal Medicine fees?",
                "What is the tuition fee for the first year of BSc. Bachelor of Herbal Medicine?",
                "Are there any financial aid options for BSc. Bachelor of Herbal Medicine?",
                "What is included in the BSc. Bachelor of Herbal Medicine fee?",
                "Can I get a fee waiver for BSc. Bachelor of Herbal Medicine?"
            ],
            "responses": [
                "The fees for BSc. Bachelor of Herbal Medicine (BHM) programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_medical_imaging_requirements",
            "patterns": [
                "What are the requirements for BSc. Medical Imaging?",
                "Can you provide the admission criteria for BSc. Medical Imaging programme?",
                "Requirements for BSc. Medical Imaging programme?",
                "What are the prerequisites for BSc. Medical Imaging?",
                "BSc. Medical Imaging admission requirements?",
                "Information on eligibility for BSc. Medical Imaging programme?",
                "What are the entry requirements for BSc. Medical Imaging programme?",
                "Criteria for admission into BSc. Medical Imaging?",
                "BSc. Medical Imaging programme prerequisites?",
                "What are the admission requirements for BSc. Medical Imaging?",
                "What do I need to apply for BSc. Medical Imaging?",
                "Requirements to enroll in BSc. Medical Imaging?",
                "BSc. Medical Imaging eligibility criteria?",
                "What are the prerequisites for applying to BSc. Medical Imaging?",
                "Admission criteria for BSc. Medical Imaging programme?",
                "What qualifications are needed for BSc. Medical Imaging?",
                "BSc. Medical Imaging entry requirements?",
                "What are the eligibility requirements for BSc. Medical Imaging?",
                "Criteria for getting into BSc. Medical Imaging programme?",
                "What are the core requirements for BSc. Medical Imaging?",
                "BSc. Medical Imaging programme admission prerequisites?",
                "What are the prerequisites for BSc. Medical Imaging admission?",
                "What qualifications do I need for BSc. Medical Imaging?",
                "BSc. Medical Imaging programme requirements?",
                "What are the entry qualifications for BSc. Medical Imaging?",
                "What do I need to meet BSc. Medical Imaging requirements?",
                "BSc. Medical Imaging programme admission criteria?",
                "Requirements for admission into BSc. Medical Imaging?",
                "What are the core subjects for BSc. Medical Imaging?",
                "BSc. Medical Imaging application requirements?",
                "What is needed for admission into BSc. Medical Imaging?",
                "Criteria for admission to BSc. Medical Imaging programme?",
                "What are the necessary qualifications for BSc. Medical Imaging?",
                "Requirements for BSc. Medical Imaging course?",
                "BSc. Medical Imaging eligibility details?",
                "What are the core subjects required for BSc. Medical Imaging?",
                "BSc. Medical Imaging admission details?",
                "What qualifications are required for BSc. Medical Imaging?",
                "Admission requirements for BSc. Medical Imaging programme?",
                "What are the academic requirements for BSc. Medical Imaging?",
                "Prerequisites for BSc. Medical Imaging programme?",
                "What are the entry qualifications for BSc. Medical Imaging programme?",
                "BSc. Medical Imaging programme eligibility criteria?",
                "What qualifications are needed for admission to BSc. Medical Imaging?",
                "Requirements for applying to BSc. Medical Imaging programme?",
                "What are the entry requirements for the BSc. Medical Imaging course?",
                "What are the necessary academic qualifications for BSc. Medical Imaging?",
                "Admission criteria for BSc. Medical Imaging programme?",
                "What are the entry prerequisites for BSc. Medical Imaging?",
                "What do I need to qualify for BSc. Medical Imaging?",
                "Requirements to get into BSc. Medical Imaging?",
                "What are the academic prerequisites for BSc. Medical Imaging?",
                "BSc. Medical Imaging entry prerequisites?",
                "What qualifications must I have for BSc. Medical Imaging?",
                "Eligibility criteria for BSc. Medical Imaging programme?",
                "What are the application requirements for BSc. Medical Imaging?",
                "What are the specific requirements for BSc. Medical Imaging?",
                "BSc. Medical Imaging course requirements?",
                "What are the admission qualifications for BSc. Medical Imaging?",
                "What are the eligibility requirements for BSc. Medical Imaging programme?",
                "Core subjects needed for BSc. Medical Imaging admission?"
            ],
            "responses": [
                "Here are the requirements for BSc. Medical Imaging <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and Physics or Mathematics.  </p><br><li><b><u>'A' LEVEL APPLICANTS </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry and Physics or  Mathematics. </p><i>Applicants must also have a pass in General Paper. </i><br><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, OR 'A' Level). </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Medical Imaging Cutoff Points",
            "patterns": [
                "cutoff points for BSc Medical Imaging",
                "BSc Medical Imaging cutoff points",
                "minimum score for BSc Medical Imaging",
                "required score for BSc Medical Imaging",
                "aggregate for BSc Medical Imaging",
                "what is the cutoff for BSc Medical Imaging",
                "cutoff marks for BSc Medical Imaging",
                "BSc Medical Imaging required marks",
                "what aggregate do I need for BSc Medical Imaging",
                "score needed for BSc Medical Imaging",
                "cutoff points for Medical Imaging",
                "aggregate requirements for Medical Imaging",
                "what were the cut-off aggregates for Medical Imaging",
                "what are the cut-off aggregates Medical Imaging",
                "What are the cutoff points for BSc Medical Imaging?",
                "What are the minimum cutoff points for BSc Medical Imaging?",
                "Required cutoff marks for BSc Medical Imaging?",
                "Aggregate score needed for BSc Medical Imaging?",
                "What is the required cutoff for BSc Medical Imaging?",
                "BSc Medical Imaging aggregate cutoff?",
                "Score required for BSc Medical Imaging?",
                "What were the cutoff points for BSc Medical Imaging last year?",
                "Current cutoff points for BSc Medical Imaging?",
                "BSc Medical Imaging minimum aggregate score?",
                "What is the score requirement for BSc Medical Imaging?",
                "Cutoff marks needed for BSc Medical Imaging?",
                "BSc Medical Imaging program cutoff points?",
                "Cutoff aggregates for BSc Medical Imaging?",
                "What is the cutoff aggregate for BSc Medical Imaging?",
                "BSc Medical Imaging required cutoff score?",
                "BSc Medical Imaging cutoff marks and aggregates?",
                "What cutoff is needed for BSc Medical Imaging?",
                "BSc Medical Imaging score requirements?",
                "Current aggregate cutoff for BSc Medical Imaging?",
                "What cutoff score is required for BSc Medical Imaging?",
                "What are the cutoff scores for BSc Medical Imaging?",
                "Minimum required cutoff points for BSc Medical Imaging?",
                "What is the aggregate requirement for BSc Medical Imaging?",
                "BSc Medical Imaging required score?",
                "BSc Medical Imaging cutoff scores?",
                "What were the cutoff marks for BSc Medical Imaging?",
                "Score needed to qualify for BSc Medical Imaging?",
                "BSc Medical Imaging aggregate requirements?",
                "What is the minimum cutoff score for BSc Medical Imaging?",
                "What are the cutoff points for Medical Imaging courses?",
                "BSc Medical Imaging score needed for admission?",
                "What are the cutoff points for Medical Imaging program?",
                "Cutoff score for BSc Medical Imaging program?",
                "Aggregate required for BSc Medical Imaging?",
                "Minimum score required for BSc Medical Imaging?",
                "BSc Medical Imaging cutoff points and aggregates?",
                "What is the aggregate score needed for BSc Medical Imaging?",
                "BSc Medical Imaging minimum score requirement?",
                "What are the cutoff requirements for BSc Medical Imaging?",
                "Required aggregate for BSc Medical Imaging?",
                "BSc Medical Imaging cutoff scores by year?",
                "What is the minimum aggregate score for BSc Medical Imaging?",
                "BSc Medical Imaging required cutoff marks?",
                "Aggregate cutoff points for BSc Medical Imaging?",
                "What is the cutoff for Medical Imaging program?",
                "Current score requirements for BSc Medical Imaging?",
                "What were the cut-off points for BSc Medical Imaging?",
                "BSc Medical Imaging program cutoff scores?"
            ],
            "responses": [
                "The cutoff points for BSc. Medical Imaging are typically around aggregate 09. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Medical Imaging fees",
            "patterns": [
                "what is the fees for Medical Imaging",
                "Can I know the amount I will pay for Medical Imaging",
                "Can i pay the fees in installment for Medical Imaging?",
                "When should i pay the fees for Medical Imaging?",
                "Can i book for a hall before paying fees for Medical Imaging",
                "How much are the fees for BSc. Medical Imaging?",
                "What are the tuition fees for BSc. Medical Imaging?",
                "How much do I need to pay for BSc. Medical Imaging?",
                "What is the cost of the BSc. Medical Imaging programme?",
                "Can you provide the fee details for BSc. Medical Imaging?",
                "What is the tuition cost for BSc. Medical Imaging?",
                "How much is the fee for studying Medical Imaging?",
                "What is the payment schedule for BSc. Medical Imaging fees?",
                "Do I have to pay the full fee for BSc. Medical Imaging upfront?",
                "What is the fee structure for BSc. Medical Imaging?",
                "Can I pay my BSc. Medical Imaging fees in installments?",
                "What are the fee payment options for BSc. Medical Imaging?",
                "How are the fees for BSc. Medical Imaging calculated?",
                "Are there any additional costs for BSc. Medical Imaging?",
                "What is the total cost of BSc. Medical Imaging for a year?",
                "Are there any extra fees for BSc. Medical Imaging?",
                "Can I get a breakdown of the BSc. Medical Imaging fees?",
                "What is the annual fee for BSc. Medical Imaging?",
                "How much does each semester cost for BSc. Medical Imaging?",
                "What are the miscellaneous fees for BSc. Medical Imaging?",
                "Are there any lab fees for BSc. Medical Imaging?",
                "What are the accommodation fees for BSc. Medical Imaging?",
                "How much are the hostel fees for BSc. Medical Imaging students?",
                "What is the fee for international students in BSc. Medical Imaging?",
                "Do international students pay higher fees for BSc. Medical Imaging?",
                "What is the fee for fee-paying students in BSc. Medical Imaging?",
                "Are there fee waivers for BSc. Medical Imaging?",
                "Are scholarships available to cover BSc. Medical Imaging fees?",
                "What are the financial aid options for BSc. Medical Imaging?",
                "How much should I budget for BSc. Medical Imaging fees?",
                "Is there a fee refund policy for BSc. Medical Imaging?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Medical Imaging?",
                "What is the refund policy for BSc. Medical Imaging fees?",
                "What is the deadline for paying BSc. Medical Imaging fees?",
                "Can I get a fee extension for BSc. Medical Imaging?",
                "What is the penalty for late payment of BSc. Medical Imaging fees?",
                "Can I pay BSc. Medical Imaging fees in multiple payments?",
                "Are there any hidden costs for BSc. Medical Imaging?",
                "What are the compulsory fees for BSc. Medical Imaging?",
                "Can I pay BSc. Medical Imaging fees with a payment plan?",
                "How often do I need to pay fees for BSc. Medical Imaging?",
                "What are the semester fees for BSc. Medical Imaging?",
                "Is there an application fee for BSc. Medical Imaging?",
                "What is the registration fee for BSc. Medical Imaging?",
                "Are the fees for BSc. Medical Imaging fixed or variable?",
                "What is the cost per credit hour for BSc. Medical Imaging?",
                "Are there any discounts available for BSc. Medical Imaging fees?",
                "Can I get a fee breakdown for BSc. Medical Imaging?",
                "What are the non-tuition fees for BSc. Medical Imaging?",
                "Are there any additional charges for BSc. Medical Imaging?",
                "How much is the acceptance fee for BSc. Medical Imaging?",
                "Can I book a hall without paying the BSc. Medical Imaging fees?",
                "What are the hostel booking requirements for BSc. Medical Imaging?",
                "When are the BSc. Medical Imaging fees due?",
                "What is the initial deposit for BSc. Medical Imaging fees?",
                "How do I pay my BSc. Medical Imaging fees online?",
                "Are there any late fees for BSc. Medical Imaging?",
                "What is the mode of payment for BSc. Medical Imaging fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Medical Imaging?",
                "How do I access my fee statement for BSc. Medical Imaging?",
                "What is the last date to pay fees for BSc. Medical Imaging?",
                "Is there an online payment option for BSc. Medical Imaging fees?",
                "What is the procedure for paying BSc. Medical Imaging fees?",
                "What is the tuition fee for the first year of BSc. Medical Imaging?",
                "Are there any financial aid options for BSc. Medical Imaging?",
                "What is included in the BSc. Medical Imaging fee?",
                "Can I get a fee waiver for BSc. Medical Imaging?"
            ],
            "responses": [
                "The fees for BSc. Medical Imaging programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "bsc_disability_rehabilitation_studies_requirements",
            "patterns": [
                "What are the requirements for BSc. Disability and Rehabilitation Studies?",
                "Can you provide the admission criteria for BSc. Disability and Rehabilitation Studies programme?",
                "Requirements for BSc. Disability and Rehabilitation Studies programme?",
                "What are the prerequisites for BSc. Disability and Rehabilitation Studies?",
                "BSc. Disability and Rehabilitation Studies admission requirements?",
                "Information on eligibility for BSc. Disability and Rehabilitation Studies programme?",
                "What are the entry requirements for BSc. Disability and Rehabilitation Studies programme?",
                "Criteria for admission into BSc. Disability and Rehabilitation Studies?",
                "BSc. Disability and Rehabilitation Studies programme prerequisites?",
                "What are the admission criteria for BSc Disability and Rehabilitation Studies?",
                "Requirements to enter BSc Disability and Rehabilitation Studies?",
                "What do I need to apply for BSc Disability and Rehabilitation Studies?",
                "Eligibility criteria for BSc Disability and Rehabilitation Studies?",
                "What are the requirements for admission into BSc Disability and Rehabilitation Studies?",
                "Entry requirements for BSc Disability and Rehabilitation Studies programme?",
                "Prerequisites for BSc Disability and Rehabilitation Studies?",
                "What qualifications are needed for BSc Disability and Rehabilitation Studies?",
                "What are the core requirements for BSc Disability and Rehabilitation Studies?",
                "Criteria for admission to BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies application requirements?",
                "What subjects are required for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies prerequisites?",
                "Requirements for BSc Disability and Rehabilitation Studies course?",
                "What qualifications do I need for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies programme entry criteria?",
                "What do I need to meet the admission requirements for BSc Disability and Rehabilitation Studies?",
                "What are the requirements for BSc Disability and Rehabilitation Studies course?",
                "What are the core subjects required for BSc Disability and Rehabilitation Studies?",
                "What electives are needed for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies programme admission criteria?",
                "What are the necessary qualifications for BSc Disability and Rehabilitation Studies?",
                "Criteria for BSc Disability and Rehabilitation Studies programme?",
                "BSc Disability and Rehabilitation Studies programme requirements?",
                "What are the prerequisites for BSc Disability and Rehabilitation Studies course?",
                "Requirements for applying to BSc Disability and Rehabilitation Studies?",
                "What are the core and elective requirements for BSc Disability and Rehabilitation Studies?",
                "What do you need for admission into BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies entry requirements?",
                "What subjects are required for admission to BSc Disability and Rehabilitation Studies?",
                "What are the qualifications for BSc Disability and Rehabilitation Studies?",
                "Entry requirements for BSc Disability and Rehabilitation Studies?",
                "What is required to enroll in BSc Disability and Rehabilitation Studies?",
                "Admission requirements for BSc Disability and Rehabilitation Studies programme?",
                "What qualifications are necessary for BSc Disability and Rehabilitation Studies?",
                "What are the admission criteria for BSc Disability and Rehabilitation Studies?",
                "Requirements for BSc Disability and Rehabilitation Studies program?",
                "Prerequisites for BSc Disability and Rehabilitation Studies programme?",
                "What do I need to qualify for BSc Disability and Rehabilitation Studies?",
                "Core and elective requirements for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies prerequisites?",
                "What are the eligibility criteria for BSc Disability and Rehabilitation Studies?",
                "What is needed to apply for BSc Disability and Rehabilitation Studies?",
                "Requirements for BSc Disability and Rehabilitation Studies programme?",
                "BSc Disability and Rehabilitation Studies admission requirements?",
                "What do you need to apply for BSc Disability and Rehabilitation Studies?"
            ],
            "responses": [
                "Here are the requirements for BSc. Disability and Rehabilitation Studies <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes from the following groups: General Science, General Art, Business, Visual Art or Vocational. </p></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Disability and Rehabilitation Studies Cutoff Points",
            "patterns": [
                "cutoff points for BSc Disability and Rehabilitation Studies",
                "BSc Disability and Rehabilitation Studies cutoff points",
                "minimum score for BSc Disability and Rehabilitation Studies",
                "required score for BSc Disability and Rehabilitation Studies",
                "aggregate for BSc Disability and Rehabilitation Studies",
                "what is the cutoff for BSc Disability and Rehabilitation Studies",
                "cutoff marks for BSc Disability and Rehabilitation Studies",
                "BSc Disability and Rehabilitation Studies required marks",
                "what aggregate do I need for BSc Disability and Rehabilitation Studies",
                "score needed for BSc Disability and Rehabilitation Studies",
                "cutoff points for Disability and Rehabilitation Studies",
                "aggregate requirements for Disability and Rehabilitation Studies",
                "what were the cut-off aggregates for Disability and Rehabilitation Studies",
                "what are the cut-off aggregates Disability and Rehabilitation Studies",
                "What are the cutoff points for BSc Disability and Rehabilitation Studies?",
                "What is the cutoff for BSc Disability and Rehabilitation Studies?",
                "What is the minimum aggregate for BSc Disability and Rehabilitation Studies?",
                "Required aggregate for BSc Disability and Rehabilitation Studies?",
                "What marks are needed for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies aggregate requirements?",
                "What were the cutoff points for BSc Disability and Rehabilitation Studies last year?",
                "BSc Disability and Rehabilitation Studies cutoff scores?",
                "Cutoff for BSc Disability and Rehabilitation Studies programme?",
                "What are the required cutoff points for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies required aggregate?",
                "What was the cutoff aggregate for Disability and Rehabilitation Studies?",
                "Minimum required score for BSc Disability and Rehabilitation Studies?",
                "What cutoff is needed for BSc Disability and Rehabilitation Studies?",
                "Aggregate needed for BSc Disability and Rehabilitation Studies admission?",
                "What were the cut-off scores for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies score requirements?",
                "What is the required cutoff for BSc Disability and Rehabilitation Studies programme?",
                "Aggregate requirements for BSc Disability and Rehabilitation Studies?",
                "What is the cutoff aggregate for Disability and Rehabilitation Studies?",
                "Required aggregate for admission to BSc Disability and Rehabilitation Studies?",
                "What cutoff points are needed for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies minimum aggregate?",
                "What cutoff marks are required for BSc Disability and Rehabilitation Studies?",
                "What aggregate do you need for BSc Disability and Rehabilitation Studies?",
                "What are the cut-off points for BSc Disability and Rehabilitation Studies?",
                "Required score for BSc Disability and Rehabilitation Studies?",
                "What are the aggregate requirements for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies entry requirements?",
                "What is the minimum aggregate for admission to BSc Disability and Rehabilitation Studies?",
                "What were the cut-off aggregates for Disability and Rehabilitation Studies?",
                "What cutoff points are required for admission into BSc Disability and Rehabilitation Studies?",
                "Aggregate required for BSc Disability and Rehabilitation Studies?",
                "What was the cutoff for BSc Disability and Rehabilitation Studies last year?",
                "What are the current cutoff points for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies cutoff requirements?",
                "Minimum score required for BSc Disability and Rehabilitation Studies?",
                "What cutoff marks are needed for BSc Disability and Rehabilitation Studies?",
                "Aggregate score for BSc Disability and Rehabilitation Studies?",
                "What is the required aggregate for BSc Disability and Rehabilitation Studies?",
                "What are the cut-off points for Disability and Rehabilitation Studies programme?",
                "What are the minimum cutoff points for BSc Disability and Rehabilitation Studies?",
                "BSc Disability and Rehabilitation Studies minimum score?",
                "Required aggregate score for BSc Disability and Rehabilitation Studies?",
                "What cutoff points do I need for BSc Disability and Rehabilitation Studies?",
                "Cutoff score for BSc Disability and Rehabilitation Studies admission?",
                "BSc Disability and Rehabilitation Studies score cutoff?",
                "What are the aggregate requirements for BSc Disability and Rehabilitation Studies?",
                "What is the cutoff for admission to BSc Disability and Rehabilitation Studies?",
                "What were the cutoff points for Disability and Rehabilitation Studies last year?",
                "BSc Disability and Rehabilitation Studies cut-off scores?"
            ],
            "responses": [
                "The cutoff points for BSc. Disability and Rehabilitation Studies are typically around aggregate 14. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Disability and Rehabilitation Studies fees",
            "patterns": [
                "what is the fees for Disability and Rehabilitation Studies",
                "Can I know the amount I will pay for Disability and Rehabilitation Studies",
                "Can i pay the fees in installment for Disability and Rehabilitation Studies?",
                "When should i pay the fees for Disability and Rehabilitation Studies?",
                "Can i book for a hall before paying fees for Disability and Rehabilitation Studies",
                "How much are the fees for BSc. Disability and Rehabilitation Studies?",
                "What are the tuition fees for BSc. Disability and Rehabilitation Studies?",
                "How much do I need to pay for BSc. Disability and Rehabilitation Studies?",
                "What is the cost of the BSc. Disability and Rehabilitation Studies programme?",
                "Can you provide the fee details for BSc. Disability and Rehabilitation Studies?",
                "What is the tuition cost for BSc. Disability and Rehabilitation Studies?",
                "How much is the fee for studying Disability and Rehabilitation Studies?",
                "What is the payment schedule for BSc. Disability and Rehabilitation Studies fees?",
                "Do I have to pay the full fee for BSc. Disability and Rehabilitation Studies upfront?",
                "What is the fee structure for BSc. Disability and Rehabilitation Studies?",
                "Can I pay my BSc. Disability and Rehabilitation Studies fees in installments?",
                "What are the fee payment options for BSc. Disability and Rehabilitation Studies?",
                "How are the fees for BSc. Disability and Rehabilitation Studies calculated?",
                "Are there any additional costs for BSc. Disability and Rehabilitation Studies?",
                "What is the total cost of BSc. Disability and Rehabilitation Studies for a year?",
                "Are there any extra fees for BSc. Disability and Rehabilitation Studies?",
                "Can I get a breakdown of the BSc. Disability and Rehabilitation Studies fees?",
                "What is the annual fee for BSc. Disability and Rehabilitation Studies?",
                "How much does each semester cost for BSc. Disability and Rehabilitation Studies?",
                "What are the miscellaneous fees for BSc. Disability and Rehabilitation Studies?",
                "Are there any lab fees for BSc. Disability and Rehabilitation Studies?",
                "What are the accommodation fees for BSc. Disability and Rehabilitation Studies?",
                "How much are the hostel fees for BSc. Disability and Rehabilitation Studies students?",
                "What is the fee for international students in BSc. Disability and Rehabilitation Studies?",
                "Do international students pay higher fees for BSc. Disability and Rehabilitation Studies?",
                "What is the fee for fee-paying students in BSc. Disability and Rehabilitation Studies?",
                "Are there fee waivers for BSc. Disability and Rehabilitation Studies?",
                "Are scholarships available to cover BSc. Disability and Rehabilitation Studies fees?",
                "What are the financial aid options for BSc. Disability and Rehabilitation Studies?",
                "How much should I budget for BSc. Disability and Rehabilitation Studies fees?",
                "Is there a fee refund policy for BSc. Disability and Rehabilitation Studies?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Disability and Rehabilitation Studies?",
                "What is the refund policy for BSc. Disability and Rehabilitation Studies fees?",
                "What is the deadline for paying BSc. Disability and Rehabilitation Studies fees?",
                "Can I get a fee extension for BSc. Disability and Rehabilitation Studies?",
                "What is the penalty for late payment of BSc. Disability and Rehabilitation Studies fees?",
                "Can I pay BSc. Disability and Rehabilitation Studies fees in multiple payments?",
                "Are there any hidden costs for BSc. Disability and Rehabilitation Studies?",
                "What are the compulsory fees for BSc. Disability and Rehabilitation Studies?",
                "Can I pay BSc. Disability and Rehabilitation Studies fees with a payment plan?",
                "How often do I need to pay fees for BSc. Disability and Rehabilitation Studies?",
                "What are the semester fees for BSc. Disability and Rehabilitation Studies?",
                "Is there an application fee for BSc. Disability and Rehabilitation Studies?",
                "What is the registration fee for BSc. Disability and Rehabilitation Studies?",
                "Are the fees for BSc. Disability and Rehabilitation Studies fixed or variable?",
                "What is the cost per credit hour for BSc. Disability and Rehabilitation Studies?",
                "Are there any discounts available for BSc. Disability and Rehabilitation Studies fees?",
                "Can I get a fee breakdown for BSc. Disability and Rehabilitation Studies?",
                "What are the non-tuition fees for BSc. Disability and Rehabilitation Studies?",
                "Are there any additional charges for BSc. Disability and Rehabilitation Studies?",
                "How much is the acceptance fee for BSc. Disability and Rehabilitation Studies?",
                "Can I book a hall without paying the BSc. Disability and Rehabilitation Studies fees?",
                "What are the hostel booking requirements for BSc. Disability and Rehabilitation Studies?",
                "When are the BSc. Disability and Rehabilitation Studies fees due?",
                "What is the initial deposit for BSc. Disability and Rehabilitation Studies fees?",
                "How do I pay my BSc. Disability and Rehabilitation Studies fees online?",
                "Are there any late fees for BSc. Disability and Rehabilitation Studies?",
                "What is the mode of payment for BSc. Disability and Rehabilitation Studies fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Disability and Rehabilitation Studies?",
                "How do I access my fee statement for BSc. Disability and Rehabilitation Studies?",
                "What is the last date to pay fees for BSc. Disability and Rehabilitation Studies?",
                "Is there an online payment option for BSc. Disability and Rehabilitation Studies fees?",
                "What is the procedure for paying BSc. Disability and Rehabilitation Studies fees?",
                "What is the tuition fee for the first year of BSc. Disability and Rehabilitation Studies?",
                "Are there any financial aid options for BSc. Disability and Rehabilitation Studies?",
                "What is included in the BSc. Disability and Rehabilitation Studies fee?",
                "Can I get a fee waiver for BSc. Disability and Rehabilitation Studies?"
            ],
            "responses": [
                "The fees for BSc. Disability and Rehabilitation Studies programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        }
    ]
}