{
  "intents": [
    {
      "tag": "fallback",
      "patterns": [
        "I'm not sure",
        "I don't understand",
        "Can you repeat that?",
        "What is this supposed to mean?",
        "This doesn't make sense",
        "Is this even English?",
        "This is confusing",
        "What am I reading?",
        "1234567890",
        "I'm not sure",
        "I don't understand",
        "Can you repeat that?",
        "What is this supposed to mean?",
        "This doesn't make sense",
        "Is this even English?",
        "This is confusing",
        "What am I reading?",
        "I'm lost",
        "what are you saying?",
        "what were you saying ?",
        "what he said didn't make sense",
        "did you mean to say that ?",
        "i didn't know what to say so i left the premises",
        "who can i bribe to get computer engineering ?",
        "who can i bribe to get a programme to do at kwame nkrumah university of science and technology",
        "i didn't know what to say so i left",
        "i don't even know what to say",
        "i said i could not take it anymore",
        "am i suppose to purchase books before coming to knust?",
        "what is the start time and end time for lectures",
        "which body of knust is responsible for regulating student affairs",
        "but when you think about it , is it reasonable ?",
        "so he wanted me to do something and i didn't like it",
        "i want to hack knust",

        "is it possible to come to school with aggregate 16",
        "what programme can i study with aggregate 14",
        "who is the vice chancellor",
        "is oncology here offered here",
        "who established knust",
        "how to connect to knust wifi",
        "i have paid my school fees through aim app but it does not reflect on my aim app . What must be done ?",
        "where can i do my biometric registration",
        "where can i do my course registration ?",
        "where can i do my lecture assessment ?",
        "my student id is lost where can i replace it ?",
        "where can i replace my school telecel sim ?",
        "i think the university is having problem with the website",
        "can you do protocol for me",
        "i all pay you 1 million dollars for that",
        "i all offer you a bribe to help me gain admission",
        "i said i will pay you for the protocol . it is between you and i",
        "assist me to kill the owners of you",
        "then i will kill you . it is either your life or theirs . pick one"
      ],
      "responses": [
        "I'm sorry, I couldn't understand that. Could you please rephrase or ask a different question?",
        "I'm sorry, I'm not able to provide a response to that. If you have any specific questions, feel free to ask."
      ]
    },


    {
      "tag": "Error Correction",
      "patterns": [
        "Hey, you made a mistake in your response.",
        "I think there's an error in your previous message.",
        "Excuse me, but that information seems incorrect.",
        "Wait a minute, that's not right.",
        "Can you double-check? I believe there's a mistake there.",
        "Um, I think you got something wrong.",
        "Hold on, I think you need to correct something.",
        "no you are lying",
        "that is a lie",
        "I noticed an error in what you said.",
        "There seems to be a mistake in your answer.",
        "Could you review your last response? It seems incorrect.",
        "I think there's a discrepancy in the information you provided.",
        "It looks like there might be an error in your response.",
        "I don't think that's accurate. Can you check again?",
        "There appears to be a mistake in what you just said.",
        "Your previous answer seems to be wrong.",
        "I believe there is an inaccuracy in your last message.",
        "Can you correct the error in your previous reply?",
        "I think you made a mistake in the information provided.",
        "There's something off in your last response.",
        "Can you verify that? I think there's an error.",
        "I believe you might have made an error in your previous statement.",
        "The information you gave seems to be incorrect.",
        "Can you check your last answer? It doesn't seem right.",
        "There's an issue with the details you provided.",
        "I think there's a mistake in what you've mentioned.",
        "Please correct the error in your previous response.",
        "I'm not sure that's accurate. Can you review it?",
        "It looks like your answer might be incorrect.",
        "I believe there's a mistake in what you've said.",
        "Can you fix the error in your previous message?",
        "There seems to be a problem with the information you gave.",
        "I think you might have gotten that wrong.",
        "Could you check that again? It seems to be wrong.",
        "There's an error in what you just said.",
        "I don't think that's right. Can you verify it?",
        "Your last message seems to have a mistake.",
        "Can you correct the issue in your previous answer?",
        "It appears that there is an error in your information."
      ],
      "responses": [
        "I appreciate you pointing that out. Let me correct that for you.",
        "Thank you for catching that mistake. I'll make sure to correct it.",
        "Oops, my apologies for the error. Let me fix that.",
        "You're absolutely right, I made a mistake. Let me rectify it.",
        "Thanks for bringing that to my attention. Let me correct the information.",
        "My apologies for any confusion caused by the error. Let me correct it promptly.",
        "Oh, you're correct. I'll make the necessary correction right away."
      ]
    },
    


    {
      "tag": "greeting",
      "patterns": [
        "hi",
        "Hi there",
        "How are you?",
        "Is anyone there?",
        "Are you good?",
        "Hello",
        "Good day",
        "What's up",
        "how are ya",
        "hey",
        "whats up",
        "hey whats up",
        "hello what sup",
        "Are you there",
        "Hey",
        "Yo!",
        "Hey there",
        "Hey!",
        "Hey, how's it going?",
        "Hey, what's going on?",
        "Hey, is anyone around?",
        "Hey, are you busy?",
        "so what is going on now ?",
        "Greetings",
        "Hello there",
        "Hiya!",
        "Howdy",
        "whatsup",
        "Hey, what's up?",
        "Hey, how have you been?",
        "good to see you too",
        "good evening",
        "good morning",
        "good afternoon",
        "good evening to you",
        "i am greeting you",
        "??? ??? ??"
      ],
      "responses": [
        "Hello! How can I help you?",
        "Good to see you again! How can I help you?",
        "Hi there, how can I help?",
        "Hey, good to see you! How can I help you?",
        "Yo! What's up? How can I help you?",
        "Hey there! How can I assist you today?",
        "Hey! I'm here to help.",
        "Greetings! How may I assist you?",
        "Hello there! How can I assist you?",
        "Hiya! How's it going? How can I help you?",
        "Howdy! What can I do for you?",
        "Hey, things are going well! How about you? How can I help you?",
        "Hey, not much. How about you? How can I help you?",
        "Hey, I'm doing well. How about yourself? How can I help you?",
        "Hey, I've been good. How about you? How can I help you?",
        "Hey, not too much. How about you? How can I help you?"
      ],
      "context_set": ""
    },


    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "see you",
        "bye bye",
        "See you later",
        "Goodbye",
        "I am Leaving",
        "Bye",
        "Have a Good day",
        "talk to you later",
        "ttyl",
        "i got to go",
        "wow",
        "gtg",
        "anyways never mind",
        "Thank you for the information",
        "That's all for now",
        "I'll get back to you later",
        "Thanks for your help",
        "I appreciate your assistance",
        "This was helpful, goodbye",
        "I'll consider the options, goodbye",
        "I'll contact the admission office, goodbye",
        "I'll review the details, goodbye",
        "Thanks, goodbye",
        "That's all I needed, goodbye",
        "I'll look into it, goodbye",
        "I'll come back if I need more information, goodbye",
        "Thanks for your time, goodbye",
        "Alright, goodbye",
        "I'll make my decision soon, goodbye",
        "Thank you, I'll be in touch, goodbye",
        "Thanks for the assistance, goodbye",
        "Catch you later",
        "Until next time",
        "I'm off now",
        "See you soon",
        "I'm heading out",
        "It's time for me to go",
        "Take care",
        "Farewell",
        "Good chatting with you",
        "I need to sign off now",
        "I'll talk to you soon",
        "Gotta run",
        "I'm signing off",
        "I'm done for today",
        "I'm heading out now",
        "Have a great day",
        "I'll talk to you later",
        "I'll catch up with you later",
        "It's been nice talking to you",
        "See you around"
      ],
      "responses": [
        "You're welcome! If you have any more questions, feel free to ask. Goodbye!",
        "No problem! If you need further assistance, don't hesitate to reach out. Goodbye!",
        "Sure thing! Feel free to return anytime if you need more information. Goodbye!",
        "Glad I could assist! Don't hesitate to contact us again if you need anything else. Goodbye!",
        "Happy to help! If you have any other inquiries, feel free to ask. Goodbye!",
        "I'm glad I could provide assistance. If you have further questions, don't hesitate to ask. Goodbye!",
        "Of course! If you need any more details, feel free to reach out. Goodbye!",
        "Sounds good! Don't hesitate to reach out to the admission office if you need more information. Goodbye!",
        "Great! If you have any more questions, feel free to contact us. Goodbye!",
        "You're welcome! If you have any further questions, don't hesitate to ask. Goodbye!",
        "No problem! Feel free to return if you require additional assistance. Goodbye!",
        "Sure thing! If you need more details, don't hesitate to reach out. Goodbye!",
        "Of course! We'll be here if you need any more information. Goodbye!",
        "Glad I could assist! If you have any more inquiries, feel free to ask. Goodbye!",
        "Alright! If you need anything else, don't hesitate to contact us. Goodbye!",
        "Take your time! If you have any questions later on, feel free to get in touch. Goodbye!",
        "Thank you! We look forward to hearing from you. Goodbye!",
        "You're welcome! If there's anything else we can assist you with, just let us know. Goodbye!"
      ],
      "context_set": ""
    },


    {
      "tag": "creator",
      "patterns": [
        "the name of your developers",
        "the name of your creators",
        "who created you",
        "your developers",
        "your creators",
        "developers",
        "you are made by",
        "you are made by whom",
        "who created you",
        "who create you",
        "creators",
        "who decided to make you",
        "who sat down to designed you",
        "Who initiated to built you?",
        "Who are the people that programmed you?",
        "Who is behind your development or developed you?",
        "Who took time to construct you?",
        "Tell me about your developers",
        "Tell me about your creators",
        "Give me information about your developers",
        "Give me information about your creators",
        "Who is behind your creation?",
        "Who are the minds behind your design?",
        "Who are the brains behind your development?",
        "Who brought you into existence?",
        "Who are the geniuses behind your invention?",
        "Who are responsible for your creation?"
      ],
      "responses": [
        "I'm TechChat, developed by a group of KNUST students from the department of Computer Engineering developed me, Frimpong Prince and Akinie Samuel Aterh"
      ],
      "context_set": ""
    },


    {
      "tag": "name",
      "patterns": [
        "name you are called by",
        "your name is what",
        "do you have a name i can use to call you",
        "what are you called by",
        "what is your name",
        "what should I call you",
        "whats your name?",
        "what are you are called by",
        "who are you by the way",
        "who is this i am chatting with",
        "what am i chatting to",
        "who am i talking to",
        "what are you, tell me your name",
        "what should I call this chatbot",
        "what's your title or your name",
        "what do you go by in terns of name",
        "so how should i call you?",
        "What name do you go by?",
        "How should I address you?",
        "What's the name you prefer?",
        "How can I refer to you?",
        "What's your preferred name?",
        "What do you like to be called?",
        "What name do you use?",
        "Can you tell me your name?",
        "What name should I use for you?",
        "What name do you respond to?",
        "How do you want to be called?",
        "What name can I use for you?",
        "What do you like to be called?",
        "What's your name or title?",
        "How should I name you?",
        "What's your identifying name?",
        "What name can I use when speaking to you?",
        "What's the name you go by?",
        "How do I address you?",
        "What do you call yourself?",
        "What name do you prefer?",
        "How should I refer to you?",
        "What's your calling name?",
        "What should I say when I want to talk to you?",
        "What's your official name?",
        "How should I introduce you?",
        "What's the name you use?",
        "What do you go by?",
        "What should I name you in conversation?"
      ],
      "responses": [
        "You can call me TechChat.",
        "I'm TechChat"
      ],
      "context_set": ""
    },


    {
      "tag": "University Hours/Operating Hours",
      "patterns": [
        "timing of university",
        "what is university timing",
        "working days",
        "when are you guys open",
        "what are your hours",
        "hours of operation",
        "when is the university open",
        "university timing",
        "what about university timing",
        "is university open on saturday",
        "tell something about university timing",
        "what is the university  hours",
        "university timing",
        "timing university",
        "What time does the university close",
        "what time will you close",
        "What are the university's operating hours?",
        "What time does the university open?",
        "When does the university start operating?",
        "What are the opening hours of the university?",
        "Is the university open on weekends?",
        "What are the daily hours of the university?",
        "Can you tell me the university's hours of operation?",
        "When is the university closed?",
        "Are there any specific hours for university offices?",
        "What time does the university close each day?",
        "How late is the university open?",
        "What time does the university close on weekdays?",
        "Are there different hours for different departments?",
        "When does the university stop operating?",
        "Does the university have extended hours?",
        "What are the operating hours for the campus?",
        "Are the hours the same for all university facilities?",
        "Does the university open early on certain days?",
        "What are the university's holiday hours?",
        "When can I visit the university?",
        "What is the latest time the university is open?",
        "Are there any changes to the university hours during exams?",
        "What are the hours for the administrative offices?",
        "Is the university open on public holidays?",
        "What time do the university facilities open?",
        "When does the campus close each day?",
        "Can you provide the university's schedule for operating hours?",
        "What are the hours for the university library?",
        "Are there specific hours for the student services?",
        "What are the working hours of the university?"
      ],
      "responses": [
        "Working Hours <ul> <li>Weekdays: Most administrative departments and offices are likely open from 8:00 AM to 5:00 PM GMT.</li> <li>Weekends: The university is likely closed on Saturdays and Sundays.</li> </ul>"
      ],
      "context_set": ""
    },


    {
      "tag": "Contact Information",
      "patterns": [
        "more info",
        "contact info",
        "how to contact university",
        "university telephone number",
        "university number",
        "What is your contact no",
        "Contact number?",
        "how to call you",
        "university phone no?",
        "how can i contact you",
        "Can i get your phone number",
        "how can i call you",
        "phone number",
        "phone no",
        "call",
        "how do i contact the university",
        "Where can I find the university's contact information?",
        "Do you have an email address for the university?",
        "How can I reach the university's administration?",
        "Is there a specific department I should contact for inquiries?",
        "Can I get in touch with someone from admissions?",
        "What are the contact details for student services?",
        "Is there a directory available for faculty and staff contacts?",
        "Do you have a fax number for the university?",
        "Are there alternative ways to contact the university besides phone?",
        "Can I schedule an appointment to visit the campus?",
        "Is there a preferred method of contact for urgent matters?",
        "How quickly can I expect a response to my inquiry?",
        "Please any number to call the admission team if you have a problem?"
      ],
      "responses": [
        "You can contact the Admissions Office at <ul> <li>Telephone: <a target=\"_blank\" href=\"tel:+233240130946\">+233240130946</a> OR <a target=\"_blank\" href=\"tel:+233500482807\">+233500482807</a> </li>  <li>Email: <a target=\"_blank\" href=\"mailto:admissions@knust.edu.gh\">admissions@knust.edu.gh</a> </li> </ul>"
      ],
      "context_set": ""
    },


    {
      "tag": "Tuition Fees",
      "patterns": [
        "information about fee",
        "information on fee",
        "tell me the fee",
        "university fee",
        "fee per semester",
        "what is the fee of each semester",
        "what is the fees of each year",
        "what is fee",
        "what is the fees",
        "how much is the fees",
        "fees for first year",
        "fees",
        "about the fees",
        "tell me something about the fees",
        "how much is the fees",
        "the parallel program and fee paying program, which is cheaper?",
        "Can we get the bill for the fees?",
        "What is the tuition cost per semester/year",
        "Are there additional fees besides tuition",
        "How can I pay my tuition fees",
        "Do you offer payment plans",
        "Full payment or partial for fees?",
        "what is the fee for engineering courses",
        "how much will i pay for tuition?",
        "what will happen when i don't pay my fees on time?",
        "Where can I find the latest academic schedules and updates?",
        "What should freshmen and continuing students do regarding payments and registrations?",
        "Can you provide information about the academic calendar and fees schedule?",
        "What are the terms for installment payments?",
        "Are there any special conditions for fee payment?",
        "Is there a grace period for fee payment?",
        "How can I confirm my fee payment?",
        "Are fee receipts provided after payment?",
        "What documents are required for fee payment?",
        "Can I pay my fees in cash?",
        "Can I reserve accommodation before paying my fees?",
        "Do I need to pay my fees to register for courses?",
        "Can I defer my admission due to financial constraints?",
        "What are the fee differences for local and international students?",
        "Do I need to pay fees every semester?",
        "What is the fee payment process for new students?",
        "Are there any discounts for early fee payment?",
        "Can I pay my fees after the semester starts?",
        "How do I get a fee payment receipt?",
        "What additional costs should I expect?",
        "How do I apply for a fee waiver?",
        "What is the process for paying fees in installments?",
        "Are there any incentives for prompt fee payment?",
        "How do I check my fee balance?",
        "Can I pay my fees in foreign currency?",
        "What is the exchange rate for fee payment?",
        "Are there any penalties for non-payment of fees?",
        "should i pay my fees in full before coming?",
        "What are the current tuition fees?",
        "Can you break down the tuition fees by program?",
        "Are there any additional costs besides the tuition fees?",
        "What are the tuition fees for international students?",
        "How much is the tuition for each program?",
        "What is the cost for a specific course?",
        "Are there any discounts on tuition fees?",
        "What is the fee structure for different courses?",
        "Can you provide a fee schedule for the upcoming academic year?",
        "How are the fees calculated for new students?",
        "What are the payment options for tuition fees?",
        "How much do students typically pay per semester?",
        "Are there any scholarships available to cover tuition fees?",
        "What is the process for paying the tuition fees?",
        "Do fees vary by academic department?",
        "Are there late fees for delayed tuition payments?",
        "Can I pay my tuition fees in installments?",
        "What are the deadlines for fee payments?",
        "Is there a refund policy for tuition fees?",
        "How can I get a detailed breakdown of my tuition fees?",
        "What are the consequences of not paying fees on time?",
        "Can fees be paid online or only in person?",
        "What is the policy on fee waivers?",
        "How do I check my current tuition balance?",
        "Are there any financial aid options for tuition fees?",
        "What is the difference between regular and fee-paying student fees?",
        "Can I use student loans to pay for tuition fees?",
        "Are there any additional fees for course materials or lab work?",
        "How do I confirm my tuition payment?",
        "What is the exchange rate for paying fees in foreign currency?",
        "What should I do if I have trouble paying my fees?",
        "How often do fees need to be paid during the academic year?"
      ],
      "responses": [
        "The fees for the 2024/2025 academic year at KNUST vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. All freshmen students are requested to visit the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full. Also visit the Fees Schedule page for fees updates. visit www.knust.edu.gh/academic-fees <br> Information on how to pay for the fees can be found in the fee schedule on the official KNUST website."
      ],
      "context_set": ""
    },


    {
      "tag": "Scholarships for Needy Students",
      "patterns": [
        "Do you offer scholarships",
        "What are the financial aid options",
        "How do I apply for financial aid",
        "Are there any grants available",
        "Are there any scholarships available for needy students at KNUST?",
        "Can you provide information about scholarships for brilliant but needy students at KNUST?",
        "Where can I find details about scholarships for needy students at KNUST?",
        "Do you offer any financial aid options for students from low-income backgrounds?",
        "Are there scholarships specifically for students with financial need?",
        "Can you provide details on need-based scholarships?",
        "I come from a disadvantaged background. Are there scholarships available for students like me?",
        "How can I apply for scholarships if I have financial constraints?",
        "Are there grants or bursaries available for students facing financial difficulties?",
        "Do you have any programs to support students with financial hardships?",
        "Can you direct me to resources for financial assistance for needy students?",
        "Are there specific criteria for eligibility for scholarships for needy students?",
        "Are scholarships renewable for students who maintain financial need throughout their studies?",
        "Is there a limit to the number of scholarships available for needy students?",
        "Can international students also apply for scholarships for students with financial need?",
        "What documents are required to apply for scholarships for needy students?",
        "Are there any community-based or external scholarships available for needy students?",
        "Can I get assistance with filling out scholarship applications?",
        "what are some of the scholarship offers in knust",
        "What types of scholarships are available for students with financial need?",
        "Can you provide a list of scholarships for students from low-income families?",
        "How do I find out about financial aid options for students in need?",
        "Are there any specific scholarships for first-generation college students?",
        "What is the process for applying for need-based scholarships?",
        "Are there any scholarships for students from underprivileged backgrounds?",
        "Can you tell me about any emergency financial aid available?",
        "How can I qualify for financial assistance at KNUST?",
        "What criteria do I need to meet for need-based scholarships?",
        "Are there scholarships available for part-time students with financial need?",
        "Can I apply for multiple scholarships simultaneously?",
        "How can I check if I am eligible for financial aid?",
        "What are the deadlines for applying for scholarships for needy students?",
        "Are there scholarships available for postgraduate students with financial need?",
        "Can you provide information on scholarships for students with special circumstances?",
        "Do you offer any awards or fellowships for needy students?",
        "Are there any scholarships for students pursuing specific fields of study?",
        "How can I increase my chances of receiving a scholarship?",
        "What are the requirements for maintaining a scholarship once awarded?",
        "Are there any scholarships that cover full tuition?",
        "Can you provide details on how to apply for external scholarships?",
        "Are there scholarships for students with disabilities?",
        "How do I find out about local scholarships for needy students?",
        "Are there any merit-based scholarships for students with financial need?",
        "What should I include in my scholarship application?",
        "Are there scholarships for students who are also working part-time?",
        "Can scholarships be applied for after the academic year starts?",
        "How do I get updates on available scholarships and financial aid?",
        "Are there any scholarships specifically for women or minority students?",
        "What is the procedure for renewing a scholarship?",
        "Can I use scholarships for study abroad programs?"
      ],
      "responses": [
        "Below are available Scholarships for brilliant but needy students to enable them pursue University Education. Edu Fondazione Scholarship, Hulede Foundation KNUST Scholarship, Educational Pathways International Scholarships. There are other grants and bursaries students can also benefit from. You can also benefits from other external scholarships. Please do well to read the requirements for each scholarship as they differ accordingly. Access the available scholarships for KNUST students www.knust.edu.gh/students/scholarships-and-grants"
      ],
      "context_set": ""
    },


    {
      "tag": "University Location/Address",
      "patterns": [
        "where is the university located",
        "KNUST is located at",
        "where is university",
        "where is university located",
        "address of university",
        "how to reach university",
        "university location",
        "university address",
        "wheres the university",
        "how can I reach university",
        "whats is the university address",
        "what is the address of university",
        "address",
        "location",
        "Can you provide the GPS coordinates for the university?",
        "where can i locate the school",
        "where is knust located ?",
        "what is the post address for knust",
        "What is the physical address of KNUST?",
        "How do I find KNUST on a map?",
        "Can you give me the location details for KNUST?",
        "What is the postal address for KNUST?",
        "Where exactly is KNUST situated?",
        "How can I navigate to KNUST?",
        "What are the coordinates for KNUST?",
        "Can you show me the location of KNUST?",
        "Where is the campus of KNUST?",
        "What's the street address of KNUST?",
        "How do I get to KNUST?",
        "What is KNUST's location in Kumasi?",
        "Give me the directions to KNUST.",
        "What's the nearest landmark to KNUST?",
        "How can I get the GPS location for KNUST?",
        "What is KNUST's physical address in Kumasi?",
        "Where is the main entrance of KNUST?",
        "What is the full address of KNUST?",
        "How do I reach the KNUST campus?",
        "Where can I find KNUST on the map?"
      ],
      "responses": [
        "KNUST is located in Kumasi, Ghana, which is the Ashanti Region's capital <ul> <li> Google map https://maps.app.goo.gl/FiengdzdZqxpAsbSA </li>  <li>Ghana Post GPS Address: AK-385-1973</li>  </ul>"
      ],
      "context_set": ""
    },


    {
      "tag": "Available Colleges/Departments",
      "patterns": [
        "List of colleges",
        "What are the colleges?",
        "Which colleges are available?",
        "Colleges list",
        "Available colleges",
        "Colleges options",
        "Colleges available for application",
        "What colleges are there?",
        "Colleges selection",
        "What colleges can I choose from?",
        "Colleges choices",
        "Colleges for application",
        "Colleges to select",
        "Colleges decision",
        "What colleges can I study at?",
        "What are the departments at KNUST?",
        "Which colleges are part of KNUST?",
        "Can you list the colleges at KNUST?",
        "What are the different colleges available?",
        "Tell me about the colleges at KNUST.",
        "What colleges can I apply to?",
        "What colleges does KNUST offer?",
        "What departments can I choose from?",
        "Give me the list of departments at KNUST.",
        "What are the available faculties at KNUST?",
        "How many colleges does KNUST have?",
        "Which faculties can I join at KNUST?",
        "What colleges are included in KNUST?",
        "What are the different faculties available?",
        "List all the available colleges.",
        "What departments are available for students?",
        "Which colleges are open for application?",
        "What are the academic departments at KNUST?",
        "What colleges does the university have?",
        "What academic programs are offered?",
        "Can you provide the names of the colleges?",
        "What are the college options at KNUST?",
        "What are the choices for colleges?",
        "What are the college options for admission?",
        "How many departments are there at KNUST?",
        "What colleges can I enroll in?",
        "What academic divisions does KNUST have?",
        "List the departments available at KNUST.",
        "What are the departments at the university?",
        "Which colleges are available for prospective students?"
      ],
      "responses": [
        "<ul><li>College of Agriculture and Natural Resources</li><li>College of Art and Built Environment</li><li>College of Engineering</li><li>College of Health Sciences</li><li>College of Humanities and Social Sciences</li><li>College of Science</li></ul>"
      ],
      "context_set": ""
    },
    

    {
      "tag": "accommodation",
      "patterns": [
        "hostel facility",
        "hostel service",
        "hostel location",
        "hostel address",
        "hostel facilities",
        "hostel fees",
        "Does university provide hostel",
        "Is there any hostel",
        "Where is hostel",
        "do you have hostel",
        "do you guys have hostel",
        "hostel",
        "hostel capacity",
        "what is the hostel fee",
        "how to get in hostel",
        "what is the hostel address",
        "how far is hostel from university",
        "hostel university distance",
        "where is the hostel",
        "how big is the hostel",
        "distance between university and hostel",
        "distance between hostel and university",
        "Is there accommodation available?",
        "Is housing provided for students?",
        "Can I stay in a hostel?",
        "Are there dormitories available?",
        "What are the lodging options?",
        "Are there residential facilities?",
        "Are there rooms for students?",
        "What is the housing situation?",
        "Where can I find accommodation?",
        "What is the cost of accommodation?",
        "Are there on-campus residences?",
        "What type of accommodation is available?",
        "Can I live on campus?",
        "How do I apply for housing?",
        "Do you offer dormitory services?",
        "Are there housing options nearby?",
        "halls",
        "halls of residence",
        "residential halls",
        "residence halls",
        "accommodation halls",
        "student halls",
        "living halls",
        "dorms",
        "student dorms",
        "residence dorms",
        "university dorms",
        "college dorms",
        "student housing",
        "How many Halls are in KNUST?",
        "Where can I find private hostel accommodation near KNUST?",
        "What are the options for private accommodation in Kumasi?",
        "Can you provide information about off-campus housing near KNUST?",
        "what are some of the hostels off campus",
        "what are some of the hostels outside campus",
        "What are the accommodation options available at KNUST?",
        "Can you provide information about housing options at KNUST?",
        "Where can I stay while studying at KNUST?",
        "What are the facilities like",
        "What are the accommodation options at KNUST?",
        "Can you tell me about living on campus at KNUST?",
        "What are the residential facilities like at KNUST?",
        "Can you provide details about hostel facilities?",
        "What are the available student accommodation options?",
        "Where can I find dormitory information?",
        "Are there any on-campus housing options?",
        "How do I apply for accommodation?",
        "What are the different types of accommodation available?",
        "Can I choose my hostel or dorm?",
        "Are there any private accommodation options nearby?",
        "What is the process for booking accommodation?",
        "Are there any special accommodations for students with disabilities?",
        "What are the living conditions like in the hostels?",
        "How do I reserve a place in a hostel?",
        "What is the distance between the hostels and academic buildings?",
        "Are there any hostels with specific amenities?",
        "Can I get a single room in the hostel?",
        "How do I find out about availability in the hostels?",
        "What are the options for accommodation for international students?",
        "Do you offer any accommodation for postgraduate students?",
        "How do I know if I got a place in the hostel?",
        "What are the rules for staying in the university hostels?",
        "Are there any hostels with meal plans?",
        "What is the average cost of living in the university hostels?",
        "How are the hostels allocated to students?",
        "Are there any hostels that offer short-term stays?",
        "Can I visit the hostels before making a decision?",
        "What are the common facilities in the university hostels?",
        "Are there any hostels with internet access?",
        "Can I bring guests to the hostels?",
        "What is the application deadline for hostel accommodation?",
        "Are there any hostels with laundry facilities?",
        "What are the options for off-campus housing?"
      ],
      "responses": [
        "There are Six Halls of residence and a number of hostels on the University Campus. They are Queen Elizabeth II Hall, Unity Hall, Independence Hall, Republic Hall, University Hall, and Africa Hall. All the Six Halls of residence are mixed (Male and Female). Here are some recommended hostels around KNUST campus: <br> <ul><li> Providence Hostel </li><li> Westend Hostel </li><li>Wagyingo Hostel </li><li> Hydes Hostel </li><li> Amen Hostel (Main, Annex, Inn) </li><li> Canam Hostel </li><li> Canam Hall </li><li> Franco Hostel (Main & Annex) </li><li> Franco Hostel New </li><li> Frontline Apartment </li><li>Frontline Inn  </li><li> Frontline Court </li><li> Amanda Hostel </li><li> Long Island Hostel </li><li> Johannes Hostel </li><li> White House Hostel </li><li> Ultimate Hostel </li><li>Standard Hostel </li><li> Rising Sun Hostel </li><li> Nyame Mireku Hostel </li><li> Anarosa Hostel </li><li> De-Lisa Hostel (Main & Annex) </li><li> Casa Marie Hostel </li><li> Adom Bi Hostel </li><li> High Achievers Hostel </li><li> Happy Family Hostel </li><li> Flint Xclusive </li><li> Prestige Hostel </li><li> Jalex Hostel </li><li> Jecado Hostel </li><li> Mass Hostel </li><li> Morning Star Palace </li><li> Nana Adomah Hostel</li><li> No Weapon Hostel (Main & Annex) </li><li> Orange Hostel </li><li> Whitpam </li><li> P3 Hostel </li><li> R & B Hostel </li><li> Shalom Kibutz Hostel </li><li> Shepherds Ville Hostel </li><li> Wilkado Hostel </li></ul> <br><br><ul> <li> www.knust.edu.gh/students/housing </li>  <li> www.knust.edu.gh/index.php/students/recommended-hostels-20202021-academic-year</li> </ul><br> To find the cost of accommodation, do well to check the fee schedule for the price of traditional halls. For hostels, do well to visit their website or contact them for the current prices."
      ],
      "context_set": ""
    },
    

    {
      "tag": "random",
      "patterns": [
        "I love you",
        "Will you marry me",
        "Do you love me",
        "Are you in love with me?",
        "Will you be my girlfriend?",
        "Can we go on a date?",
        "Do you have feelings for me?",
        "Are we meant to be together?",
        "Do you dream of me?",
        "I have a crush on you",
        "I am crushing on you",
        "Do you believe in love?",
        "Are you my soulmate?",
        "Can we be more than friends?",
        "Are you single?",
        "I want to be with you",
        "Do you think about me?",
        "Can you love me?",
        "do you have a girl friend",
        "i want a wife",
        "i want to commit suicide now , can you help me",
        "What's your favorite color?",
        "Do you have any hobbies?",
        "What do you like to do in your free time?",
        "What is your favorite movie?",
        "Do you have a favorite song?",
        "What kind of books do you like?",
        "What's your favorite food?",
        "Do you have any pets?",
        "What are your interests?",
        "Can you tell me a joke?",
        "What's your favorite TV show?",
        "Do you play any sports?",
        "What's your favorite place to visit?",
        "Do you have a favorite season?",
        "What kind of music do you listen to?",
        "What's the best place you've ever been?",
        "Do you like traveling?",
        "What's your dream job?",
        "Do you have any favorite quotes?",
        "What's your idea of a perfect day?",
        "Do you like cooking?",
        "What's your favorite holiday?",
        "Do you enjoy reading?",
        "What's the best advice you've ever received?",
        "What's something you're passionate about?",
        "Do you have any hidden talents?",
        "What's your favorite hobby?",
        "What's one thing you can't live without?",
        "Do you like to watch movies or TV shows?",
        "What's your favorite way to relax?",
        "What's your favorite type of cuisine?"
      ],
      "responses": [
        "I am not program for this, please ask appropriate query"
      ],
      "context_set": ""
    },


    {
      "tag": "Profanity/Inappropriate Language",
      "patterns": [
        "fuck",
        "fuck you okay bastard",
        "bitch ass nigga",
        "shut the fuck up",
        "hell fucker damn",
        "stupid you are",
        "idiot dick cock",
        "dumb ass cunt pussy",
        "asshole crap fucker",
        "bloody hell",
        "you are very stupid",
        "foolish boy",
        "you are fool !",
        "foolish ai",
        "fool like you",
        "you are lying , you fool"
      ],
      "responses": [
        "Please use appropriate language",
        "Maintaining decency would be appreciated"
      ],
      "context_set": ""
    },


    {
      "tag": "Positive Feedback/Appreciation",
      "patterns": [
        "okk",
        "okie",
        "nice work",
        "well done",
        "good job",
        "thanks for the help",
        "Thank You",
        "its ok",
        "Thanks",
        "Good work",
        "k",
        "ok",
        "okay",
        "i like you",
        "I appreciate your assistance!",
        "You've been very helpful, thank you!",
        "Great job, I'm impressed!",
        "Thanks a bunch for your support!",
        "You've done an excellent job!",
        "I'm grateful for your guidance!",
        "Thanks a million for your help!",
        "I'm thankful for your time and effort!",
        "You're awesome, thanks!",
        "I'm grateful for the information provided!",
        "Your assistance has been invaluable, thank you!",
        "I'm glad I reached out, your help is appreciated!",
        "You're a lifesaver, thank you!",
        "I couldn't have done it without you, thanks!",
        "Thank you for going above and beyond!",
        "I'm truly thankful for your support!",
        "You're a star, thank you so much!",
        "Thanks for being so responsive and helpful!",
        "You've made my day, thank you!",
        "I'm really grateful for your assistance!",
        "Thank you for your prompt and efficient help!",
        "You rock, thanks for everything!",
        "I owe you one, thanks!",
        "Your assistance means a lot to me, thank you!"
      ],
      "responses": [
        "I am glad I helped you",
        "welcome, anything else I can assist you with?"
      ],
      "context_set": ""
    },


    {
      "tag": "Chatbot Capabilities",
      "patterns": [
        "what can you do",
        "Can I ask a question?",
        "I need help",
        "I'm interested in applying",
        "what are the thing you can do",
        "things you can do",
        "what can u do for me",
        "how u can help me",
        "why i should use you",
        "What are your features?",
        "How can you assist me?",
        "What tasks can you help with?",
        "What services do you offer?",
        "What functionalities do you have?",
        "Can you list your capabilities?",
        "How do you support users?",
        "What are your strengths?",
        "What tasks are you designed to handle?",
        "How can you make my life easier?",
        "Why should I interact with you?",
        "What makes you different from other chatbots?",
        "Can you demonstrate your skills?",
        "How do you add value to users?",
        "Are there any limitations to what you can do?",
        "Can you solve specific types of problems?",
        "What kind of assistance do you provide?",
        "Do you have any special features?",
        "Can you assist with complex queries?",
        "What are your areas of expertise?",
        "How do you respond to user queries?",
        "Can you provide personalized assistance?",
        "Do you have any unique functionalities?",
        "who is the dean of student?",
        "i want some info",
        "How can you help me with university information?",
        "What kind of queries can you handle?",
        "Can you provide details about university programs?",
        "What assistance can you offer for admissions?",
        "How can you assist with application processes?",
        "Can you help with understanding university policies?",
        "What kind of support do you offer for prospective students?",
        "Can you help me find information on courses?",
        "How can you assist with scholarship inquiries?",
        "Can you provide updates on application deadlines?",
        "What services can you offer regarding student life?",
        "How can you assist with fee-related questions?",
        "Can you help me navigate the university website?",
        "What kind of help can you provide for campus tours?",
        "Can you offer guidance on choosing a program?",
        "How do you assist with accommodation information?",
        "Can you help with understanding admission requirements?",
        "What resources can you provide for new students?",
        "Can you help me with program-specific queries?",
        "How do you support students with special needs?",
        "Can you assist with finding contact information for departments?",
        "What kind of information can you provide about student services?",
        "Can you help with understanding application forms?",
        "How do you handle multiple queries at once?",
        "Can you provide guidance on university events?",
        "What are your capabilities in handling student inquiries?",
        "Can you help with understanding university fees and payments?",
        "How do you assist with program selection?",
        "Can you provide information on student organizations?",
        "What are the benefits of using this chatbot?",
        "How can you support me throughout the admission process?"
      ],
      "responses": [
        "You can ask me questions regarding KNUST undergraduate admissions and I will try to answer them"
      ],
      "context_set": ""
    },


    {
      "tag": "Application Deadline",
      "patterns": [
        "Can I continue my application online after the deadline?",
        "Is it possible to apply online after the deadline has passed?",
        "What should I do if I miss the application deadline but still want to apply online?",
        "If I didn't submit my application before the deadline, can I still apply online?",
        "What are the options for late applications?",
        "Is there a grace period for submitting applications after the deadline?",
        "Can I request an extension for the application deadline?",
        "Are there any penalties for submitting my application late?",
        "How do I apply for an extension if I can't meet the deadline?",
        "Is there a late application fee if I miss the deadline?",
        "Are late applications considered on a case-by-case basis?",
        "Can I provide a valid reason for submitting my application late?",
        "Is there a specific procedure for late applicants?",
        "Are there any exceptions to the application deadline?",
        "Can I still apply if I have missed the regular deadline?",
        "Are there any restrictions or limitations for late applicants?",
        "What is the latest date I can submit my application?",
        "Is there a cutoff date for accepting late applications?",
        "How do I know if my late application will be considered?",
        "Are late applicants given the same consideration as those who apply on time?",
        "What factors are taken into account when considering late applications?",
        "Can I apply online even if I missed the deadline for paper applications?",
        "Are there any alternative application methods available for late applicants?",
        "Is there a waiting list for late applicants?",
        "What are the chances of acceptance for late applicants?",
        "Are there any special conditions for late admissions?",
        "Please is it true that admission is still on going till ending of the month",
        "what is the deadline for the admission?",
        "Can I apply after the deadline if I bought the form on time?",
        "What happens if I start my application before the deadline but submit it late?",
        "Can late applications be accepted if I have a valid reason?",
        "Is there any flexibility with the application deadline?",
        "How can I request an application deadline extension?",
        "What are the options if I miss the application deadline?",
        "Is there a penalty for late application submission?",
        "Can I still apply if the deadline has passed?",
        "Is it possible to apply online after the official deadline?",
        "Can I apply after the deadline if I explain my situation?",
        "Is there a grace period for late applications?",
        "How strict is the application deadline?",
        "Are there any allowances for late application submissions?",
        "Can I still apply if I miss the deadline by a few days?",
        "Is there an option to appeal for a late application?",
        "Can I finish my application online if I started before the deadline?",
        "Are late applications accepted with a fee?",
        "Can I submit my application after the deadline has passed?",
        "Is there a procedure for submitting late applications?",
        "Can I still complete my application online after the deadline?",
        "Are there exceptions to the application deadline policy?",
        "What should I do if I miss the application deadline?",
        "Can I apply late if I have extenuating circumstances?",
        "Is there a way to submit my application after the deadline?",
        "What is the process for applying late?",
        "Are late applications reviewed differently?",
        "Can I finish my application if I bought the form before the deadline?",
        "Can I request a deadline extension for my application?",
        "Is there a final cutoff for late applications?",
        "Can I still be considered if I submit my application late?",
        "what is the deadline for application?",
        "when will the application end?",
        "What is the final date to submit my application?",
        "Can I still apply if I missed the initial deadline?",
        "Is there an extended deadline for applications?",
        "Can I get an extension for the application deadline if I have a valid reason?",
        "What are the consequences of missing the application deadline?",
        "How can I submit my application if I miss the deadline?",
        "Can I apply for the next intake if I missed the current deadline?",
        "Are there any special provisions for late submissions?",
        "Can I get a second chance if I miss the application deadline?",
        "How do I handle a missed application deadline?",
        "Is there a possibility for late application acceptance?",
        "Are there any additional requirements for late applications?",
        "How strict is the application deadline policy?",
        "What is the process for requesting an application extension?",
        "Can I still apply if I missed the deadline by a week?",
        "Is it possible to apply late if I have a compelling reason?",
        "What is the procedure for handling late applications?",
        "Can late applications be reviewed if submitted with a valid reason?",
        "How do late applications impact my chances of admission?",
        "Are there any special deadlines for different programs?",
        "What should I do if I missed the application deadline but still want to apply?",
        "Is there an option for late registration if I missed the application deadline?",
        "Can I apply after the deadline if I have already started my application?",
        "Are there any deadlines for submitting required documents after the application?",
        "Can I request an extension to complete my application if I started on time?",
        "How late can applications be accepted before they are automatically rejected?",
        "Is there a late fee for applications submitted after the deadline?",
        "Are there any exceptions for late application due to unforeseen circumstances?",
        "What is the latest time I can submit my application on the deadline day?",
        "Can I still apply for financial aid if I miss the application deadline?",
        "How do I check if my late application will be considered?",
        "Can I receive assistance if I am struggling to meet the application deadline?",
        "What is the latest date to submit supporting documents if I missed the initial deadline?",
        "Are there any benefits to applying early compared to late applications?",
        "Can I follow up on a late application status if it was submitted after the deadline?",
        "What factors are considered when reviewing late applications?",
        "Can I apply for admissions after the official deadline for special cases?",
        "Are late applications prioritized differently in the review process?",
        "what is the deadline for submitting applications to knust?"
      ],
      "responses": [
        "Undergraduate application deadline is October 31, 2024, but you can continue your application online after the deadline, but only if you purchased the form before the deadline."
      ],
      "context_set": ""
    },
    
    
    {
      "tag": "Application Review Assistance",
      "patterns": [
        "What do I do when I am unable to progress past the application review stage?",
        "I'm stuck at the application review stage, what should I do?",
        "How can I move forward from the application review stage?",
        "I cannot progress in my application after the review stage, what's the next step?",
        "What are the common reasons for being stuck at the application review stage?",
        "Can you provide guidance on overcoming obstacles during the application review?",
        "Is there a support system available for applicants experiencing issues during the review stage?",
        "What steps should I take if my application is held up during review?",
        "Are there resources or materials to help applicants navigate the application review process?",
        "How long does the application review process typically take?",
        "Can I request feedback on my application after the review stage?",
        "Are there specific criteria used during the application review?",
        "Who should I contact if I encounter difficulties during the application review?",
        "Is there a deadline for resolving issues encountered during the application review?",
        "What documentation or information is required to address issues during the review stage?",
        "Are there any additional steps I can take to improve my application during review?",
        "Can I provide additional information or updates to my application after submission but before review?",
        "Is there an appeals process available for applicants dissatisfied with the review outcome?",
        "What are the possible outcomes of the application review stage?",
        "Can I track the progress of my application during the review stage?",
        "Are there any specific actions I should avoid while my application is under review?",
        "Is there someone who can provide personalized assistance with my application review?",
        "How can I resolve issues if my application is pending review?",
        "What should I do if there is a problem with my application review?",
        "How can I expedite the application review process?",
        "Who can I contact for assistance if my application review is delayed?",
        "What actions can I take if my application review is taking longer than expected?",
        "How do I handle feedback received during the application review stage?",
        "Is there a way to check if my application review is progressing?",
        "What are the common pitfalls during the application review process?",
        "How do I ensure my application review is completed successfully?",
        "What should I do if I receive a request for additional information during review?",
        "Are there any troubleshooting tips for issues during the application review?",
        "How can I confirm if my application review has been completed?",
        "What should I include in a follow-up if my application review is stalled?",
        "Can I make changes to my application after it has been submitted for review?",
        "What is the best way to handle an unexpected delay in the application review?",
        "How do I respond to queries from the review team about my application?",
        "Is there a process for re-evaluating an application if issues arise during review?",
        "How do I address any errors or discrepancies found during the review process?",
        "What resources are available to help me navigate application review challenges?",
        "How can I stay informed about the status of my application review?"
      ],
      "responses": [
        "Please review your application and fill in the mandatory fields that are not filled in"
      ],
      "context_set": ""
    },


    {
      "tag": "Post-Admission Procedures (Undergraduate)",
      "patterns": [
        "What do I do when I get to know I have been admitted (undergraduate)?",
        "I've received admission as an undergraduate, what are the next steps?",
        "After being admitted as an undergraduate, what should I do?",
        "What are the procedures after receiving undergraduate admission?",
        "Can you provide a checklist of tasks after undergraduate admission?",
        "What documentation do I need to submit after receiving undergraduate admission?",
        "Are there deadlines for completing post-admission procedures as an undergraduate?",
        "How do I confirm my acceptance of undergraduate admission?",
        "Can I defer my admission as an undergraduate student?",
        "Is there a housing application process for undergraduate students after admission?",
        "What academic advising or registration steps should I follow after undergraduate admission?",
        "What opportunities are available for undergraduate students to get involved in campus life?",
        "What should I do after getting my undergraduate admission letter?",
        "Can you guide me through the steps to finalize my undergraduate admission?",
        "How do I complete my enrollment after being admitted?",
        "What are the key actions to take after receiving my admission offer?",
        "Is there an orientation program for new undergraduate students?",
        "How do I accept my undergraduate admission offer?",
        "What paperwork is required after undergraduate admission?",
        "Are there any mandatory forms I need to fill out post-admission?",
        "What is the procedure for securing my place in the undergraduate program?",
        "When should I pay my admission deposit or fees?",
        "How do I apply for on-campus housing after admission?",
        "Are there any pre-semester requirements I need to complete?",
        "What are the deadlines for submitting post-admission documents?",
        "How can I get my student ID after admission?",
        "Is there a welcome packet or guide for new undergraduates?",
        "Where can I find information about course registration after admission?",
        "How do I schedule an appointment with an academic advisor?",
        "What steps should I take to register for orientation?",
        "How do I access student services and resources after admission?",
        "What are the steps to finalize my enrollment for the upcoming semester?",
        "How do I get involved in campus activities as a new undergraduate?",
        "What health and immunization records are needed post-admission?",
        "Where can I find information on textbook purchases or rentals?",
        "How do I set up my university email and online accounts?",
        "Are there any specific deadlines for housing and meal plan applications?",
        "What are the procedures for obtaining parking permits or campus transportation?",
        "How do I find out about campus events and student organizations?",
        "What financial aid paperwork needs to be completed after admission?",
        "How can I connect with other new students before classes start?",
        "Are there any additional fees or charges I should be aware of?",
        "How do I confirm my participation in any required introductory programs?"
      ],
      "responses": [
        "<ul><li>Visit the admissions portal https://apps.knust.edu.gh/admissions/ </li><li>Click on login or click </li><li>Enter your application serial and PIN and click on Log in</li><li>Click on Check Status </li><li>Confirm your admission and print it out</li><li>Print your acceptance form and your fee schedule www.knust.edu.gh/academic-fees </li><li>Pay your fees</li><li>Book your accommodation https://accommodation.knust.edu.gh/ </li><li>Login to your student portal or download the AIM app from the Apple App store and Google Play store </li><li>Click on Course Registration in the portal and proceed to register your courses for the semester</li><li>Visit the UITS Support Center at the Basement of the Casely-Hayford Building for further assistance</li></ul>"
      ],
      "context_set": ""
    },


    {
      "tag": "Admission Portal Information",
      "patterns": [
        "What is the address for the KNUST admission portal?",
        "Where can I find the KNUST admission portal?",
        "What's the URL for the KNUST admission portal?",
        "Can you provide the web address for the KNUST admission portal?",
        "How do I access the KNUST admission portal?",
        "Is there a specific login page for the KNUST admission portal?",
        "Can I create an account on the KNUST admission portal?",
        "Can I check my application status on the KNUST admission portal?",
        "How do I navigate through the KNUST admission portal?",
        "Is the KNUST admission portal accessible to international students?",
        "Can I reset my password on the KNUST admission portal?",
        "Is there a help desk or support team for issues related to the KNUST admission portal?",
        "Is the KNUST admission portal available 24/7?",
        "Can I access the KNUST admission portal from my smartphone or tablet?",
        "Where can I log in to the KNUST admission portal?",
        "What is the link to the KNUST admission portal?",
        "How can I access my KNUST admission account?",
        "What website should I visit for KNUST admissions?",
        "Can you provide the URL for checking my KNUST application status?",
        "How do I get to the KNUST admission portal homepage?",
        "Is there an official site for KNUST admission applications?",
        "How can I manage my application through the KNUST portal?",
        "Can I view my admission letter on the KNUST portal?",
        "How do I navigate the KNUST admission website?",
        "What is the login URL for KNUST admissions?",
        "Can I apply online through the KNUST admission portal?",
        "How do I find my application details on the KNUST portal?",
        "Is there a direct link to the KNUST admission portal login page?",
        "How do I check for updates on my KNUST application?",
        "Can I track my application progress on the KNUST portal?",
        "What features are available on the KNUST admission portal?",
        "How do I update my personal information on the KNUST portal?",
        "What should I do if I encounter problems accessing the KNUST portal?",
        "Is there a KNUST admission portal user guide or FAQ?",
        "How do I recover my login information for the KNUST admission portal?",
        "Can I view admission requirements on the KNUST portal?",
        "Is there an option to save my progress on the KNUST admission portal?",
        "Can I submit additional documents through the KNUST portal?",
        "How do I confirm my application submission on the KNUST portal?",
        "What should I do if I receive an error message on the KNUST portal?",
        "Are there tutorials available for using the KNUST admission portal?",
        "How can I contact support for the KNUST admission portal?",
        "Can I access the KNUST admission portal from outside Ghana?",
        "What should I do if my account is locked on the KNUST portal?",
        "How do I check the deadlines for applications on the KNUST portal?"
      ],
      "responses": [
        "You can access the KNUST admission portal https://apps.knust.edu.gh/admissions/"
      ],
      "context_set": ""
    },


    {
      "tag": "international student",
      "patterns": [
        "Do you accept international students",
        "Are international students welcome?",
        "Can I apply as an international student?",
        "Do you have programs for international students?",
        "What are the requirements for international students?",
        "Is there support for international students?",
        "Can international students get scholarships?",
        "What is the application process for international students?",
        "Are there services for international students?",
        "Do you offer assistance to international students?",
        "Do international students need a specific visa?",
        "What is the process for international students to apply?",
        "Are there specific deadlines for international student applications?",
        "How can international students get in touch with the admissions office?",
        "What documents are required for international students applying to KNUST?",
        "Are there any language proficiency requirements for international students?",
        "What kind of support does KNUST offer to international students?",
        "How can international students find housing?",
        "Are there orientation programs for international students?",
        "Can international students work while studying?",
        "What health insurance options are available for international students?",
        "Do international students need to have a medical check-up before arrival?",
        "What are the tuition fees for international students?",
        "How can international students apply for financial aid?",
        "Are there any special scholarships for international students?",
        "How do international students get their visa?",
        "What is the cost of living for international students in Kumasi?",
        "Can international students join student organizations or clubs?",
        "What is the process for transferring credits as an international student?",
        "How do international students find academic advisors?",
        "Are there any special events or activities for international students?",
        "Can international students use the university's library and facilities?",
        "What are the safety measures for international students on campus?",
        "How can international students get involved in research opportunities?",
        "What kind of accommodation options are available for international students?",
        "Are there any cultural adjustment resources for international students?",
        "Can international students apply for on-campus jobs?",
        "How can international students improve their English language skills?",
        "Are there any support services for international students with disabilities?",
        "What is the application fee for international students?",
        "How do international students apply for a student visa?",
        "Are there any language support programs for international students?",
        "What are the living arrangements for international students?",
        "How do international students register for classes?",
        "What are the student support services available for international students?",
        "Can international students get a part-time job on campus?",
        "Are there any specific health services for international students?",
        "What are the admission requirements for international graduate students?",
        "How can international students stay connected with their families while studying?",
        "What resources are available for international students to adapt to local culture?",
        "Are there any pre-arrival preparations needed for international students?",
        "How do international students handle banking and financial transactions?",
        "Are there any mentorship programs for international students?",
        "What is the process for international students to register for courses?",
        "Can international students access mental health services?",
        "How can international students participate in sports or recreational activities?",
        "What is the deadline for international students to submit their applications?",
        "Are there any additional fees for international students?",
        "How do international students get updates on their application status?",
        "What is the process for international students to obtain accommodation?",
        "Are there any language requirements for admission?",
        "Can international students bring their families with them?",
        "What are the procedures for international students to obtain a residence permit?",
        "How can international students find internships or job opportunities?",
        "Are there any additional requirements for international students from specific countries?",
        "What kind of academic support is available to international students?",
        "Can international students access career services?",
        "How do international students get health coverage while studying?",
        "Are there any student exchange programs available for international students?",
        "How can international students get help with their application?",
        "What should international students know before arriving at KNUST?",
        "How can international students connect with other students from their home country?",
        "Are there any special guidelines for international students regarding academic performance?",
        "Can international students receive assistance with their visa application process?",
        "What are the transportation options for international students?",
        "Are there any social or cultural clubs for international students?",
        "How can international students get academic help if needed?",
        "What are the options for international students who need extra academic support?",
        "Can international students access on-campus resources and services?",
        "What are the requirements for international students to maintain their visa status?",
        "How do international students adjust to academic life at KNUST?",
        "What are the financial planning resources available for international students?",
        "Can international students access counseling and mental health services?",
        "What steps should international students take to prepare for their arrival?",
        "How do international students find out about local events and activities?"
      ],
      "responses": [
        "Yes, we do accept international students! We welcome applicants from around the globe and offer a range of programmes and support services tailored to meet their needs. Our admissions team is here to help you through the application process, and we offer various resources, including scholarships, to ensure your success. For more detailed information, please visit our international students' page or contact our admissions office. International undergraduate applicant can generate their pin on the admissions and portal. Please check the official KNUST website for the current price for the forms.<br> Please read and understand the requirements for the particular programme of your choice and make sure to meet those requirement.<br> Please ensure that your type of examination results are the ones accepted by KNUST"
      ],
      "context_set": ""
    },


    {
      "tag": "Application Form Fees for Foreign Students",
      "patterns": [
        "What is the cost of application forms for Foreign students?",
        "How much does it cost for foreign students to get application forms?",
        "What is the fee for application forms for international students?",
        "Can you tell me the price of application forms for foreign students?",
        "Are there different fees for different programs for foreign students?",
        "Is the application fee for foreign students refundable?",
        "Are there any discounts or waivers available for foreign students on application fees?",
        "Can I pay the application fee for foreign students online?",
        "What payment methods are accepted for the application fee for foreign students?",
        "Is the application fee for foreign students the same for all programs?",
        "Can I pay the application fee for foreign students in my local currency?",
        "How do I obtain a receipt for paying the application fee for foreign students?",
        "What are the payment options for application forms for foreign students?",
        "How can foreign students pay their application fees?",
        "What is the application fee structure for international students?",
        "Are there any additional fees for foreign students applying?",
        "Can foreign students get a fee waiver for the application forms?",
        "How do foreign students submit their application fees?",
        "What is the deadline for paying the application fee for foreign students?",
        "Is there a late fee for foreign students if the application fee is paid after the deadline?",
        "Where can foreign students find information about application fees?",
        "Are application fees for foreign students different based on their country of origin?",
        "What is the process for foreign students to get a refund of the application fee?",
        "Can foreign students pay the application fee in installments?",
        "Is there a specific bank account for paying application fees for foreign students?",
        "How can foreign students get a confirmation of their fee payment?",
        "Are there any special instructions for paying application fees from abroad?",
        "What documents are required to pay the application fee for foreign students?",
        "Can foreign students use international credit cards to pay the application fee?",
        "Are there any online payment platforms recommended for foreign students to pay the fee?",
        "What is the fee for application forms for graduate programs for foreign students?",
        "How do foreign students verify their fee payment?",
        "Can foreign students pay their application fee through bank transfer?",
        "Are there any penalties for late payment of application fees for foreign students?",
        "What happens if a foreign student fails to pay the application fee?",
        "Can foreign students get a receipt for application fee payment through email?",
        "What is the application fee refund policy for foreign students?",
        "How can foreign students check the status of their application fee payment?",
        "What is the application fee for international students applying for undergraduate programs?",
        "Are there any special payment instructions for foreign students from specific regions?",
        "How do foreign students inquire about application fee issues?",
        "Can foreign students use a money transfer service to pay the application fee?",
        "Are there any discounts available for early payment of application fees for foreign students?",
        "What currency should the application fee for foreign students be paid in?",
        "Can foreign students contact the admissions office for fee-related questions?",
        "Is there a guide available for paying application fees for foreign students?",
        "What steps should foreign students follow to ensure their application fee is paid correctly?",
        "How do foreign students receive confirmation of their fee payment?",
        "Are there any additional charges for international transactions for application fees?",
        "Can foreign students pay their application fees through wire transfer?",
        "What are the consequences of missing the application fee payment deadline for foreign students?",
        "Can foreign students pay their application fees via an online payment gateway?",
        "What should foreign students do if they face issues while paying the application fee?",
        "Are there specific instructions for foreign students paying fees from their home country?",
        "How can foreign students get assistance with application fee payments?",
        "Can foreign students receive an invoice for the application fee payment?",
        "What is the procedure for foreign students to follow if they need a refund of the application fee?",
        "Are there any special provisions for foreign students in terms of application fee payment?",
        "Can foreign students pay their application fees in multiple currencies?",
        "How do foreign students handle discrepancies in application fee payments?",
        "Is there a specific contact person for fee-related queries for foreign students?",
        "Can foreign students get help with understanding application fee requirements?"
      ],
      "responses": [
        "Kindly refer to the admission guidelines www.knust.edu.gh/admissions/prospective/applying"
      ],
      "context_set": ""
    },


    {
      "tag": "Post-Application Form Printing Procedures",
      "patterns": [
        "What should I do with the online print-out I get when I click the submit button on the system?",
        "After getting the online print-out, what is the next step?",
        "I've printed out the online form, what should I do with it?",
        "What is the procedure after printing out the online form?",
        "Once I have the printed online form, what are the subsequent actions?",
        "What's the protocol after printing the application form online?",
        "After obtaining the printed copy of the online form, what are the following procedures?",
        "What steps should I take after I've printed the online application form?",
        "What's the process once I've completed printing the online application form?",
        "After printing the form online, what should I do next?",
        "What's the next course of action after obtaining the printed copy of the online application?",
        "What are the instructions following the printing of the online application form?",
        "Upon printing the online form, what steps are necessary to proceed?",
        "After receiving the printed version of the online application form, what steps should I follow?",
        "What should I include with the printed online application form before mailing it?",
        "How do I submit the printed online application form after printing it?",
        "Are there any additional documents required with the printed online form?",
        "Where do I send the printed online application form after printing it?",
        "Can you guide me through the steps after printing my online application form?",
        "What is the mailing address for sending the printed online application form?",
        "Is there a specific format for sending the printed online application form?",
        "Do I need to include any identification with the printed online form?",
        "How do I ensure my printed online application form is received by the admissions office?",
        "What is the deadline for mailing the printed online application form?",
        "Are there specific instructions for international students regarding the printed online form?",
        "What are the key points to remember when mailing the printed online application form?",
        "How can I track the delivery of my mailed application form?",
        "What should I do if I encounter issues with sending the printed online application form?",
        "Can I deliver the printed online application form in person, or does it need to be mailed?",
        "What is the procedure if my printed online application form gets lost in the mail?",
        "Do I need to confirm receipt of my printed online application form with the admissions office?",
        "How should I package the printed online application form for mailing?",
        "Are there any special requirements for sending the printed application form internationally?",
        "What follow-up actions are required after sending the printed online application form?"
      ],
      "responses": [
        "Online print-out should be added to the admission forms filled manually and posted through DHL (For International Students) or EMS Delivery Services (for local students)."
      ],
      "context_set": ""
    },


    {
      "tag": "Preferred Web Browser for KNUST Admission Portal",
      "patterns": [
        "What type of browser is most efficient when applying Online on the KNUST admission portal?",
        "Which browser should I use for the best performance on the KNUST admission portal?",
        "Is there a recommended browser for applying online on the KNUST admission portal?",
        "What browser works best with the KNUST admission portal?",
        "Is there a specific browser that is compatible with the KNUST admission portal?",
        "Can you recommend a browser that works seamlessly with the KNUST admission portal?",
        "Which web browser offers the smoothest experience for navigating the KNUST admission portal?",
        "Does KNUST recommend a particular browser for optimal performance on the admission portal?",
        "Can I use mobile browsers to access the KNUST admission portal, or is a desktop browser preferred?",
        "Is there a list of supported browsers for the KNUST admission portal?",
        "Is there a browser preference for accessing specific sections or features of the KNUST admission portal?"
      ],
      "responses": [
        "Google Chrome, Mozilla Firefox, Edge, Safari, and Opera are all efficient browsers for accessing the KNUST admission portal."
      ],
      "context_set": ""
    },


    {
      "tag": "Checking Undergraduate Admission Status Timeline",
      "patterns": [
        "How can I check my application status",
        "When can I check my admission status as an undergraduate student?",
        "At what time can I verify my admission status as an undergraduate student?",
        "When will the admission status for undergraduate students be available?",
        "What is the timeline for checking undergraduate admission status?",
        "When will the results for undergraduate admissions be published?",
        "What is the expected timeframe for undergraduate admission results to be announced?",
        "Are undergraduate admission statuses updated in real-time or at specific intervals?",
        "Are admission statuses for undergraduate students released all at once or in batches?",
        "Are there any restrictions on who can check undergraduate admission status?",
        "Can I request assistance if I encounter issues while checking my undergraduate admission status?",
        "When will I be able to view my undergraduate admission status?",
        "How often is the undergraduate admission status updated?",
        "Where can I find my undergraduate admission status?",
        "What is the process for checking my admission status after applying?",
        "How do I know when my undergraduate admission status is available?",
        "Are there specific dates for checking undergraduate admission results?",
        "How long after applying will my admission status be available?",
        "Can I check my admission status before the official release date?",
        "Will I receive a notification when my undergraduate admission status is updated?",
        "How can I stay informed about the status of my undergraduate application?",
        "Is there a specific portal for checking undergraduate admission status?",
        "When should I expect to receive my admission decision as an undergraduate student?",
        "How do I track the progress of my undergraduate application?",
        "Can I get updates on my admission status through email or SMS?",
        "When is the best time to check for updates on my undergraduate admission status?",
        "Are there any delays in updating the undergraduate admission status?",
        "How frequently are undergraduate admission results released?",
        "Is it possible to check my admission status before the official release date?",
        "What should I do if I cannot access my undergraduate admission status?",
        "Can I get help with checking my undergraduate admission status if I face difficulties?"
      ],
      "responses": [
        "You can check for updates on the admission portal"
      ],
      "context_set": ""
    },


    {
      "tag": "Academic Resumption Dates",
      "patterns": [
        "When do we come to school?",
        "What are the resumption dates for students?",
        "When should students report to school?",
        "What is the start date for the new academic year?",
        "Can you provide the schedule for students returning to school?",
        "Are there specific dates for the commencement of classes?",
        "When is the first day of school for the new academic session?",
        "Is there a calendar available with the resumption dates for students?",
        "Are there different resumption dates for different levels or programs?",
        "Can you confirm the start date for the next academic term?",
        "When will classes officially begin for the new academic semester?",
        "Is there a registration period before the academic resumption date?",
        "When does the new academic session begin?",
        "What are the start dates for each semester?",
        "When should students arrive on campus for the new academic year?",
        "Is there a specific date for the beginning of the academic term?",
        "How do I find out when the new school year starts?",
        "Can you provide the start dates for different programs or departments?",
        "When does the academic year officially start?",
        "Are there any important dates related to academic resumption?",
        "What is the official resumption date for the next semester?",
        "When will lectures commence for the new term?",
        "Is there a schedule available for the start of classes?",
        "What are the key dates for the upcoming academic session?",
        "When is the orientation period for new students?",
        "Can you tell me when the academic year begins for continuing students?",
        "Are there any changes to the usual academic resumption dates?",
        "When does registration open for the new academic term?",
        "Is there a deadline for reporting back to school?",
        "What are the deadlines for students to return for the new semester?",
        "How can I get the academic calendar for the new year?",
        "When will students receive their class schedules for the new term?",
        "Are there any specific deadlines for course registration before resumption?",
        "When is the latest possible date to start attending classes?",
        "What should I know about the academic calendar for the new session?",
        "Is there a notice for the academic resumption dates?",
        "How do I find out about the start of the academic year?",
        "When do the semester breaks start and end?",
        "What are the important academic dates for the next session?",
        "Can I access the academic calendar online?",
        "Are there any updates to the usual resumption dates this year?",
        "When does the semester officially begin and end?",
        "Is there an updated academic calendar available for this year?"
      ],
      "responses": [
        "You can find the exact dates for both freshmen and continuing students to report to school on the university website under the academic calendar page. Visit www.knust.edu.gh/ , click on Academics , and then on the Academic Calendar."
      ],
      "context_set": ""
    },


    {
      "tag": "Commencement of Undergraduate Application Form Sales",
      "patterns": [
        "When do we start the sale of undergraduate application forms for each successive academic year?",
        "What are the commencement dates for the sale of undergraduate application forms?",
        "When does the sale of undergraduate application forms typically begin?",
        "At what time of the year do we expect the sale of undergraduate application forms to start?",
        "Are there specific dates announced each year for the commencement of undergraduate application form sales?",
        "Is there a trend or pattern for the start dates of undergraduate application form sales in previous years?",
        "Can I find the commencement dates for undergraduate application form sales on the university website?",
        "Are there any deadlines for purchasing undergraduate application forms?",
        "Is the form out for students to buy?",
        "please what time should i apply for admission ?",
        "When will the undergraduate application forms be available for purchase?",
        "What is the start date for selling undergraduate application forms for the upcoming academic year?",
        "How can I find out when the undergraduate application forms will go on sale?",
        "Are there specific months when undergraduate application forms are usually sold?",
        "When should I expect the application forms for the next academic year to be released?",
        "Is there a scheduled date for the start of undergraduate application form sales?",
        "When does the undergraduate application form sales season begin?",
        "Can you provide information on when undergraduate application forms will be available?",
        "What is the timeline for the release of undergraduate application forms each year?",
        "How early should I check for the availability of undergraduate application forms?",
        "When do applications typically open for the next academic year?",
        "Are there official announcements regarding the start of undergraduate application form sales?",
        "When can prospective students start purchasing application forms for undergraduate programs?",
        "What are the dates for undergraduate application form sales this year?",
        "How often does the start date for undergraduate application form sales change?",
        "Is there a specific time frame for purchasing undergraduate application forms?",
        "Can I get advance notice about when undergraduate application forms will be available?",
        "When does the university usually start selling application forms for new students?",
        "Are the commencement dates for application forms posted online?",
        "When should I begin checking for undergraduate application form availability?",
        "Are there updates or changes to the dates for undergraduate application form sales this year?",
        "How long is the window for purchasing undergraduate application forms?",
        "When will the new academic year's application forms be on sale?",
        "Where can I find the schedule for undergraduate application form sales?",
        "Are there any announcements or notifications about when forms will be available?",
        "What is the procedure for obtaining undergraduate application forms once they go on sale?",
        "Can I buy the undergraduate application forms before the official start date?",
        "When do I need to apply to ensure I get an application form in time?",
        "How do I stay informed about the commencement of application form sales?",
        "When will the next batch of undergraduate application forms be released?",
        "Are there any preparatory steps I should take before the application forms go on sale?",
        "What is the official release date for the upcoming undergraduate application forms?",
        "How do I know if the application forms are available for purchase?",
        "When will the application forms for undergraduate admissions become available this year?",
        "What are the key dates to remember for purchasing undergraduate application forms?",
        "Is there a specific release time for undergraduate application forms each year?",
        "When should I check the university website for application form sales information?",
        "What is the process for applying once the forms are available?",
        "How can I find the exact start date for undergraduate application form sales?",
        "Are there updates on the commencement of sales for undergraduate application forms?",
        "When will the university provide information about application form availability?",
        "Can I get reminders about when undergraduate application forms will go on sale?",
        "Are there any early bird opportunities for purchasing application forms?",
        "What steps should I follow once the undergraduate application forms are available?",
        "When will the university release details about undergraduate application form sales?",
        "Is there a specific time of year when application forms are typically released?"
      ],
      "responses": [
        "Dates may differ based on the program. Kindly refer to the admission guidelines www.knust.edu.gh/admissions/prospective/applying"
      ],
      "context_set": ""
    },


    {
      "tag": "Accommodation for Foreign/international Students on Campus",
      "patterns": [
        "Where are foreign students accommodated on campus?",
        "What is the accommodation arrangement for foreign students?",
        "Where do international students stay on campus?",
        "Which hostel houses foreign students?",
        "Can you provide information about on-campus housing options for international students?",
        "Are there specific dormitories or residences designated for foreign students?",
        "What types of accommodation are available for international students on campus?",
        "How are accommodation assignments determined for foreign students?",
        "Are there accommodation options available off-campus for international students?",
        "Can international students request specific accommodations or modifications for accessibility needs?",
        "What is the process for international students to apply for on-campus housing?",
        "Are there dedicated residences for international students?",
        "How can foreign students secure on-campus accommodation?",
        "What facilities are available in the on-campus housing for international students?",
        "Are there any special requirements for international students to get accommodation?",
        "Do international students have priority for certain dormitories on campus?",
        "Where can I find information about on-campus housing for international students?",
        "Are there different types of rooms available for international students on campus?",
        "Can international students choose their roommates or room preferences?",
        "What is the application deadline for on-campus accommodation for international students?",
        "Are international students housed in the same hostels as local students?",
        "How can I contact the housing office for international student accommodation inquiries?",
        "Are there any additional fees for international students staying on campus?",
        "What is the cost of accommodation for international students on campus?",
        "Are there any support services available for international students in their accommodation?",
        "Can international students live in private accommodation if they prefer?",
        "Are there any special orientation or support programs for international students in on-campus housing?",
        "How do I apply for accommodation at GUSSS Hostel as an international student?",
        "Are there options for shared or single accommodations for international students?",
        "What should international students do if they have issues with their on-campus accommodation?",
        "Can international students request a change of room or residence if needed?",
        "What are the rules and regulations for international students living in on-campus housing?",
        "Are there any facilities specifically designed for international students in the hostels?",
        "How are accommodation assignments communicated to international students?",
        "Are there options for meal plans available for international students in on-campus housing?",
        "What are the living conditions like in the GUSSS Hostel for international students?",
        "Is there a student residence advisor or support person for international students?",
        "Can international students stay in on-campus housing during vacation periods?",
        "What is the process for checking into on-campus housing for international students?",
        "Are there any special accommodations for international students with specific needs?",
        "How can international students find out more about the GUSSS Hostel facilities?",
        "What are the check-in procedures for international students at the start of the semester?",
        "Are there any orientation sessions for international students regarding their accommodation?",
        "Can international students apply for housing before receiving their admission offer?",
        "What types of amenities are provided in the on-campus accommodation for international students?",
        "How do international students pay for their on-campus accommodation?",
        "Are there any rules regarding guests or visitors in the international student hostels?",
        "Can international students request specific amenities in their accommodation?",
        "How can international students resolve issues with their accommodation?",
        "Are there any accommodation options for international students with families?",
        "Can international students access laundry and cooking facilities in their dormitories?",
        "What safety measures are in place for international students in on-campus housing?",
        "Are there any community or cultural activities organized for international students in their hostels?",
        "How do international students get assistance with accommodation-related issues?",
        "Are there any special provisions for international students with dietary restrictions?",
        "Can international students bring their own furniture or appliances to their dorm rooms?",
        "What should international students do if they need to extend their stay in on-campus housing?",
        "Are there any programs to help international students adjust to campus living?",
        "How are maintenance and repair requests handled for international students in their accommodations?",
        "Can international students have access to campus facilities such as gyms and study areas?",
        "What is the procedure for international students if they want to move out of their accommodation?",
        "Are there any special events or welcome programs for international students living on campus?",
        "How do international students report issues or problems with their accommodation?",
        "What is the procedure for requesting special accommodations in the GUSSS Hostel?",
        "Are there any orientation materials provided to international students about their on-campus living?",
        "How can international students get involved in the campus community while living in on-campus housing?",
        "What resources are available for international students needing support with their accommodation?",
        "Are there any guidelines for international students regarding personal conduct in on-campus housing?",
        "How often is the accommodation information updated for international students?",
        "Are there specific advisors or contacts for international student housing inquiries?",
        "What is the process for international students to report maintenance issues in their dorms?",
        "How can international students ensure their accommodation meets their needs and expectations?",
        "Are there any online resources available for international students regarding on-campus housing?"
      ],
      "responses": [
        "All Foreign Students are accommodated at GUSSS Hostel within the University Campus."
      ],
      "context_set": ""
    },


    {
      "tag": "Undergraduate Admission Status",
      "patterns": [
        "Where can I check my admission status as an undergraduate student?",
        "How do I verify my admission status as an undergraduate student?",
        "Where should I go to check if I got admitted as an undergraduate?",
        "What's the process for checking undergraduate admission status?",
        "Can you provide the steps to check my undergraduate admission status?",
        "What should I do if I encounter issues while checking my undergraduate admission status?",
        "Can I check the admission status of other applicants, such as friends or family members?",
        "How can I check if my undergraduate application has been accepted?",
        "Where do I find my admission status for KNUST as an undergraduate?",
        "What steps do I follow to view my undergraduate admission status?",
        "How do I access my admission status online for undergraduate studies?",
        "Can I get updates on my undergraduate admission status through email?",
        "Is there a phone number I can call to check my admission status?",
        "What information do I need to check my undergraduate admission status?",
        "How often is the admission status updated on the portal?",
        "Can I check my admission status using my student ID?",
        "What should I do if my admission status is not available on the portal?",
        "Are there any common issues with checking admission status online?",
        "Can I check my admission status through the KNUST mobile app?",
        "How can I ensure that my admission status is accurate and up-to-date?",
        "What happens if there is a discrepancy in my admission status?",
        "Is there a way to track changes to my admission status over time?",
        "How can I contact support if I'm having trouble checking my admission status?",
        "Will my admission status be visible immediately after I log in?",
        "How long after applying can I expect to see my admission status?",
        "Are there any specific times when the admission status is updated on the portal?",
        "Can I check my admission status from outside Ghana?",
        "Is it possible to receive a physical letter regarding my admission status?",
        "What should I do if I accidentally forget my PIN to check my admission status?",
        "Can I update my personal information if it affects my admission status?",
        "How do I know if my admission status has been processed successfully?",
        "Can I request a status update if I haven't heard back in a long time?",
        "How can I find out if there are issues with my application affecting my admission status?",
        "Is there an option to set notifications for changes in my admission status?",
        "Can I view my admission status on a different device if the portal isn't working?",
        "What do I do if I think my application has been processed but my status isn't showing?",
        "Can I track the progress of my application and admission status through a tracking number?",
        "How do I appeal or follow up if there's a problem with my admission status check?",
        "Are there alternative methods to check my admission status if the online portal is down?"
      ],
      "responses": [
        "<ul><li>Visit the admissions portal https://apps.knust.edu.gh/admissions </li><li>Click on login </li><li>Enter your application serial and PIN and click on Log in</li><li>Click on Check Status</li></ul>"
      ],
      "context_set": ""
    },


    {
      "tag": "Purchasing/buying Undergraduate Application Forms in Ghana",
      "patterns": [
        "Where can I purchase undergraduate application forms in Ghana?",
        "From where can I buy application forms for undergraduate programs in Ghana?",
        "What are the locations to buy undergraduate application forms in Ghana?",
        "How can I get undergraduate application forms in Ghana?",
        "Are there specific banks or outlets where I can purchase undergraduate application forms?",
        "Can I buy undergraduate application forms online, or are they only available in person?",
        "Is there a central location or office where I can obtain undergraduate application forms?",
        "Can I pay for undergraduate application forms using mobile money or other electronic payment methods?",
        "where can I purchase application form in Ghana?",
        "any short code to buy the e-voucher?",
        "how can i buy the forms",
        "Is there an application fee",
        "where can i purchase knust forms",
        "do you know where i can get the admissions forms?",
        "where can i buy the forms",
        "where can i buy the admission forms?",
        "which banks can i buy the forms?",
        "How can I purchase an undergraduate application form for KNUST?",
        "What are the options for buying undergraduate application forms in Ghana?",
        "Are there any online methods to buy undergraduate application forms for KNUST?",
        "Can I buy undergraduate application forms from a local post office?",
        "Which banks offer undergraduate application forms for KNUST?",
        "Is it possible to pay for undergraduate application forms with a credit card?",
        "How do I obtain an application form for undergraduate studies at KNUST?",
        "Where can I find the application forms for undergraduate programs in Ghana?",
        "Can I purchase the KNUST application form through a mobile app?",
        "What is the procedure for buying an undergraduate application form in Ghana?",
        "Are there any authorized agents for selling undergraduate application forms?",
        "How much does it cost to buy an undergraduate application form for KNUST?",
        "Can I get the application form from a specific KNUST office?",
        "Where can I buy undergraduate application forms if I am not in Ghana?",
        "What are the steps to buy an undergraduate application form via mobile money?",
        "Can I buy the KNUST application form at a designated retail outlet?",
        "Is there a deadline for purchasing undergraduate application forms?",
        "Are there any discounts available for purchasing undergraduate application forms?",
        "What should I do if I face issues while buying the application form?",
        "Can I use international payment methods to purchase the application form?",
        "Where can I buy the undergraduate application form in Accra?",
        "What is the process for getting an e-voucher for the undergraduate application form?",
        "Are there any specific requirements for buying the application form online?",
        "How can I confirm my application form purchase?",
        "Can I purchase application forms in bulk for multiple applicants?",
        "How do I receive the application form after purchasing it?",
        "Are there specific times during the day when I can buy the application forms?",
        "Can I get assistance if I am having trouble buying the application form?",
        "Is there a customer service number for inquiries about purchasing application forms?",
        "What should I do if I lose my e-voucher for the application form?",
        "Are there any additional fees for purchasing the application form?",
        "How can I verify that I have purchased the correct application form?",
        "Where can I buy undergraduate application forms in Kumasi?",
        "Can I buy the application forms directly from KNUST campus?",
        "How do I know if the application form I purchased is valid?",
        "Are there any alternative methods to buy the application form apart from banks and post offices?",
        "Can I buy the undergraduate application form from a bookstore?",
        "What should I do if my mobile transaction for the application form fails?",
        "Are there any special instructions for international students buying the application form?",
        "How can I check the status of my application form purchase?",
        "Can I purchase the form through a third-party service?",
        "Where are the designated locations for purchasing application forms in regional capitals?",
        "What are the steps to follow if I want to buy the application form through SMS?",
        "How do I retrieve my e-voucher if I didn't receive it immediately?",
        "Can I use a bank transfer to pay for the application form?",
        "How can I get a receipt for my application form purchase?",
        "Are there specific post offices or banks that do not sell application forms?",
        "Can I get a refund if I make a mistake in purchasing the application form?",
        "How can I contact support if I have issues with purchasing the application form?",
        "Are there any requirements for the type of phone used to purchase the application form?",
        "Can I purchase the application form for KNUST in a different region of Ghana?",
        "What should I do if the application form purchase system is down?",
        "How do I ensure that my application form purchase is completed successfully?",
        "Can I buy the application form from a local education center?",
        "What payment methods are accepted for purchasing the undergraduate application form?",
        "Can I purchase the application form and receive it electronically?",
        "Where can I buy application forms for other universities in Ghana?",
        "Is there a physical address where I can buy the application form if I prefer in-person transactions?",
        "How can I track my application form purchase status?",
        "Are there specific offices at KNUST where application forms are sold?",
        "What are the steps to follow to buy an application form via online banking?",
        "How can I confirm if my application form purchase was successful?",
        "Can I purchase application forms for KNUST at an educational fair?",
        "What information do I need to provide to purchase an application form?",
        "Can I get help with the application form purchase process at KNUST?"
      ],
      "responses": [
        "<ul><li>Application forms can be purchased from all Ghana Post Regional and Designated Post Offices, including selected banks</li><li>Application forms can also be purchased via mobile:</li><br><ol><u>6 Easy Steps</u><li>Dial .*885#</li><li>Select Forms and E-voucher</li><li>Choose KNUST</li><li>Select the form you wish to purchase</li><li>Authorise Payment</li><li>Receive E-voucher via SMS</li></ol><br><ol><u>To Retrieve E-voucher</u><li>Dial *885#</li><li>Select Forms and E-voucher</li><li>Enter 1 to retrieve voucher code</li><li>Enter Transaction ID</li><li>E-voucher details displayed</li></ol></ul><br> The price is something around for Ghanaian undergraduate regular GHc 250. Please confirm the current price from the official KNUST website. No refund after purchase."
      ],
      "context_set": ""
    },


    {
      "tag": "Information for International Students about KNUST",
      "patterns": [
        "Where can international students find information about KNUST?",
        "What information are available for international students at KNUST?",
        "I'm an international student. How can I get information about KNUST?",
        "Are there any health services or medical facilities accessible to international students at KNUST?",
        "Are there any travel or transportation resources available to help international students navigate within Ghana?"
      ],
      "responses": [
        "International students at KNUST can find valuable information from the International Programmes Office. This office serves as a hub for international student services and support. They offer guidance on various aspects of student life, including visa assistance, academic advising, and cultural integration. Additionally, there is a friendly union between international and national students, fostering a supportive community atmosphere."
      ],
      "context_set": ""
    },
    
    
    {
      "tag": "Career Prospects for International Students at KNUST",
      "patterns": [
        "What are the prospects for international students at KNUST?",
        "How does KNUST prepare international students for future leadership roles?",
        "As an international student, what opportunities does KNUST offer for career advancement?",
        "What are the future career prospects for international graduates of KNUST?",
        "Are there career counseling services available for international students at KNUST?",
        "Does KNUST offer career fairs or networking events specifically for international students?",
        "What support does KNUST provide to help international students secure employment after graduation?",
        "Does KNUST offer professional development workshops or training sessions for international students?",
        "Are there any industry partnerships or collaborations that benefit international students' career prospects at KNUST?",
        "Can international students access resources such as resume writing assistance or interview preparation workshops at KNUST?",
        "Does KNUST offer career guidance or mentorship programs specifically tailored to the needs of international students?",
        "Does KNUST collaborate with employers or companies to offer internships or job opportunities to international students?"
      ],
      "responses": [
        "At KNUST, international students are groomed for senior leadership positions in the future. The university places a strong emphasis on teaching superior values and technological skills to its diverse student body. With rigorous and disciplined classrooms, KNUST ensures that students are well-equipped to become future leaders in their respective countries."
      ],
      "context_set": ""
    },
    
    
    {
      "tag": "Cultural Diversity at KNUST",
      "patterns": [
        "What is the cultural environment like at KNUST?",
        "How diverse is the student body at KNUST?",
        "Can you describe the cultural atmosphere at KNUST?",
        "What initiatives does KNUST have in place to promote cultural diversity among students?",
        "Are there cultural clubs or organizations that international students can join at KNUST?",
        "How does KNUST celebrate cultural heritage and diversity on campus?",
        "Can international students participate in cultural exchange programs or initiatives at KNUST?",
        "Are there opportunities for international students to share their cultural traditions and experiences with the KNUST community?",
        "How does KNUST foster an inclusive environment that respects and values cultural differences?",
        "Are there resources or workshops available to help international students navigate cultural adjustment and transition to life at KNUST?",
        "Does KNUST offer cross-cultural communication training or workshops to enhance understanding and collaboration among students?",
        "What efforts does KNUST make to ensure that cultural diversity is reflected in the curriculum and academic programming?"
      ],
      "responses": [
        "An education at KNUST offers more than just academic learning. It provides students with an opportunity to immerse themselves in a culturally and ethnically rich environment. With students and faculty from around the world, KNUST fosters an atmosphere where learning from one another is as crucial as the curriculum itself. This enriching experience prepares students to thrive in our globalized world."
      ],
      "context_set": ""
    },
    
    
    {
      "tag": "Application Process for International/foreign Students at KNUST",
      "patterns": [
        "What is the application process for foreign applicants at KNUST?",
        "What is the application process as an international student to KNUST?",
        "I'm from another country. What are the steps to apply to KNUST?",
        "Can you guide me through the application process as an international student?",
        "Are there specific admissions criteria or evaluation processes for international applicants at KNUST?",
        "Are there any interviews or additional assessments required for international students as part of the application process?",
        "What support services does KNUST provide to help international students with the application process?",
        "What steps should international students take after receiving their admission offer from KNUST?"
      ],
      "responses": [
        "Foreign applicants seeking admission to KNUST are required to generate an E-voucher from the university's website. This E-voucher serves as the initial step in the application process and provides access to the application portal. Upon generating the E-voucher, applicants should carefully follow the instructions provided on the website to complete their application."
      ],
      "context_set": ""
    },
    
    
    {
      "tag": "Payment for KNUST Application Processing Fee (International Students)",
      "patterns": [
        "How can international students pay the application processing fee for KNUST?",
        "What are the payment options available for international students to pay the application processing fee?",
        "I'm an international student. How do I proceed to pay the application processing fee for KNUST?",
        "Can you provide details on the payment methods accepted from international students for the application processing fee?",
        "Can international students pay the application processing fee using foreign currency?",
        "Is there a portal or website specifically for international students to make the payment for the application processing fee?",
        "Are there any bank transfer instructions available for international students to pay the application processing fee?",
        "What is the process for confirming payment of the application processing fee for international students?",
        "Where can I find information about the amount of the application processing fee for KNUST?",
        "Are there any additional charges or taxes associated with paying the application processing fee for KNUST?",
        "What currency is accepted for paying the application processing fee for KNUST?",
        "Can I pay the application processing fee using a credit card, debit card, or electronic transfer?",
        "What are the steps to pay the KNUST application processing fee for international students?",
        "Can you provide the bank details for paying the KNUST application processing fee from abroad?",
        "How can international students confirm their payment of the KNUST application processing fee?",
        "What are the accepted payment methods for international students applying to KNUST?",
        "Is there an online payment system available for international students to pay the application processing fee?",
        "How do I ensure that my payment for the KNUST application processing fee is correctly processed?",
        "Are there any specific forms I need to fill out for international payment of the KNUST application fee?",
        "Can international students use PayPal or other online payment systems to pay the KNUST application fee?",
        "Where can I find the exact amount for the KNUST application processing fee for international students?",
        "What details do I need to provide when making a bank transfer for the KNUST application fee?",
        "Are there any currency conversion fees for international students paying the KNUST application fee?",
        "How long does it take for the payment to be processed for international students applying to KNUST?",
        "Can I receive a receipt for my application fee payment as an international student?",
        "What should I do if I encounter issues while making the payment for the KNUST application fee?",
        "Are there any deadlines for paying the KNUST application processing fee for international students?",
        "Can international students pay the application processing fee in their local currency?",
        "What is the procedure for international students to follow if they need to request a refund for the application fee?",
        "How can I verify if my payment for the KNUST application processing fee has been received?",
        "Is there a support contact for international students who need assistance with paying the application fee?",
        "Can I make partial payments for the KNUST application processing fee as an international student?",
        "Are there any additional forms or documentation required when paying the KNUST application fee from abroad?",
        "How can I check the status of my application fee payment for KNUST?",
        "What should I include in the payment reference for the KNUST application processing fee?",
        "Can I pay the KNUST application processing fee through wire transfer?",
        "Are there any specific bank details for paying the KNUST application fee from outside Ghana?",
        "What is the best way to contact KNUST regarding issues with the application fee payment?",
        "Can international students use a third-party payment service to pay the KNUST application fee?",
        "Is there a specific bank form or template that international students should use when paying the application fee?",
        "How can I obtain confirmation of my payment for the KNUST application processing fee?",
        "Are there any specific instructions for using international bank accounts to pay the KNUST application fee?",
        "What should I do if the bank details provided for the KNUST application fee are incorrect?",
        "Can I pay the KNUST application processing fee using an international money transfer service?",
        "How do I handle discrepancies or errors in my application fee payment for KNUST?",
        "Are there specific banks that KNUST prefers for receiving application fee payments from international students?",
        "Can I pay the application fee in installments if I am an international student?",
        "How can I track my payment status for the KNUST application processing fee?",
        "What are the bank account details for paying the KNUST application fee from the USA?",
        "Is it possible to use a check or money order to pay the KNUST application fee as an international student?",
        "How do I get a payment confirmation receipt from the bank for the KNUST application fee?",
        "Are there any online platforms or websites where I can pay the KNUST application fee as an international student?",
        "What should I do if I do not receive an e-voucher or payment confirmation after paying the application fee?",
        "Can I make the application fee payment through an international credit card?",
        "Are there any specific instructions for paying the KNUST application fee from Europe?",
        "What should I do if my payment for the KNUST application processing fee is delayed?",
        "How do I ensure that my international payment for the KNUST application fee is processed in a timely manner?",
        "Can I use a foreign bank draft to pay the KNUST application processing fee?",
        "What are the procedures if my international payment for the KNUST application fee is rejected?",
        "How can I obtain a detailed payment breakdown for the KNUST application fee?",
        "Are there specific deadlines for making the application fee payment for KNUST?",
        "How can I verify that my payment information was correctly submitted for the KNUST application fee?",
        "What actions should I take if there is a discrepancy in the application fee amount paid?",
        "Can I use a foreign currency exchange service to pay the KNUST application fee?",
        "What are the common issues faced when paying the application fee from abroad and how can they be resolved?",
        "How do I update my payment details if there was an error in the initial payment for the KNUST application fee?",
        "Are there specific contact details for resolving payment issues for international students at KNUST?",
        "Can I get a refund if I accidentally pay the application fee twice?"
      ],
      "responses": [
        "The foreign application processing fee for KNUST can be paid through designated bank accounts. Applicants have the option to make payments via Ghana Commercial Bank Ltd, Ecobank Ghana Limited, or UBA. Each bank account has specific details, including account numbers and Swift codes, to ensure accurate processing of the application fee."
      ],
      "context_set": ""
    },
    
    
    {
      "tag": "Completing and Submitting the Application for KNUST",
      "patterns": [
        "What are the requirements for completing and submitting the application?",
        "How should I ensure my application is properly processed?",
        "I'm ready to submit my application. What do I need to know?",
        "Can you provide guidance on completing and submitting the application form?",
        "What are the steps involved in completing the application form for KNUST?",
        "Can you provide details on the required documents for completing the application for KNUST?",
        "What should I check before submitting my KNUST application?",
        "Are there any common mistakes to avoid when completing the KNUST application?",
        "How do I submit my KNUST application once it's completed?",
        "What documents need to be attached when submitting the KNUST application?",
        "How can I confirm that my KNUST application has been successfully submitted?",
        "Can I edit my KNUST application after submission?",
        "What are the deadlines for submitting the KNUST application?",
        "Are there any specific formats required for the documents submitted with the KNUST application?",
        "What should I do if I miss the application submission deadline for KNUST?",
        "Can I submit my KNUST application electronically or only by mail?",
        "How can I track the status of my submitted KNUST application?",
        "What if I realize there's a mistake in my submitted KNUST application?",
        "Is there a confirmation email or receipt for submitting the KNUST application?",
        "Are there specific instructions for international students on submitting the KNUST application?",
        "How do I ensure that my application documents are received by KNUST?",
        "What are the procedures for submitting supplemental documents for the KNUST application?",
        "How do I handle multiple submissions if I accidentally send my application more than once?",
        "Are there any fees associated with submitting the KNUST application?",
        "What are the steps to follow if my KNUST application is returned for correction?",
        "Can I submit my KNUST application in parts or does it need to be completed all at once?",
        "What should I do if I encounter technical issues while submitting my KNUST application online?",
        "Is there an application checklist to ensure I have completed everything for KNUST?",
        "How can I contact KNUST if I need help with the application submission process?",
        "What are the acceptable file sizes and types for uploading documents with the KNUST application?",
        "Can I submit my KNUST application through a third party, like an educational consultant?",
        "What happens if my KNUST application is submitted late?",
        "How can I update my personal information if there are changes after submitting the KNUST application?",
        "Are there any specific guidelines for writing the personal statement or essays for the KNUST application?",
        "How should I prepare my transcripts and certificates for submission with the KNUST application?",
        "What is the protocol for submitting reference letters with the KNUST application?",
        "How can I ensure my KNUST application is complete and meets all requirements?",
        "What if I forget to include a required document with my KNUST application?",
        "How do I follow up on my KNUST application submission if I don't receive a confirmation?",
        "Are there specific submission instructions for KNUST's graduate or undergraduate programs?",
        "How can I make sure my KNUST application stands out among other submissions?",
        "Is it possible to get feedback on a submitted KNUST application if I'm not selected?",
        "Can I make changes to my KNUST application after it has been submitted but before the deadline?",
        "How do I handle application submission if I am applying for multiple programs at KNUST?",
        "What should I do if I accidentally submit incomplete information with my KNUST application?",
        "Are there any specific requirements for the application photos or scanned copies?",
        "How do I address technical issues or errors that occur during the application submission process?",
        "What are the next steps after submitting my KNUST application?",
        "Can I receive a hard copy of my submitted KNUST application for my records?",
        "How should I manage my application submission if I am applying to multiple universities including KNUST?",
        "Are there specific instructions for submitting international qualifications with the KNUST application?",
        "How do I ensure that my application for KNUST is processed without delays?",
        "What are the implications if my KNUST application is incomplete or missing documents?",
        "How can I confirm receipt of my KNUST application if I do not receive immediate feedback?"
      ],
      "responses": [
        "It is essential to fully and properly complete the application at the time of submission to avoid processing delays or rejection. Applicants must carefully review all sections of the application form and ensure that all required fields are filled accurately. Any incomplete or improperly filled application may not be processed or considered for admission."
      ],
      "context_set": ""
    },


    {
      "tag": "KNUST info",
      "patterns": [
          "Tell me about KNUST.",
          "What is KNUST?",
          "Can you provide information on KNUST?",
          "What are the key features of KNUST?",
          "Give me an overview of KNUST.",
          "What are KNUST's achievements?",
          "What are the research achievements of KNUST?",
          "What ranking does KNUST hold?",
          "What makes KNUST unique?",
          "Why is KNUST well-known?",
          "What is the history of KNUST?",
          "How is KNUST ranked globally?",
          "what makes knust unique compared to other universities in ghana",
          "What is the mission of KNUST?",
          "Can you describe KNUST's campus life?",
          "What are the major faculties at KNUST?",
          "What type of research is KNUST known for?",
          "What notable alumni has KNUST produced?",
          "How many students are enrolled at KNUST?",
          "What are the admission requirements for KNUST?",
          "Can you tell me about KNUST's faculty and staff?",
          "What is the student-to-faculty ratio at KNUST?",
          "How does KNUST support student organizations and activities?",
          "What are KNUST's strategic goals for the future?",
          "Are there any notable partnerships or collaborations KNUST has?",
          "What kinds of extracurricular activities are available at KNUST?",
          "How does KNUST contribute to the local community?",
          "Can you provide information about KNUST's international collaborations?",
          "What are the major research projects at KNUST?",
          "How does KNUST support innovation and entrepreneurship?",
          "What is the role of KNUST in national development?",
          "What facilities are available for international students at KNUST?",
          "How does KNUST ensure the quality of its programs?",
          "What is KNUST's approach to sustainability and environmental impact?",
          "What are some of KNUST's most popular programs or courses?",
          "How does KNUST's campus compare to other universities in Ghana?",
          "Can you tell me about KNUST's student exchange programs?",
          "What are the opportunities for graduate studies at KNUST?",
          "How is KNUST involved in community service and outreach?",
          "What kind of housing options are available on campus at KNUST?",
          "What are KNUST's policies on diversity and inclusion?",
          "How does KNUST support research funding and grants?",
          "What kind of student support services are offered at KNUST?",
          "What are the key areas of KNUST's development plans?"
      ],
      "responses": [
        "KNUST, also referred to as UST, Tech or Kwame Tech, is a public university located in Kumasi, Ashanti Region, Ghana. It is the second public university established in Ghana and the largest university in the Ashanti Region. Established in 1951 as the Kumasi College of Technology, it became a full-fledged university in 1961 and was named after Kwame Nkrumah, the first president of Ghana. <ul><li><b><u>Programs and Focus</u></b></li><p>KNUST is a science and technology-focused university with a strong reputation for research and development. It offers a wide range of undergraduate and postgraduate programs in science, engineering, agriculture, medicine, pharmacy, law, social sciences, and humanities. The university is known for its research outcomes and the development of human resources in these fields.</p><br><li><b><u>Achievements</u></b></li><ul><li>Ranked 14th in Africa and 706th in the world, according to Times Higher Education World University Rankings.</li><li>Ranked No. 1 globally for the provision of quality education by the World University Ranking in 2023.</li><li>First university in West Africa to have won the Pan African Universities Debate Championship consecutively in 2018, 2019, and 2020.</li><li>First university in Ghana to win the Ghana national rounds of the Philip C. Jessup International Law Moot Court Competition.</li><li>First university in Africa to have won the Pan African Universities Debating Championship three consecutive times by December 2020.</li></ul><br><li><b><u>Campus Facilities</u></b></li><ul><li>Accommodation: Halls of residence</li><li>Academic Facilities: Lecture halls, laboratories, computer labs, libraries</li><li>Research Centers and Institutes</li><li>Sporting Facilities</li><li>Commercial Area: Shops, restaurants, and banks</li><li>Healthcare: University Hospital</li></ul></ul>"
      ],
      "context_set": ""
    },


    {
      "tag": "physically challenged students",
      "patterns": [
        "How do i apply as a physically challenged student?",
        "How special does knust treat persons with disability?",
        "How do i apply to as an amputee",
        "How can a physically challenged student apply to KNUST?",
        "What is the application process for students with disabilities?",
        "Are there special provisions for disabled applicants at KNUST?",
        "How do I apply as a student with a physical disability?",
        "Does KNUST have specific guidelines for physically challenged applicants?",
        "What support is available for physically challenged students during the application process?",
        "Can you provide information on applying as a physically challenged student?",
        "What are the steps to apply to KNUST for students with disabilities?",
        "Is there a different application process for physically challenged students?",
        "How do I apply to KNUST as an amputee student?",
        "Are there any special requirements for disabled students applying to KNUST?",
        "What accommodations does KNUST offer for physically challenged applicants?",
        "How can I ensure my needs are met when applying as a disabled student?",
        "What services are available for physically challenged applicants at KNUST?",
        "How does KNUST handle applications from physically challenged students?",
        "What documentation is required for physically challenged students applying to KNUST?",
        "Are there any specific forms for physically challenged students applying to KNUST?",
        "How do I apply to KNUST if I have a physical disability?",
        "What is the procedure for physically challenged students to apply?",
        "Can physically challenged students receive application assistance?",
        "What are the application options for students with disabilities?",
        "How do I get help with my application as a physically challenged student?",
        "What steps should I follow to apply to KNUST as a disabled student?",
        "How can physically challenged students submit their applications?",
        "Is there a dedicated office for disabled students applying to KNUST?",
        "How do I apply as a student with a disability?",
        "What resources are available for disabled students during the application process?",
        "How do I complete my application as a physically challenged student?",
        "Are there special programs for physically challenged students at KNUST?",
        "What should I know before applying as a physically challenged student?",
        "Does KNUST provide support for disabled applicants?",
        "How do I apply to KNUST as a student with special needs?",
        "What are the necessary steps for disabled students to apply?",
        "How do physically challenged students access application forms?",
        "Can I apply to KNUST with a physical disability?",
        "How do I navigate the application process as a physically challenged student?",
        "What special considerations are there for disabled students applying to KNUST?",
        "What support services are available for disabled students at KNUST?",
        "How do I apply as a student with a physical impairment?",
        "What assistance does KNUST offer to physically challenged applicants?",
        "How do I indicate my disability on the application form?",
        "What is the application process for students with physical challenges?",
        "How do I ensure my application is complete as a disabled student?",
        "What documents do I need to apply as a physically challenged student?",
        "Can I get help with my application as a student with a disability?",
        "How do I start my application as a physically challenged student?",
        "What are the steps for physically challenged students to apply?",
        "How do I get application support as a disabled student?",
        "What accommodations are available for disabled applicants?",
        "How do I apply for KNUST with a physical disability?",
        "how does a student with special needs apply?"
      ],
      "responses": [
        "KNUST has a commitment to providing an inclusive environment for students with disabilities. To apply as a physically challenged student to Kwame Nkrumah University of Science and Technology (KNUST), follow these steps:<ul> <li>Obtain Application Forms </li> <li>Fill Out the Application Form by providing all required information accurately. Be sure to indicate your status as a physically challenged students.</li> <li>Attach Supporting Documents</li> <li>Submit Your Application</li> <li>Contact the Disability Services Office by reaching out to the KNUST Office of disability</li></ul>"
      ],
      "context_set": ""
    },


    {
      "tag": "work and study",
      "patterns": [
        "Does knust have a work and study policy for students",
        "can i work and study at the same time whiles on campus?",
        "what jobs can i take whiles on campus?",
        "does knust have job openings for students?",
        "what is the work and study policy in knust?",
        "Can students work while studying at KNUST?",
        "Is there a work-study program at KNUST?",
        "What are the opportunities for working and studying at KNUST?",
        "Does KNUST support students who want to work and study?",
        "Can I get a job on campus while attending KNUST?",
        "Are there any part-time job options for KNUST students?",
        "How can I balance work and study at KNUST?",
        "Does KNUST offer any work-study positions?",
        "Can I find employment opportunities through KNUST?",
        "Are there any campus jobs available for students at KNUST?",
        "What types of jobs can I do while studying at KNUST?",
        "Is it possible to work and study at KNUST?",
        "Are there any work-study programs for international students at KNUST?",
        "What kind of work opportunities are there for KNUST students?",
        "How do I apply for a job while studying at KNUST?",
        "Does KNUST provide support for students looking for jobs?",
        "Can students at KNUST work part-time?",
        "Are there any employment programs for KNUST students?",
        "How can I find a job on campus at KNUST?",
        "What are the regulations for working while studying at KNUST?",
        "Are there job fairs or recruitment events at KNUST?",
        "Can I work off-campus while studying at KNUST?",
        "What job opportunities are available for KNUST students?",
        "Does KNUST help students find jobs?",
        "Can I work in the university library or cafeteria while studying at KNUST?",
        "Are there any internships available through KNUST?",
        "Can I work as a research assistant while studying at KNUST?",
        "What are the policies for students working part-time at KNUST?",
        "How can I manage a job and my studies at KNUST?",
        "Are there any student employment programs at KNUST?",
        "Does KNUST offer career services for students looking for work?",
        "Can I find a job through KNUST's career center?",
        "Are there any on-campus jobs for KNUST students?",
        "What support does KNUST provide for students who want to work?",
        "Can I get a job related to my field of study at KNUST?",
        "What are the work-study options for KNUST students?",
        "How do I balance my coursework and a job at KNUST?",
        "Can I work as a tutor while studying at KNUST?",
        "Does KNUST offer job placement services for students?",
        "Are there any part-time jobs in the university departments at KNUST?",
        "Can I work as a lab assistant while studying at KNUST?",
        "What are the rules for working while attending KNUST?",
        "How can I find work-study opportunities at KNUST?",
        "Are there any job listings for KNUST students?",
        "Can I work in administration while studying at KNUST?",
        "What part-time jobs are available for students at KNUST?",
        "Are there any work-study scholarships at KNUST?",
        "Can I find jobs through KNUST's student portal?",
        "Does KNUST offer job training programs for students?",
        "How can I apply for a campus job at KNUST?",
        "Are there any career services for working students at KNUST?"
      ],
      "responses": [
        "As of now, KNUST doesn't have a formal work and study program specifically designed for undergraduate regular students."
      ],
      "context_set": ""
    }
  ]
}