{
    "intents": [
        {
            "tag": "biochemistry_requirement",
            "patterns": [
                "What are the requirements for BSc. Biochemistry?",
                "Can you provide the admission criteria for BSc. Biochemistry?",
                "Requirements for BSc. Biochemistry programme?",
                "What are the prerequisites for BSc. Biochemistry?",
                "BSc. Biochemistry admission requirements?",
                "Information on eligibility for BSc. Biochemistry?",
                "What are the entry requirements for BSc. Biochemistry?",
                "Criteria for admission into BSc. Biochemistry?",
                "Biochemistry programme prerequisites?",
                "What do I need to qualify for BSc. Biochemistry?",
                "How can I be eligible for the Biochemistry program?",
                "What qualifications are required for Biochemistry?",
                "What academic credentials are needed for Biochemistry?",
                "What grades do I need for BSc. Biochemistry?",
                "What subjects are necessary for BSc. Biochemistry?",
                "Can you tell me the admission requirements for Biochemistry?",
                "What is needed to apply for BSc. Biochemistry?",
                "What are the criteria for Biochemistry admission?",
                "What do I need to study Biochemistry at the undergraduate level?",
                "What are the educational requirements for BSc. Biochemistry?",
                "What are the high school subject requirements for Biochemistry?",
                "What must I have to get into the Biochemistry program?",
                "What are the prerequisites for entering the Biochemistry course?",
                "What do I need to be accepted into Biochemistry?",
                "What should I have studied to qualify for Biochemistry?",
                "What are the core requirements for BSc. Biochemistry?",
                "What elective subjects do I need for Biochemistry?",
                "What qualifications do I need for an undergraduate Biochemistry course?",
                "Can you provide the necessary subjects for Biochemistry?",
                "What are the subject requirements for BSc. Biochemistry?",
                "What qualifications must I meet for Biochemistry?",
                "What do I need to meet the admission standards for Biochemistry?",
                "What qualifications are acceptable for the Biochemistry program?",
                "What subjects should I take to get into Biochemistry?",
                "What academic background is needed for Biochemistry?",
                "What courses should I complete for Biochemistry?",
                "What are the specific subjects required for Biochemistry?",
                "What educational qualifications are necessary for Biochemistry?",
                "What are the academic entry requirements for Biochemistry?",
                "Can you list the necessary subjects for Biochemistry?",
                "What subjects do I need credits in for Biochemistry?",
                "What is the qualification needed for BSc. Biochemistry?",
                "What educational background do I need for Biochemistry?",
                "What high school courses are needed for Biochemistry?",
                "What subjects are essential for BSc. Biochemistry?",
                "What academic criteria do I need for Biochemistry?",
                "What grades do I need in high school for Biochemistry?",
                "What are the subject combinations needed for Biochemistry?",
                "What are the WASSCE requirements for Biochemistry?",
                "What are the SSSCE requirements for Biochemistry?",
                "What are the 'A' Level requirements for Biochemistry?",
                "What are the O' Level requirements for Biochemistry?",
                "What qualifications do mature students need for Biochemistry?",
                "What are the HND requirements for Biochemistry?",
                "What diploma qualifications are needed for Biochemistry?",
                "What entrance exams do I need to take for Biochemistry?",
                "What interview requirements are there for Biochemistry?",
                "What science subjects do I need for Biochemistry?"
            
            ],
            "responses": [
                "Here are the requirements for BSc. Biochemistry <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in any THREE (3) subjects including: Biology, Chemistry and either Physics or Mathematics. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry, and either Physics  or Mathematics. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul><br><li><b><u>HND AND OTHER DIPLOMA </u></b></li><ul><li>Good class in a science related Programme from a recognized polytechnic. Applicants with Second Class (Upper Division) and (Lower Division) may be admitted to Third and SECOND YEAR of the Programme respectively. </li><li>An applicant must pass an entrance examination. </li><li>An applicant must also satisfy the university's general admission requirement for degree Programmes. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Biochemistry Cutoff Points",
            "patterns": [
                "cutoff points for BSc Biochemistry",
                "BSc Biochemistry cutoff points",
                "minimum score for BSc Biochemistry",
                "required score for BSc Biochemistry",
                "aggregate for BSc Biochemistry",
                "what is the cutoff for BSc Biochemistry",
                "cutoff marks for BSc Biochemistry",
                "BSc Biochemistry required marks",
                "what aggregate do I need for BSc Biochemistry",
                "score needed for BSc Biochemistry",
                "cutoff points for biochemistry",
                "aggregate requirements for biochemistry",
                "what were the cut-off aggregates for biochemistry",
                "what are the cut-off aggregates biochemistry",
                "What is the minimum aggregate for BSc Biochemistry?",
                "Tell me the cutoff for Biochemistry",
                "Biochemistry programme cutoff points?",
                "What aggregate is required for Biochemistry?",
                "What marks do I need for BSc Biochemistry?",
                "Minimum required marks for Biochemistry",
                "What is the score needed for Biochemistry?",
                "Aggregate score for Biochemistry admission?",
                "What are the Biochemistry cutoff marks?",
                "Required aggregate for Biochemistry?",
                "What cutoff score do I need for Biochemistry?",
                "Entry aggregate for BSc Biochemistry",
                "What cutoff is needed for Biochemistry?",
                "Biochemistry aggregate cutoff for admission",
                "Biochemistry programme score requirements",
                "What are the Biochemistry admission cutoffs?",
                "Minimum score for admission to Biochemistry",
                "Required scores for BSc Biochemistry programme",
                "What is the aggregate cutoff for Biochemistry?",
                "Cutoff score for Biochemistry programme",
                "What marks do I need to get into Biochemistry?",
                "Biochemistry course cutoff points",
                "What is the aggregate needed for Biochemistry?",
                "Aggregate cutoffs for Biochemistry course",
                "Required cutoff points for Biochemistry",
                "What is the admission cutoff for Biochemistry?",
                "Biochemistry aggregate score requirements",
                "What are the minimum marks for Biochemistry?",
                "Required marks for Biochemistry admission",
                "What cutoff marks do I need for Biochemistry?",
                "Entry requirements cutoff for Biochemistry",
                "Cutoff aggregate for Biochemistry admission",
                "What is the entry score for Biochemistry?",
                "Biochemistry admission cutoff score",
                "Biochemistry cutoff aggregate score",
                "Biochemistry programme required cutoff",
                "What is the cutoff for getting into Biochemistry?",
                "Biochemistry course aggregate requirements",
                "What is the Biochemistry aggregate requirement?",
                "Biochemistry admission marks needed",
                "What cutoff marks are required for Biochemistry?",
                "Entry aggregate score for Biochemistry",
                "Biochemistry minimum aggregate needed",
                "Biochemistry programme admission cutoff",
                "What is the required score for Biochemistry?",
                "Biochemistry aggregate admission requirements",
                "Required admission score for Biochemistry",
                "What marks are needed for Biochemistry?",
                "Biochemistry entry score requirements",
                "What aggregate do I need for Biochemistry admission?"
            ],
            "responses": [
                "The cutoff points for BSc. Biochemistry are typically around aggregate 12. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Biochemistry fees",
            "patterns": [
                "what is the fees for Biochemistry",
                "Can I know the amount I will pay for Biochemistry",
                "Can i pay the fees in installment for Biochemistry?",
                "When should i pay the fees for Biochemistry?",
                "Can i book for a hall before paying fees for Biochemistry",
                "How much are the fees for BSc. Biochemistry?",
                "What are the tuition fees for BSc. Biochemistry?",
                "How much do I need to pay for BSc. Biochemistry?",
                "What is the cost of the BSc. Biochemistry programme?",
                "Can you provide the fee details for BSc. Biochemistry?",
                "What is the tuition cost for BSc. Biochemistry?",
                "How much is the fee for studying Biochemistry?",
                "What is the payment schedule for BSc. Biochemistry fees?",
                "Do I have to pay the full fee for BSc. Biochemistry upfront?",
                "What is the fee structure for BSc. Biochemistry?",
                "Can I pay my BSc. Biochemistry fees in installments?",
                "What are the fee payment options for BSc. Biochemistry?",
                "How are the fees for BSc. Biochemistry calculated?",
                "Are there any additional costs for BSc. Biochemistry?",
                "What is the total cost of BSc. Biochemistry for a year?",
                "Are there any extra fees for BSc. Biochemistry?",
                "Can I get a breakdown of the BSc. Biochemistry fees?",
                "What is the annual fee for BSc. Biochemistry?",
                "How much does each semester cost for BSc. Biochemistry?",
                "What are the miscellaneous fees for BSc. Biochemistry?",
                "Are there any lab fees for BSc. Biochemistry?",
                "What are the accommodation fees for BSc. Biochemistry?",
                "How much are the hostel fees for BSc. Biochemistry students?",
                "What is the fee for international students in BSc. Biochemistry?",
                "Do international students pay higher fees for BSc. Biochemistry?",
                "What is the fee for fee-paying students in BSc. Biochemistry?",
                "Are there fee waivers for BSc. Biochemistry?",
                "Are scholarships available to cover BSc. Biochemistry fees?",
                "What are the financial aid options for BSc. Biochemistry?",
                "How much should I budget for BSc. Biochemistry fees?",
                "Is there a fee refund policy for BSc. Biochemistry?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Biochemistry?",
                "What is the refund policy for BSc. Biochemistry fees?",
                "What is the deadline for paying BSc. Biochemistry fees?",
                "Can I get a fee extension for BSc. Biochemistry?",
                "What is the penalty for late payment of BSc. Biochemistry fees?",
                "Can I pay BSc. Biochemistry fees in multiple payments?",
                "Are there any hidden costs for BSc. Biochemistry?",
                "What are the compulsory fees for BSc. Biochemistry?",
                "Can I pay BSc. Biochemistry fees with a payment plan?",
                "How often do I need to pay fees for BSc. Biochemistry?",
                "What are the semester fees for BSc. Biochemistry?",
                "Is there an application fee for BSc. Biochemistry?",
                "What is the registration fee for BSc. Biochemistry?",
                "Are the fees for BSc. Biochemistry fixed or variable?",
                "What is the cost per credit hour for BSc. Biochemistry?",
                "Are there any discounts available for BSc. Biochemistry fees?",
                "Can I get a fee breakdown for BSc. Biochemistry?",
                "What are the non-tuition fees for BSc. Biochemistry?",
                "Are there any additional charges for BSc. Biochemistry?",
                "How much is the acceptance fee for BSc. Biochemistry?",
                "Can I book a hall without paying the BSc. Biochemistry fees?",
                "What are the hostel booking requirements for BSc. Biochemistry?",
                "When are the BSc. Biochemistry fees due?",
                "What is the initial deposit for BSc. Biochemistry fees?",
                "How do I pay my BSc. Biochemistry fees online?",
                "Are there any late fees for BSc. Biochemistry?",
                "What is the mode of payment for BSc. Biochemistry fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Biochemistry?",
                "How do I access my fee statement for BSc. Biochemistry?",
                "What is the last date to pay fees for BSc. Biochemistry?",
                "Is there an online payment option for BSc. Biochemistry fees?",
                "What is the procedure for paying BSc. Biochemistry fees?",
                "What is the tuition fee for the first year of BSc. Biochemistry?",
                "Are there any financial aid options for BSc. Biochemistry?",
                "What is included in the BSc. Biochemistry fee?",
                "Can I get a fee waiver for BSc. Biochemistry?"
            ],
            "responses": [
                "The fees for BSc. Biochemistry programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "food_science_and_technology_requirement",
            "patterns": [
                "What are the requirements for Food Science and Technology?",
                "Can you provide the admission criteria for Food Science and Technology?",
                "Requirements for Food Science and Technology programme?",
                "What are the prerequisites for Food Science and Technology?",
                "Food Science and Technology admission requirements?",
                "Information on eligibility for Food Science and Technology?",
                "What are the entry requirements for Food Science and Technology?",
                "Criteria for admission into Food Science and Technology?",
                "Food Science and Technology programme prerequisites?",
                "What qualifications do I need for Food Science and Technology?",
                "Eligibility criteria for Food Science and Technology",
                "Admission requirements for Food Science and Technology programme",
                "What are the necessary qualifications for Food Science and Technology?",
                "Food Science and Technology entry requirements?",
                "Required subjects for Food Science and Technology",
                "What do I need to study Food Science and Technology?",
                "Qualifications needed for Food Science and Technology",
                "Academic requirements for Food Science and Technology",
                "Subjects required for Food Science and Technology programme",
                "Criteria for enrolling in Food Science and Technology",
                "What grades do I need for Food Science and Technology?",
                "Admission criteria for Food Science and Technology",
                "Entry qualifications for Food Science and Technology",
                "What are the entry criteria for Food Science and Technology?",
                "Food Science and Technology programme requirements",
                "Requirements to get into Food Science and Technology",
                "What subjects do I need for Food Science and Technology?",
                "Minimum qualifications for Food Science and Technology",
                "What are the academic requirements for Food Science and Technology?",
                "Required qualifications for Food Science and Technology admission",
                "What are the educational requirements for Food Science and Technology?",
                "Eligibility for Food Science and Technology programme",
                "What grades are needed for Food Science and Technology?",
                "Food Science and Technology programme entry requirements",
                "Admission criteria for Food Science and Technology course",
                "What are the prerequisites to study Food Science and Technology?",
                "Qualifications for Food Science and Technology admission",
                "Entry requirements for Food Science and Technology course",
                "What do I need to be eligible for Food Science and Technology?",
                "Required grades for Food Science and Technology programme",
                "What are the requirements to apply for Food Science and Technology?",
                "What are the necessary requirements for Food Science and Technology?",
                "Qualifications needed to enroll in Food Science and Technology",
                "What qualifications are required for Food Science and Technology?",
                "What are the qualifications for admission to Food Science and Technology?",
                "What grades must I have for Food Science and Technology?",
                "Eligibility requirements for Food Science and Technology",
                "Academic prerequisites for Food Science and Technology",
                "Subjects needed for Food Science and Technology admission",
                "Required subjects for Food Science and Technology course",
                "What are the admission requirements for Food Science and Technology?",
                "Entry qualifications needed for Food Science and Technology",
                "Food Science and Technology educational requirements",
                "What do I need to qualify for Food Science and Technology?",
                "Required academic qualifications for Food Science and Technology",
                "What are the eligibility requirements for Food Science and Technology?",
                "Subjects required to study Food Science and Technology",
                "What qualifications do I need for a Food Science and Technology degree?"
            ],
            "responses": [
                "Here are the requirements for Food Science and Technology <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in any THREE (3) subjects including: Biology, Chemistry and either Physics or Mathematics. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry, and either Physics  or Mathematics. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul><br><li><b><u>HND AND OTHER DIPLOMA </u></b></li><ul><li>An applicant from a recognized Polytechnic with Second Class (Upper Division) and (Lower Division) in the following Programmes: Food Manufacturing, Food Science, Food Technology, or Chemical Engineering, or related field. Applicants with Second Class Division or better may be admitted to Second of the Programme after a successful entrance examination. </li><li>An applicant must also satisfy the university's general admission requirement for degree Programmes. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Food Science and Technology Cutoff Points",
            "patterns": [
                "cutoff points for BSc Food Science and Technology",
                "BSc Food Science and Technology cutoff points",
                "minimum score for BSc Food Science and Technology",
                "required score for BSc Food Science and Technology",
                "aggregate for BSc Food Science and Technology",
                "what is the cutoff for BSc Food Science and Technology",
                "cutoff marks for BSc Food Science and Technology",
                "BSc Food Science and Technology required marks",
                "what aggregate do I need for BSc Food Science and Technology",
                "score needed for BSc Food Science and Technology",
                "cutoff points for food science and technology",
                "aggregate requirements for food science and technology",
                "what were the cut-off aggregates for food science and technology",
                "what are the cut-off aggregates food science and technology",
                "What is the entry aggregate for BSc Food Science and Technology?",
                "Cutoff points required for Food Science and Technology degree",
                "Aggregate needed for BSc Food Science and Technology",
                "Minimum aggregate for Food Science and Technology program",
                "What is the cutoff mark for Food Science and Technology?",
                "Score requirements for BSc Food Science and Technology",
                "Food Science and Technology cutoff aggregate",
                "What are the cutoff aggregates for BSc Food Science and Technology?",
                "Required aggregate for BSc Food Science and Technology",
                "What is the minimum score for BSc Food Science and Technology?",
                "Cutoff points for Food Science and Technology admission",
                "Aggregate marks for BSc Food Science and Technology",
                "Required marks for Food Science and Technology program",
                "Food Science and Technology program cutoff score",
                "What aggregate do I need to get into BSc Food Science and Technology?",
                "Score needed for admission to BSc Food Science and Technology",
                "Food Science and Technology cutoff marks",
                "Admission score for BSc Food Science and Technology",
                "Cutoff points to study Food Science and Technology",
                "Entry score for Food Science and Technology program",
                "What is the required aggregate for BSc Food Science and Technology?",
                "Cutoff points for Food Science and Technology degree",
                "Minimum marks required for Food Science and Technology",
                "What are the cutoff points for BSc Food Science and Technology?",
                "Score requirements for Food Science and Technology degree",
                "Food Science and Technology admission aggregate",
                "What is the entry score for BSc Food Science and Technology?",
                "Aggregate score needed for BSc Food Science and Technology",
                "Required marks for admission to Food Science and Technology",
                "Minimum aggregate score for BSc Food Science and Technology",
                "What is the minimum entry score for Food Science and Technology?",
                "Cutoff aggregates for BSc Food Science and Technology",
                "Admission requirements in terms of aggregate for Food Science and Technology",
                "Score required to get into BSc Food Science and Technology",
                "What is the cutoff point for Food Science and Technology?",
                "What aggregate is needed for Food Science and Technology?",
                "Cutoff marks required for BSc Food Science and Technology",
                "What is the minimum required aggregate for Food Science and Technology?",
                "What marks do I need for Food Science and Technology?",
                "Food Science and Technology entry aggregate",
                "Required score for admission to Food Science and Technology",
                "Minimum cutoff points for BSc Food Science and Technology",
                "Aggregate requirements for admission to Food Science and Technology",
                "What is the required score for BSc Food Science and Technology?",
                "Entry marks for BSc Food Science and Technology",
                "What cutoff points are needed for Food Science and Technology?",
                "Minimum required marks for BSc Food Science and Technology",
                "Aggregate score required for admission to Food Science and Technology",
                "What is the required entry aggregate for Food Science and Technology?"
            ],
            "responses": [
                "The cutoff points for BSc. Food Science and Technology are typically around aggregate 13. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": " Food Science and Technology fees",
            "patterns": [
                "what is the fees for Food Science and Technology",
                "Can I know the amount I will pay for Food Science and Technology",
                "Can i pay the fees in installment for Food Science and Technology?",
                "When should i pay the fees for Food Science and Technology?",
                "Can i book for a hall before paying fees for Food Science and Technology",
                "How much are the fees for . Food Science and Technology?",
                "What are the tuition fees for . Food Science and Technology?",
                "How much do I need to pay for . Food Science and Technology?",
                "What is the cost of the . Food Science and Technology programme?",
                "Can you provide the fee details for . Food Science and Technology?",
                "What is the tuition cost for . Food Science and Technology?",
                "How much is the fee for studying Food Science and Technology?",
                "What is the payment schedule for . Food Science and Technology fees?",
                "Do I have to pay the full fee for . Food Science and Technology upfront?",
                "What is the fee structure for . Food Science and Technology?",
                "Can I pay my . Food Science and Technology fees in installments?",
                "What are the fee payment options for . Food Science and Technology?",
                "How are the fees for . Food Science and Technology calculated?",
                "Are there any additional costs for . Food Science and Technology?",
                "What is the total cost of . Food Science and Technology for a year?",
                "Are there any extra fees for . Food Science and Technology?",
                "Can I get a breakdown of the . Food Science and Technology fees?",
                "What is the annual fee for . Food Science and Technology?",
                "How much does each semester cost for . Food Science and Technology?",
                "What are the miscellaneous fees for . Food Science and Technology?",
                "Are there any lab fees for . Food Science and Technology?",
                "What are the accommodation fees for . Food Science and Technology?",
                "How much are the hostel fees for . Food Science and Technology students?",
                "What is the fee for international students in . Food Science and Technology?",
                "Do international students pay higher fees for . Food Science and Technology?",
                "What is the fee for fee-paying students in . Food Science and Technology?",
                "Are there fee waivers for . Food Science and Technology?",
                "Are scholarships available to cover . Food Science and Technology fees?",
                "What are the financial aid options for . Food Science and Technology?",
                "How much should I budget for . Food Science and Technology fees?",
                "Is there a fee refund policy for . Food Science and Technology?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for . Food Science and Technology?",
                "What is the refund policy for . Food Science and Technology fees?",
                "What is the deadline for paying . Food Science and Technology fees?",
                "Can I get a fee extension for . Food Science and Technology?",
                "What is the penalty for late payment of . Food Science and Technology fees?",
                "Can I pay . Food Science and Technology fees in multiple payments?",
                "Are there any hidden costs for . Food Science and Technology?",
                "What are the compulsory fees for . Food Science and Technology?",
                "Can I pay . Food Science and Technology fees with a payment plan?",
                "How often do I need to pay fees for . Food Science and Technology?",
                "What are the semester fees for . Food Science and Technology?",
                "Is there an application fee for . Food Science and Technology?",
                "What is the registration fee for . Food Science and Technology?",
                "Are the fees for . Food Science and Technology fixed or variable?",
                "What is the cost per credit hour for . Food Science and Technology?",
                "Are there any discounts available for . Food Science and Technology fees?",
                "Can I get a fee breakdown for . Food Science and Technology?",
                "What are the non-tuition fees for . Food Science and Technology?",
                "Are there any additional charges for . Food Science and Technology?",
                "How much is the acceptance fee for . Food Science and Technology?",
                "Can I book a hall without paying the . Food Science and Technology fees?",
                "What are the hostel booking requirements for . Food Science and Technology?",
                "When are the . Food Science and Technology fees due?",
                "What is the initial deposit for . Food Science and Technology fees?",
                "How do I pay my . Food Science and Technology fees online?",
                "Are there any late fees for . Food Science and Technology?",
                "What is the mode of payment for . Food Science and Technology fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for . Food Science and Technology?",
                "How do I access my fee statement for . Food Science and Technology?",
                "What is the last date to pay fees for . Food Science and Technology?",
                "Is there an online payment option for . Food Science and Technology fees?",
                "What is the procedure for paying . Food Science and Technology fees?",
                "What is the tuition fee for the first year of . Food Science and Technology?",
                "Are there any financial aid options for . Food Science and Technology?",
                "What is included in the . Food Science and Technology fee?",
                "Can I get a fee waiver for . Food Science and Technology?"
            ],
            "responses": [
                "The fees for . Food Science and Technology programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "dietetics_requirement",
            "patterns": [
                "What are the requirements for BSc. Dietetics?",
                "Can you provide the admission criteria for BSc. Dietetics?",
                "Requirements for BSc. Dietetics programme?",
                "What are the prerequisites for BSc. Dietetics?",
                "BSc. Dietetics admission requirements?",
                "Information on eligibility for BSc. Dietetics?",
                "What are the entry requirements for BSc. Dietetics?",
                "Criteria for admission into BSc. Dietetics?",
                "BSc. Dietetics programme prerequisites?",
                "What are the criteria for BSc. Dietetics admission?",
                "Can you tell me the prerequisites for BSc. Dietetics?",
                "Eligibility criteria for BSc. Dietetics programme?",
                "What are the academic requirements for BSc. Dietetics?",
                "Admission guidelines for BSc. Dietetics?",
                "Needed qualifications for BSc. Dietetics?",
                "BSc. Dietetics entry requirements?",
                "Requirements for entering the BSc. Dietetics programme?",
                "What are the academic prerequisites for BSc. Dietetics?",
                "Admission criteria for Dietetics degree?",
                "Qualifications needed for BSc. Dietetics?",
                "What do I need to apply for BSc. Dietetics?",
                "Required subjects for BSc. Dietetics?",
                "Necessary qualifications for Dietetics program?",
                "What are the entry qualifications for BSc. Dietetics?",
                "Entry criteria for BSc. Dietetics?",
                "Academic prerequisites for BSc. Dietetics?",
                "Needed subjects for Dietetics degree?",
                "What qualifications are required for BSc. Dietetics?",
                "Admission requirements for Dietetics programme?",
                "Requirements for a Dietetics degree?",
                "What subjects do I need for BSc. Dietetics?",
                "Criteria to get into BSc. Dietetics?",
                "Required qualifications for BSc. Dietetics?",
                "Eligibility for BSc. Dietetics?",
                "Subjects required for Dietetics program?",
                "Prerequisites for studying BSc. Dietetics?",
                "What are the qualifications for BSc. Dietetics?",
                "Academic requirements for Dietetics programme?",
                "Admission qualifications for BSc. Dietetics?",
                "What are the subject requirements for BSc. Dietetics?",
                "What do I need to qualify for BSc. Dietetics?",
                "Eligibility requirements for BSc. Dietetics?",
                "What are the prerequisites for applying to BSc. Dietetics?",
                "Subjects needed for BSc. Dietetics programme?",
                "Necessary qualifications for BSc. Dietetics?",
                "What are the entry requirements for Dietetics degree?",
                "Required academic qualifications for BSc. Dietetics?",
                "Criteria for admission into Dietetics programme?",
                "What qualifications do I need for BSc. Dietetics?",
                "What are the necessary subjects for BSc. Dietetics?",
                "What are the admission prerequisites for BSc. Dietetics?",
                "Required qualifications for Dietetics degree?",
                "What are the entry prerequisites for BSc. Dietetics?",
                "BSc. Dietetics academic qualifications?",
                "Eligibility criteria for Dietetics degree?",
                "Required subjects for Dietetics programme?",
                "What are the criteria to apply for BSc. Dietetics?"            
            ],
            "responses": [
                "Here are the requirements for BSc. Dietetics <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects: </b></p><ul><li>Credit passes in Biology, Chemistry and either Physics or Mathematics OR  </li><li>Credit passes in Food & Nutrition, Management in Living, and Chemistry or Biology. </li></ul><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry, and either Physics  or Mathematics or Agricultural Science. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul><br><li><b><u>HND AND OTHER DIPLOMA </u></b></li><p>Applicants with a Higher National Diploma (HND) in Nutrition/Dietetics, Diploma in Nutrition, Dietetics or General Nursing are eligible to apply. HND Applicants with second class division or better will be considered for admission into the third year. Diploma Applicants will be considered for admission to the second year and will be required to make up for any deficiencies in Chemistry and Biology. All Applicants will be required to pass a selection interview.  </p><br><li><b><u>INTERNATIONAL APPLICANTS </u></b></li><p>Applicants with an International General Certificate of Secondary Education (IGCSE) and Interantioanl Baccalaureate (IB) or their equivalent with credit in English and Mathematics and any THREE of the following: Chemistry, Physics, Biology or Agricultural Science will be eligible for admission.  </p></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Dietetics Cutoff Points",
            "patterns": [
                "cutoff points for BSc Dietetics",
                "BSc Dietetics cutoff points",
                "minimum score for BSc Dietetics",
                "required score for BSc Dietetics",
                "aggregate for BSc Dietetics",
                "what is the cutoff for BSc Dietetics",
                "cutoff marks for BSc Dietetics",
                "BSc Dietetics required marks",
                "what aggregate do I need for BSc Dietetics",
                "score needed for BSc Dietetics",
                "cutoff points for Dietetics",
                "aggregate requirements for Dietetics",
                "what were the cut-off aggregates for Dietetics",
                "what are the cut-off aggregates Dietetics",
                "what's the minimum aggregate for BSc Dietetics",
                "needed score for Dietetics degree",
                "cutoff aggregate for BSc Dietetics",
                "what grades do I need for Dietetics",
                "aggregate score for BSc Dietetics admission",
                "BSc Dietetics required aggregate",
                "minimum marks for BSc Dietetics",
                "entry cutoff points for BSc Dietetics",
                "BSc Dietetics marks requirement",
                "cutoff scores for Dietetics programme",
                "required aggregate score for Dietetics",
                "minimum cutoff for BSc Dietetics",
                "aggregate needed for Dietetics degree",
                "Dietetics cutoff aggregates",
                "entry requirements in aggregate for BSc Dietetics",
                "what cutoff marks are needed for BSc Dietetics",
                "needed aggregate for Dietetics admission",
                "cutoff marks required for Dietetics",
                "aggregate points for BSc Dietetics",
                "BSc Dietetics entry score",
                "cutoff marks to enter Dietetics programme",
                "BSc Dietetics admission aggregate",
                "entry score needed for BSc Dietetics",
                "aggregate score for Dietetics",
                "what score do I need for Dietetics degree",
                "minimum admission score for BSc Dietetics",
                "cutoff marks for Dietetics admission",
                "required marks for Dietetics degree",
                "aggregate cutoff for BSc Dietetics",
                "minimum entry score for BSc Dietetics",
                "aggregate points required for Dietetics",
                "BSc Dietetics minimum aggregate score",
                "needed entry score for Dietetics",
                "what aggregate points are needed for Dietetics",
                "minimum score needed for Dietetics degree",
                "cutoff points needed for Dietetics",
                "Dietetics required aggregate score",
                "entry cutoff for BSc Dietetics",
                "BSc Dietetics aggregate requirements",
                "what is the required cutoff for Dietetics",
                "minimum required score for BSc Dietetics",
                "aggregate score to enter Dietetics",
                "BSc Dietetics cutoff score",
                "cutoff aggregate needed for BSc Dietetics",
                "what is the needed cutoff for Dietetics",
                "Dietetics aggregate score needed",
                "required cutoff points for BSc Dietetics",
                "BSc Dietetics entry aggregate",
                "cutoff requirements for Dietetics degree"
            
            ],
            "responses": [
                "The cutoff points for BSc. Dietetics is unknown for now since it is a newly introduced programme of study. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Dietetics fees",
            "patterns": [
                "what is the fees for Dietetics",
                "Can I know the amount I will pay for Dietetics",
                "Can i pay the fees in installment for Dietetics?",
                "When should i pay the fees for Dietetics?",
                "Can i book for a hall before paying fees for Dietetics",
                "How much are the fees for BSc. Dietetics?",
                "What are the tuition fees for BSc. Dietetics?",
                "How much do I need to pay for BSc. Dietetics?",
                "What is the cost of the BSc. Dietetics programme?",
                "Can you provide the fee details for BSc. Dietetics?",
                "What is the tuition cost for BSc. Dietetics?",
                "How much is the fee for studying Dietetics?",
                "What is the payment schedule for BSc. Dietetics fees?",
                "Do I have to pay the full fee for BSc. Dietetics upfront?",
                "What is the fee structure for BSc. Dietetics?",
                "Can I pay my BSc. Dietetics fees in installments?",
                "What are the fee payment options for BSc. Dietetics?",
                "How are the fees for BSc. Dietetics calculated?",
                "Are there any additional costs for BSc. Dietetics?",
                "What is the total cost of BSc. Dietetics for a year?",
                "Are there any extra fees for BSc. Dietetics?",
                "Can I get a breakdown of the BSc. Dietetics fees?",
                "What is the annual fee for BSc. Dietetics?",
                "How much does each semester cost for BSc. Dietetics?",
                "What are the miscellaneous fees for BSc. Dietetics?",
                "Are there any lab fees for BSc. Dietetics?",
                "What are the accommodation fees for BSc. Dietetics?",
                "How much are the hostel fees for BSc. Dietetics students?",
                "What is the fee for international students in BSc. Dietetics?",
                "Do international students pay higher fees for BSc. Dietetics?",
                "What is the fee for fee-paying students in BSc. Dietetics?",
                "Are there fee waivers for BSc. Dietetics?",
                "Are scholarships available to cover BSc. Dietetics fees?",
                "What are the financial aid options for BSc. Dietetics?",
                "How much should I budget for BSc. Dietetics fees?",
                "Is there a fee refund policy for BSc. Dietetics?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Dietetics?",
                "What is the refund policy for BSc. Dietetics fees?",
                "What is the deadline for paying BSc. Dietetics fees?",
                "Can I get a fee extension for BSc. Dietetics?",
                "What is the penalty for late payment of BSc. Dietetics fees?",
                "Can I pay BSc. Dietetics fees in multiple payments?",
                "Are there any hidden costs for BSc. Dietetics?",
                "What are the compulsory fees for BSc. Dietetics?",
                "Can I pay BSc. Dietetics fees with a payment plan?",
                "How often do I need to pay fees for BSc. Dietetics?",
                "What are the semester fees for BSc. Dietetics?",
                "Is there an application fee for BSc. Dietetics?",
                "What is the registration fee for BSc. Dietetics?",
                "Are the fees for BSc. Dietetics fixed or variable?",
                "What is the cost per credit hour for BSc. Dietetics?",
                "Are there any discounts available for BSc. Dietetics fees?",
                "Can I get a fee breakdown for BSc. Dietetics?",
                "What are the non-tuition fees for BSc. Dietetics?",
                "Are there any additional charges for BSc. Dietetics?",
                "How much is the acceptance fee for BSc. Dietetics?",
                "Can I book a hall without paying the BSc. Dietetics fees?",
                "What are the hostel booking requirements for BSc. Dietetics?",
                "When are the BSc. Dietetics fees due?",
                "What is the initial deposit for BSc. Dietetics fees?",
                "How do I pay my BSc. Dietetics fees online?",
                "Are there any late fees for BSc. Dietetics?",
                "What is the mode of payment for BSc. Dietetics fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Dietetics?",
                "How do I access my fee statement for BSc. Dietetics?",
                "What is the last date to pay fees for BSc. Dietetics?",
                "Is there an online payment option for BSc. Dietetics fees?",
                "What is the procedure for paying BSc. Dietetics fees?",
                "What is the tuition fee for the first year of BSc. Dietetics?",
                "Are there any financial aid options for BSc. Dietetics?",
                "What is included in the BSc. Dietetics fee?",
                "Can I get a fee waiver for BSc. Dietetics?"
            ],
            "responses": [
                "The fees for BSc. Dietetics programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "human_nutrition_requirement",
            "patterns": [
                "What are the requirements for BSc. Human Nutrition?",
                "Can you provide the admission criteria for BSc. Human Nutrition?",
                "Requirements for BSc. Human Nutrition programme?",
                "What are the prerequisites for BSc. Human Nutrition?",
                "BSc. Human Nutrition admission requirements?",
                "Information on eligibility for BSc. Human Nutrition?",
                "What are the entry requirements for BSc. Human Nutrition?",
                "Criteria for admission into BSc. Human Nutrition?",
                "BSc. Human Nutrition programme prerequisites?",
                "What are the qualifications needed for BSc. Human Nutrition?",
                "Admission criteria for BSc. Human Nutrition?",
                "What do I need to apply for BSc. Human Nutrition?",
                "Prerequisites for Human Nutrition programme?",
                "Eligibility for BSc. Human Nutrition?",
                "Entry criteria for BSc. Human Nutrition?",
                "What subjects are required for BSc. Human Nutrition?",
                "What grades do I need for BSc. Human Nutrition?",
                "What qualifications are needed for Human Nutrition?",
                "Requirements to study BSc. Human Nutrition?",
                "What do I need to get into Human Nutrition?",
                "Admission requirements for Human Nutrition degree?",
                "Human Nutrition programme entry requirements?",
                "What are the academic requirements for BSc. Human Nutrition?",
                "Subjects needed for BSc. Human Nutrition?",
                "What do I need to qualify for BSc. Human Nutrition?",
                "Qualifications for Human Nutrition degree?",
                "What are the subject requirements for Human Nutrition?",
                "Criteria for getting into BSc. Human Nutrition?",
                "What are the course requirements for BSc. Human Nutrition?",
                "How to qualify for BSc. Human Nutrition?",
                "BSc. Human Nutrition entry qualifications?",
                "What academic qualifications are needed for Human Nutrition?",
                "Entry requirements for BSc. Human Nutrition?",
                "What is required to study Human Nutrition?",
                "Qualifications to get into Human Nutrition?",
                "Required subjects for Human Nutrition degree?",
                "Entry criteria for Human Nutrition programme?",
                "Academic requirements for Human Nutrition degree?",
                "Necessary qualifications for BSc. Human Nutrition?",
                "What are the educational requirements for BSc. Human Nutrition?",
                "Needed qualifications for Human Nutrition?",
                "What do I need to enroll in Human Nutrition?",
                "Subjects required for BSc. Human Nutrition?",
                "Qualifications required for Human Nutrition programme?",
                "What are the prerequisites to study Human Nutrition?",
                "What are the requirements to get into BSc. Human Nutrition?",
                "Entry qualifications for BSc. Human Nutrition?",
                "Criteria for admission to Human Nutrition programme?",
                "What do I need to apply for Human Nutrition?",
                "Qualifications to apply for Human Nutrition degree?",
                "Academic criteria for BSc. Human Nutrition?",
                "What are the necessary qualifications for Human Nutrition?",
                "Requirements for admission to BSc. Human Nutrition?",
                "What do I need to qualify for Human Nutrition programme?",
                "Entry requirements for Human Nutrition degree?",
                "What subjects do I need for Human Nutrition?",
                "Required qualifications for BSc. Human Nutrition?"
            ],
            "responses": [
                "Here are the requirements for BSc. Human Nutrition <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects: </b></p><ul><li>Credit passes in Biology, Chemistry and either Physics or Mathematics OR  </li><li>Credit passes in Food & Nutrition, Management in Living, and Chemistry or Biology. </li></ul><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry, and either Physics  or Mathematics or Agricultural Science. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul><br><li><b><u>HND AND OTHER DIPLOMA </u></b></li><p>Applicants with a Higher National Diploma (HND) in Nutrition/Dietetics, Diploma in Nutrition, Dietetics or General Nursing are eligible to apply. HND Applicants with second class division or better will be considered for admission into the third year. Diploma Applicants will be considered for admission to the second year and will be required to make up for any deficiencies in Chemistry and Biology. All Applicants will be required to pass a selection interview.  </p><br><li><b><u>INTERNATIONAL APPLICANTS </u></b></li><p>Applicants with an International General Certificate of Secondary Education (IGCSE) and Interantioanl Baccalaureate (IB) or their equivalent with credit in English and Mathematics and any THREE of the following: Chemistry, Physics, Biology or Agricultural Science will be eligible for admission.  </p></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Human Nutrition Cutoff Points",
            "patterns": [
                "cutoff points for BSc Human Nutrition",
                "BSc Human Nutrition cutoff points",
                "minimum score for BSc Human Nutrition",
                "required score for BSc Human Nutrition",
                "aggregate for BSc Human Nutrition",
                "what is the cutoff for BSc Human Nutrition",
                "cutoff marks for BSc Human Nutrition",
                "BSc Human Nutrition required marks",
                "what aggregate do I need for BSc Human Nutrition",
                "score needed for BSc Human Nutrition",
                "cutoff points for Human Nutrition",
                "aggregate requirements for Human Nutrition",
                "what were the cut-off aggregates for Human Nutrition",
                "what are the cut-off aggregates Human Nutrition",
                "cutoff score for BSc Human Nutrition",
                "required cutoff for BSc Human Nutrition",
                "minimum aggregate for BSc Human Nutrition",
                "cutoff requirements for BSc Human Nutrition",
                "cutoff point for Human Nutrition degree",
                "BSc Human Nutrition cutoff score",
                "Human Nutrition programme cutoff points",
                "necessary score for BSc Human Nutrition",
                "Human Nutrition cutoff marks",
                "BSc Human Nutrition score requirements",
                "what is the minimum score for BSc Human Nutrition",
                "cutoff scores for Human Nutrition",
                "required aggregate for Human Nutrition",
                "what is the cutoff aggregate for Human Nutrition",
                "Human Nutrition required aggregate",
                "aggregate cutoff for BSc Human Nutrition",
                "required marks for BSc Human Nutrition",
                "minimum score needed for Human Nutrition",
                "cutoff points needed for Human Nutrition",
                "Human Nutrition programme cutoff score",
                "Human Nutrition required marks",
                "cutoff points for Human Nutrition degree",
                "score required for BSc Human Nutrition",
                "Human Nutrition aggregate requirements",
                "cutoff marks needed for BSc Human Nutrition",
                "required cutoff marks for Human Nutrition",
                "Human Nutrition degree cutoff scores",
                "minimum aggregate needed for Human Nutrition",
                "Human Nutrition degree required aggregate",
                "what are the cutoff points for Human Nutrition",
                "Human Nutrition required score",
                "minimum cutoff for BSc Human Nutrition",
                "cutoff aggregate for Human Nutrition programme",
                "cutoff scores for BSc Human Nutrition degree",
                "what is the required score for Human Nutrition",
                "cutoff point requirements for BSc Human Nutrition",
                "what are the cutoff marks for Human Nutrition",
                "required score for Human Nutrition degree",
                "cutoff score requirements for BSc Human Nutrition",
                "necessary aggregate for BSc Human Nutrition",
                "cutoff points and marks for Human Nutrition",
                "cutoff score for Human Nutrition programme",
                "what is the aggregate cutoff for Human Nutrition",
                "cutoff marks and scores for Human Nutrition",
                "aggregate needed for BSc Human Nutrition",
                "Human Nutrition cutoff requirements",
                "minimum cutoff score for BSc Human Nutrition",
                "cutoff points for BSc Human Nutrition degree",
                "required marks and scores for Human Nutrition"
            
            ],
            "responses": [
                "The cutoff points for BSc. Human Nutrition is unknown for now since it is a newly introduced programme of study. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Human Nutrition fees",
            "patterns": [
                "what is the fees for Human Nutrition",
                "Can I know the amount I will pay for Human Nutrition",
                "Can i pay the fees in installment for Human Nutrition?",
                "When should i pay the fees for Human Nutrition?",
                "Can i book for a hall before paying fees for Human Nutrition",
                "How much are the fees for BSc. Human Nutrition?",
                "What are the tuition fees for BSc. Human Nutrition?",
                "How much do I need to pay for BSc. Human Nutrition?",
                "What is the cost of the BSc. Human Nutrition programme?",
                "Can you provide the fee details for BSc. Human Nutrition?",
                "What is the tuition cost for BSc. Human Nutrition?",
                "How much is the fee for studying Human Nutrition?",
                "What is the payment schedule for BSc. Human Nutrition fees?",
                "Do I have to pay the full fee for BSc. Human Nutrition upfront?",
                "What is the fee structure for BSc. Human Nutrition?",
                "Can I pay my BSc. Human Nutrition fees in installments?",
                "What are the fee payment options for BSc. Human Nutrition?",
                "How are the fees for BSc. Human Nutrition calculated?",
                "Are there any additional costs for BSc. Human Nutrition?",
                "What is the total cost of BSc. Human Nutrition for a year?",
                "Are there any extra fees for BSc. Human Nutrition?",
                "Can I get a breakdown of the BSc. Human Nutrition fees?",
                "What is the annual fee for BSc. Human Nutrition?",
                "How much does each semester cost for BSc. Human Nutrition?",
                "What are the miscellaneous fees for BSc. Human Nutrition?",
                "Are there any lab fees for BSc. Human Nutrition?",
                "What are the accommodation fees for BSc. Human Nutrition?",
                "How much are the hostel fees for BSc. Human Nutrition students?",
                "What is the fee for international students in BSc. Human Nutrition?",
                "Do international students pay higher fees for BSc. Human Nutrition?",
                "What is the fee for fee-paying students in BSc. Human Nutrition?",
                "Are there fee waivers for BSc. Human Nutrition?",
                "Are scholarships available to cover BSc. Human Nutrition fees?",
                "What are the financial aid options for BSc. Human Nutrition?",
                "How much should I budget for BSc. Human Nutrition fees?",
                "Is there a fee refund policy for BSc. Human Nutrition?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Human Nutrition?",
                "What is the refund policy for BSc. Human Nutrition fees?",
                "What is the deadline for paying BSc. Human Nutrition fees?",
                "Can I get a fee extension for BSc. Human Nutrition?",
                "What is the penalty for late payment of BSc. Human Nutrition fees?",
                "Can I pay BSc. Human Nutrition fees in multiple payments?",
                "Are there any hidden costs for BSc. Human Nutrition?",
                "What are the compulsory fees for BSc. Human Nutrition?",
                "Can I pay BSc. Human Nutrition fees with a payment plan?",
                "How often do I need to pay fees for BSc. Human Nutrition?",
                "What are the semester fees for BSc. Human Nutrition?",
                "Is there an application fee for BSc. Human Nutrition?",
                "What is the registration fee for BSc. Human Nutrition?",
                "Are the fees for BSc. Human Nutrition fixed or variable?",
                "What is the cost per credit hour for BSc. Human Nutrition?",
                "Are there any discounts available for BSc. Human Nutrition fees?",
                "Can I get a fee breakdown for BSc. Human Nutrition?",
                "What are the non-tuition fees for BSc. Human Nutrition?",
                "Are there any additional charges for BSc. Human Nutrition?",
                "How much is the acceptance fee for BSc. Human Nutrition?",
                "Can I book a hall without paying the BSc. Human Nutrition fees?",
                "What are the hostel booking requirements for BSc. Human Nutrition?",
                "When are the BSc. Human Nutrition fees due?",
                "What is the initial deposit for BSc. Human Nutrition fees?",
                "How do I pay my BSc. Human Nutrition fees online?",
                "Are there any late fees for BSc. Human Nutrition?",
                "What is the mode of payment for BSc. Human Nutrition fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Human Nutrition?",
                "How do I access my fee statement for BSc. Human Nutrition?",
                "What is the last date to pay fees for BSc. Human Nutrition?",
                "Is there an online payment option for BSc. Human Nutrition fees?",
                "What is the procedure for paying BSc. Human Nutrition fees?",
                "What is the tuition fee for the first year of BSc. Human Nutrition?",
                "Are there any financial aid options for BSc. Human Nutrition?",
                "What is included in the BSc. Human Nutrition fee?",
                "Can I get a fee waiver for BSc. Human Nutrition?"
            ],
            "responses": [
                "The fees for BSc. Human Nutrition programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "biological_sciences_requirement",
            "patterns": [
                "What are the requirements for BSc. Biological Sciences?",
                "Can you provide the admission criteria for BSc. Biological Sciences?",
                "Requirements for BSc. Biological Sciences programme?",
                "What are the prerequisites for BSc. Biological Sciences?",
                "BSc. Biological Sciences admission requirements?",
                "Information on eligibility for BSc. Biological Sciences?",
                "What are the entry requirements for BSc. Biological Sciences?",
                "Criteria for admission into BSc. Biological Sciences?",
                "BSc. Biological Sciences programme prerequisites?",
                "admission requirements for BSc. Biological Sciences",
                "entry criteria for BSc. Biological Sciences",
                "what are the qualifications needed for BSc. Biological Sciences",
                "eligibility criteria for BSc. Biological Sciences",
                "necessary qualifications for BSc. Biological Sciences",
                "BSc. Biological Sciences qualification requirements",
                "academic requirements for BSc. Biological Sciences",
                "what do I need to study BSc. Biological Sciences",
                "prerequisites for Biological Sciences programme",
                "what are the necessary subjects for BSc. Biological Sciences",
                "minimum requirements for BSc. Biological Sciences",
                "BSc. Biological Sciences entry requirements",
                "what are the basic requirements for BSc. Biological Sciences",
                "criteria needed for BSc. Biological Sciences",
                "requirements for studying BSc. Biological Sciences",
                "what are the academic requirements for BSc. Biological Sciences",
                "needed subjects for BSc. Biological Sciences",
                "what are the needed qualifications for BSc. Biological Sciences",
                "eligibility requirements for BSc. Biological Sciences",
                "subjects required for BSc. Biological Sciences",
                "what qualifications are required for BSc. Biological Sciences",
                "requirements to enroll in BSc. Biological Sciences",
                "what are the qualifications to study BSc. Biological Sciences",
                "academic criteria for BSc. Biological Sciences",
                "requirements to get into BSc. Biological Sciences",
                "BSc. Biological Sciences eligibility",
                "academic prerequisites for BSc. Biological Sciences",
                "what are the admission requirements for Biological Sciences",
                "requirements to apply for BSc. Biological Sciences",
                "BSc. Biological Sciences subject requirements",
                "needed qualifications for BSc. Biological Sciences",
                "entry qualifications for BSc. Biological Sciences",
                "necessary academic qualifications for BSc. Biological Sciences",
                "criteria for getting into BSc. Biological Sciences",
                "what are the entry subjects for BSc. Biological Sciences",
                "subjects needed for BSc. Biological Sciences",
                "BSc. Biological Sciences application requirements",
                "needed criteria for BSc. Biological Sciences",
                "entry requirements for studying BSc. Biological Sciences",
                "required qualifications for BSc. Biological Sciences",
                "qualifications needed to enroll in BSc. Biological Sciences",
                "subjects required for studying BSc. Biological Sciences",
                "what are the qualifications for BSc. Biological Sciences",
                "BSc. Biological Sciences qualifications",
                "entry requirements for Biological Sciences",
                "requirements for BSc. Biological Sciences admission",
                "eligibility to study BSc. Biological Sciences",
                "what are the prerequisites for Biological Sciences",
                "necessary requirements for BSc. Biological Sciences"
            ],
            "responses": [
                "Here are the requirements for BSc. Biological Sciences <ul><li><b><u>WASSCE/SSSCE APPLICANTS</u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and either Physics or Mathematics. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry, and either Physics or Mathematics. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><p>Applicants should be at least 25 years at the time of the application.  </p><p>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </p><p>Short-listed applicants may take an Entrance Examination and pass an interview. </p></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Biological Science Cutoff Points",
            "patterns": [
                "cutoff points for BSc Biological Science",
                "BSc Biological Science cutoff points",
                "minimum score for BSc Biological Science",
                "required score for BSc Biological Science",
                "aggregate for BSc Biological Science",
                "what is the cutoff for BSc Biological Science",
                "cutoff marks for BSc Biological Science",
                "BSc Biological Science required marks",
                "what aggregate do I need for BSc Biological Science",
                "score needed for BSc Biological Science",
                "cutoff points for biological science",
                "aggregate requirements for biological science",
                "what were the cut-off aggregates for biological science",
                "what are the cut-off aggregates biological science",
                "what is the cutoff score for BSc Biological Science",
                "BSc Biological Science minimum aggregate",
                "what cutoff is needed for BSc Biological Science",
                "required cutoff for BSc Biological Science",
                "aggregate score for BSc Biological Science",
                "BSc Biological Science entry cutoff points",
                "what are the cutoff points for Biological Science",
                "minimum aggregate for BSc Biological Science",
                "BSc Biological Science cutoff requirements",
                "score requirements for BSc Biological Science",
                "BSc Biological Science aggregate cutoff",
                "cutoff marks for Biological Science",
                "required aggregate for Biological Science",
                "what aggregate is needed for Biological Science",
                "BSc Biological Science entry score",
                "cutoff aggregate for BSc Biological Science",
                "what were the cutoff marks for BSc Biological Science",
                "cutoff score for studying Biological Science",
                "entry marks for BSc Biological Science",
                "BSc Biological Science admission cutoff",
                "minimum entry score for BSc Biological Science",
                "aggregate requirements for BSc Biological Science",
                "what cutoff marks are needed for Biological Science",
                "Biological Science BSc entry aggregate",
                "BSc Biological Science score requirements",
                "cutoff for entry into BSc Biological Science",
                "what cutoff is required for Biological Science",
                "BSc Biological Science minimum score requirements",
                "what are the cutoff marks for Biological Science",
                "Biological Science cutoff points for admission",
                "cutoff points needed for BSc Biological Science",
                "required entry score for Biological Science",
                "minimum cutoff for BSc Biological Science",
                "entry requirements for BSc Biological Science",
                "cutoff aggregate for studying Biological Science",
                "Biological Science admission score",
                "BSc Biological Science minimum entry points",
                "cutoff aggregate for Biological Science",
                "what is the minimum aggregate for Biological Science",
                "BSc Biological Science admission requirements",
                "score needed to enter BSc Biological Science",
                "cutoff requirements for BSc Biological Science",
                "minimum aggregate score for Biological Science",
                "what aggregate do I need for Biological Science",
                "Biological Science BSc entry requirements",
                "BSc Biological Science cutoff information",
                "cutoff points for admission to Biological Science",
                "required cutoff points for Biological Science"
            ],
            "responses": [
                "The cutoff points for BSc. Biological Science are typically around aggregate 12. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Biological Sciences fees",
            "patterns": [
                "what is the fees for Biological Sciences",
                "Can I know the amount I will pay for Biological Sciences",
                "Can i pay the fees in installment for Biological Sciences?",
                "When should i pay the fees for Biological Sciences?",
                "Can i book for a hall before paying fees for Biological Sciences",
                "How much are the fees for BSc. Biological Sciences?",
                "What are the tuition fees for BSc. Biological Sciences?",
                "How much do I need to pay for BSc. Biological Sciences?",
                "What is the cost of the BSc. Biological Sciences programme?",
                "Can you provide the fee details for BSc. Biological Sciences?",
                "What is the tuition cost for BSc. Biological Sciences?",
                "How much is the fee for studying Biological Sciences?",
                "What is the payment schedule for BSc. Biological Sciences fees?",
                "Do I have to pay the full fee for BSc. Biological Sciences upfront?",
                "What is the fee structure for BSc. Biological Sciences?",
                "Can I pay my BSc. Biological Sciences fees in installments?",
                "What are the fee payment options for BSc. Biological Sciences?",
                "How are the fees for BSc. Biological Sciences calculated?",
                "Are there any additional costs for BSc. Biological Sciences?",
                "What is the total cost of BSc. Biological Sciences for a year?",
                "Are there any extra fees for BSc. Biological Sciences?",
                "Can I get a breakdown of the BSc. Biological Sciences fees?",
                "What is the annual fee for BSc. Biological Sciences?",
                "How much does each semester cost for BSc. Biological Sciences?",
                "What are the miscellaneous fees for BSc. Biological Sciences?",
                "Are there any lab fees for BSc. Biological Sciences?",
                "What are the accommodation fees for BSc. Biological Sciences?",
                "How much are the hostel fees for BSc. Biological Sciences students?",
                "What is the fee for international students in BSc. Biological Sciences?",
                "Do international students pay higher fees for BSc. Biological Sciences?",
                "What is the fee for fee-paying students in BSc. Biological Sciences?",
                "Are there fee waivers for BSc. Biological Sciences?",
                "Are scholarships available to cover BSc. Biological Sciences fees?",
                "What are the financial aid options for BSc. Biological Sciences?",
                "How much should I budget for BSc. Biological Sciences fees?",
                "Is there a fee refund policy for BSc. Biological Sciences?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Biological Sciences?",
                "What is the refund policy for BSc. Biological Sciences fees?",
                "What is the deadline for paying BSc. Biological Sciences fees?",
                "Can I get a fee extension for BSc. Biological Sciences?",
                "What is the penalty for late payment of BSc. Biological Sciences fees?",
                "Can I pay BSc. Biological Sciences fees in multiple payments?",
                "Are there any hidden costs for BSc. Biological Sciences?",
                "What are the compulsory fees for BSc. Biological Sciences?",
                "Can I pay BSc. Biological Sciences fees with a payment plan?",
                "How often do I need to pay fees for BSc. Biological Sciences?",
                "What are the semester fees for BSc. Biological Sciences?",
                "Is there an application fee for BSc. Biological Sciences?",
                "What is the registration fee for BSc. Biological Sciences?",
                "Are the fees for BSc. Biological Sciences fixed or variable?",
                "What is the cost per credit hour for BSc. Biological Sciences?",
                "Are there any discounts available for BSc. Biological Sciences fees?",
                "Can I get a fee breakdown for BSc. Biological Sciences?",
                "What are the non-tuition fees for BSc. Biological Sciences?",
                "Are there any additional charges for BSc. Biological Sciences?",
                "How much is the acceptance fee for BSc. Biological Sciences?",
                "Can I book a hall without paying the BSc. Biological Sciences fees?",
                "What are the hostel booking requirements for BSc. Biological Sciences?",
                "When are the BSc. Biological Sciences fees due?",
                "What is the initial deposit for BSc. Biological Sciences fees?",
                "How do I pay my BSc. Biological Sciences fees online?",
                "Are there any late fees for BSc. Biological Sciences?",
                "What is the mode of payment for BSc. Biological Sciences fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Biological Sciences?",
                "How do I access my fee statement for BSc. Biological Sciences?",
                "What is the last date to pay fees for BSc. Biological Sciences?",
                "Is there an online payment option for BSc. Biological Sciences fees?",
                "What is the procedure for paying BSc. Biological Sciences fees?",
                "What is the tuition fee for the first year of BSc. Biological Sciences?",
                "Are there any financial aid options for BSc. Biological Sciences?",
                "What is included in the BSc. Biological Sciences fee?",
                "Can I get a fee waiver for BSc. Biological Sciences?"
            ],
            "responses": [
                "The fees for BSc. Biological Sciences programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "environmental_sciences_requirement",
            "patterns": [
                "What are the requirements for BSc. Environmental Sciences?",
                "Can you provide the admission criteria for BSc. Environmental Sciences?",
                "Requirements for BSc. Environmental Sciences programme?",
                "What are the prerequisites for BSc. Environmental Sciences?",
                "BSc. Environmental Sciences admission requirements?",
                "Information on eligibility for BSc. Environmental Sciences?",
                "What are the entry requirements for BSc. Environmental Sciences?",
                "Criteria for admission into BSc. Environmental Sciences?",
                "BSc. Environmental Sciences programme prerequisites?",
                "requirements for BSc Environmental Sciences",
                "admission criteria for BSc Environmental Sciences",
                "entry requirements for BSc Environmental Sciences",
                "prerequisites for BSc Environmental Sciences",
                "BSc Environmental Sciences admission criteria",
                "eligibility for BSc Environmental Sciences",
                "BSc Environmental Sciences programme requirements",
                "criteria for BSc Environmental Sciences admission",
                "requirements for enrolling in BSc Environmental Sciences",
                "BSc Environmental Sciences prerequisites",
                "what is needed for BSc Environmental Sciences",
                "admission requirements for Environmental Sciences",
                "what are the requirements for BSc Environmental Sciences",
                "BSc Environmental Sciences eligibility criteria",
                "BSc Environmental Sciences programme prerequisites",
                "BSc Environmental Sciences criteria",
                "requirements for the Environmental Sciences degree",
                "admission requirements for Environmental Sciences programme",
                "BSc Environmental Sciences core and elective subjects",
                "BSc Environmental Sciences general admission criteria",
                "criteria for entry into BSc Environmental Sciences",
                "what do I need to apply for BSc Environmental Sciences",
                "requirements for BSc in Environmental Sciences",
                "prerequisites for Environmental Sciences degree",
                "BSc Environmental Sciences admission details",
                "what are the entry requirements for Environmental Sciences",
                "BSc Environmental Sciences application criteria",
                "requirements for BSc Environmental Sciences course",
                "BSc Environmental Sciences application requirements",
                "BSc Environmental Sciences admission details",
                "Environmental Sciences programme entry requirements",
                "admission details for BSc Environmental Sciences",
                "BSc Environmental Sciences academic requirements",
                "what is needed to qualify for BSc Environmental Sciences",
                "BSc Environmental Sciences prerequisites and requirements",
                "admission criteria for Environmental Sciences degree",
                "requirements to get into BSc Environmental Sciences",
                "BSc Environmental Sciences programme admission",
                "requirements for admission to BSc Environmental Sciences",
                "BSc Environmental Sciences entry qualifications",
                "what is required for BSc Environmental Sciences",
                "BSc Environmental Sciences eligibility and requirements",
                "admission prerequisites for Environmental Sciences",
                "entry criteria for BSc Environmental Sciences",
                "admission requirements for Environmental Sciences course",
                "BSc Environmental Sciences entry qualifications",
                "prerequisites for BSc in Environmental Sciences",
                "what are the academic requirements for BSc Environmental Sciences"
            ],
            "responses": [
                "Here are the requirements for BSc. Environmental Sciences <ul><li><b><u>WASSCE/SSSCE APPLICANTS</u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Chemistry and either Physics or Mathematics. <i>Agricultural Science is acceptable in place of Biology. </i></p><br><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Biology, Chemistry, and either Physics or Mathematics. <i>Agricultural Science is acceptable in place of Biology. </i></p><br><br><li><b><u>MATURE APPLICANTS </u></b></li><p>Applicants should be at least 25 years at the time of the application.  </p><p>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </p><p>Short-listed applicants may take an Entrance Examination and pass an interview. <i>Agricultural Science is acceptable in place of Biology. </i></p><br><br><li><b><u>HND AND OTHER DIPLOMA</u></b></li><ul><li>Applicants with a Higher National Diploma (HND) in a science related programme for a recognised institution may be admitted to the third year of the BSc. Environmental Science Programme. Applicants with a Diploma Environmental Sanitation and related disciplines may be admitted into the second year of the BSC. Environmental Science Programme. </li><li>Applicants with Second Class Division or better will be considered for admission into the SECOND YEAR of the Programme and will be required to make up their deficiencies in Biology and Chemistry.  </li><li>Applicants with another Diploma will be admitted into the first year of the programme.  </li><li>Such applicants must also satisfy the university's general admission requirement for degree Programmes. </li><li>Agricultural Science is acceptable in replace Biology. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Environmental Sciences Cutoff Points",
            "patterns": [
                "cutoff points for BSc Environmental Sciences",
                "BSc Environmental Sciences cutoff points",
                "minimum score for BSc Environmental Sciences",
                "required score for BSc Environmental Sciences",
                "aggregate for BSc Environmental Sciences",
                "what is the cutoff for BSc Environmental Sciences",
                "cutoff marks for BSc Environmental Sciences",
                "BSc Environmental Sciences required marks",
                "what aggregate do I need for BSc Environmental Sciences",
                "score needed for BSc Environmental Sciences",
                "cutoff points for environmental sciences",
                "aggregate requirements for environmental sciences",
                "what were the cut-off aggregates for environmental sciences",
                "what are the cut-off aggregates environmental sciences",
                "what is the minimum aggregate for BSc Environmental Sciences",
                "BSc Environmental Sciences minimum aggregate score",
                "required cutoff for BSc Environmental Sciences",
                "BSc Environmental Sciences aggregate requirements",
                "score required for BSc Environmental Sciences",
                "cutoff scores for BSc Environmental Sciences",
                "BSc Environmental Sciences cut-off points",
                "BSc Environmental Sciences entry aggregate",
                "what is the required score for BSc Environmental Sciences",
                "aggregate score needed for BSc Environmental Sciences",
                "minimum score required for BSc Environmental Sciences",
                "BSc Environmental Sciences required aggregate score",
                "cutoff marks needed for BSc Environmental Sciences",
                "BSc Environmental Sciences cutoff marks",
                "what cutoff is needed for BSc Environmental Sciences",
                "required aggregate points for BSc Environmental Sciences",
                "BSc Environmental Sciences cutoff details",
                "BSc Environmental Sciences score requirements",
                "BSc Environmental Sciences admission cutoff",
                "cutoff aggregate for BSc Environmental Sciences",
                "BSc Environmental Sciences minimum marks",
                "BSc Environmental Sciences aggregate cutoff",
                "what are the cutoff marks for BSc Environmental Sciences",
                "BSc Environmental Sciences entry score",
                "BSc Environmental Sciences score cutoff",
                "cutoff points required for BSc Environmental Sciences",
                "BSc Environmental Sciences required cut-off points",
                "BSc Environmental Sciences qualifying score",
                "BSc Environmental Sciences admission score",
                "required cutoff points for BSc Environmental Sciences",
                "BSc Environmental Sciences minimum entry aggregate",
                "aggregate points for BSc Environmental Sciences admission",
                "BSc Environmental Sciences cutoff requirements",
                "what are the aggregate requirements for BSc Environmental Sciences",
                "BSc Environmental Sciences entry aggregate score",
                "BSc Environmental Sciences cutoff marks details",
                "cutoff aggregate points for Environmental Sciences",
                "BSc Environmental Sciences minimum required score",
                "what cutoff points are needed for Environmental Sciences",
                "BSc Environmental Sciences score needed for admission",
                "cutoff scores for Environmental Sciences degree",
                "BSc Environmental Sciences minimum required aggregate",
                "BSc Environmental Sciences required entry points",
                "what is the required cutoff for Environmental Sciences",
                "BSc Environmental Sciences minimum cutoff score",
                "BSc Environmental Sciences qualifying aggregate",
                "cutoff details for BSc Environmental Sciences",
                "what aggregate is needed for Environmental Sciences",
                "BSc Environmental Sciences admission score requirements"
            ],
            "responses": [
                "The cutoff points for BSc. Environmental Sciences are typically around aggregate 15. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Environmental Sciences fees",
            "patterns": [
                "what is the fees for Environmental Sciences",
                "Can I know the amount I will pay for Environmental Sciences",
                "Can i pay the fees in installment for Environmental Sciences?",
                "When should i pay the fees for Environmental Sciences?",
                "Can i book for a hall before paying fees for Environmental Sciences",
                "How much are the fees for BSc. Environmental Sciences?",
                "What are the tuition fees for BSc. Environmental Sciences?",
                "How much do I need to pay for BSc. Environmental Sciences?",
                "What is the cost of the BSc. Environmental Sciences programme?",
                "Can you provide the fee details for BSc. Environmental Sciences?",
                "What is the tuition cost for BSc. Environmental Sciences?",
                "How much is the fee for studying Environmental Sciences?",
                "What is the payment schedule for BSc. Environmental Sciences fees?",
                "Do I have to pay the full fee for BSc. Environmental Sciences upfront?",
                "What is the fee structure for BSc. Environmental Sciences?",
                "Can I pay my BSc. Environmental Sciences fees in installments?",
                "What are the fee payment options for BSc. Environmental Sciences?",
                "How are the fees for BSc. Environmental Sciences calculated?",
                "Are there any additional costs for BSc. Environmental Sciences?",
                "What is the total cost of BSc. Environmental Sciences for a year?",
                "Are there any extra fees for BSc. Environmental Sciences?",
                "Can I get a breakdown of the BSc. Environmental Sciences fees?",
                "What is the annual fee for BSc. Environmental Sciences?",
                "How much does each semester cost for BSc. Environmental Sciences?",
                "What are the miscellaneous fees for BSc. Environmental Sciences?",
                "Are there any lab fees for BSc. Environmental Sciences?",
                "What are the accommodation fees for BSc. Environmental Sciences?",
                "How much are the hostel fees for BSc. Environmental Sciences students?",
                "What is the fee for international students in BSc. Environmental Sciences?",
                "Do international students pay higher fees for BSc. Environmental Sciences?",
                "What is the fee for fee-paying students in BSc. Environmental Sciences?",
                "Are there fee waivers for BSc. Environmental Sciences?",
                "Are scholarships available to cover BSc. Environmental Sciences fees?",
                "What are the financial aid options for BSc. Environmental Sciences?",
                "How much should I budget for BSc. Environmental Sciences fees?",
                "Is there a fee refund policy for BSc. Environmental Sciences?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Environmental Sciences?",
                "What is the refund policy for BSc. Environmental Sciences fees?",
                "What is the deadline for paying BSc. Environmental Sciences fees?",
                "Can I get a fee extension for BSc. Environmental Sciences?",
                "What is the penalty for late payment of BSc. Environmental Sciences fees?",
                "Can I pay BSc. Environmental Sciences fees in multiple payments?",
                "Are there any hidden costs for BSc. Environmental Sciences?",
                "What are the compulsory fees for BSc. Environmental Sciences?",
                "Can I pay BSc. Environmental Sciences fees with a payment plan?",
                "How often do I need to pay fees for BSc. Environmental Sciences?",
                "What are the semester fees for BSc. Environmental Sciences?",
                "Is there an application fee for BSc. Environmental Sciences?",
                "What is the registration fee for BSc. Environmental Sciences?",
                "Are the fees for BSc. Environmental Sciences fixed or variable?",
                "What is the cost per credit hour for BSc. Environmental Sciences?",
                "Are there any discounts available for BSc. Environmental Sciences fees?",
                "Can I get a fee breakdown for BSc. Environmental Sciences?",
                "What are the non-tuition fees for BSc. Environmental Sciences?",
                "Are there any additional charges for BSc. Environmental Sciences?",
                "How much is the acceptance fee for BSc. Environmental Sciences?",
                "Can I book a hall without paying the BSc. Environmental Sciences fees?",
                "What are the hostel booking requirements for BSc. Environmental Sciences?",
                "When are the BSc. Environmental Sciences fees due?",
                "What is the initial deposit for BSc. Environmental Sciences fees?",
                "How do I pay my BSc. Environmental Sciences fees online?",
                "Are there any late fees for BSc. Environmental Sciences?",
                "What is the mode of payment for BSc. Environmental Sciences fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Environmental Sciences?",
                "How do I access my fee statement for BSc. Environmental Sciences?",
                "What is the last date to pay fees for BSc. Environmental Sciences?",
                "Is there an online payment option for BSc. Environmental Sciences fees?",
                "What is the procedure for paying BSc. Environmental Sciences fees?",
                "What is the tuition fee for the first year of BSc. Environmental Sciences?",
                "Are there any financial aid options for BSc. Environmental Sciences?",
                "What is included in the BSc. Environmental Sciences fee?",
                "Can I get a fee waiver for BSc. Environmental Sciences?"
            ],
            "responses": [
                "The fees for BSc. Environmental Sciences programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "optometry_requirement",
            "patterns": [
                "What are the requirements for Doctor of Optometry (OD)?",
                "Can you provide the admission criteria for Doctor of Optometry?",
                "Requirements for Doctor of Optometry programme?",
                "What are the prerequisites for Doctor of Optometry?",
                "Doctor of Optometry admission requirements?",
                "Information on eligibility for Doctor of Optometry?",
                "What are the entry requirements for Doctor of Optometry?",
                "Criteria for admission into Doctor of Optometry?",
                "Doctor of Optometry programme prerequisites?",
                "What are the admission requirements for Doctor of Optometry (OD)?",
                "Doctor of Optometry programme requirements?",
                "What are the prerequisites for the Doctor of Optometry programme?",
                "Admission criteria for Doctor of Optometry (OD)?",
                "Requirements for enrolling in Doctor of Optometry?",
                "Doctor of Optometry entry requirements?",
                "What qualifications do I need for Doctor of Optometry?",
                "What are the eligibility criteria for Doctor of Optometry?",
                "What are the core requirements for Doctor of Optometry?",
                "Prerequisites for applying to Doctor of Optometry?",
                "Doctor of Optometry admission criteria?",
                "What subjects are required for Doctor of Optometry?",
                "What do I need to apply for Doctor of Optometry?",
                "Core subjects needed for Doctor of Optometry?",
                "Requirements for OD programme?",
                "What are the minimum requirements for Doctor of Optometry?",
                "What subjects are required for admission into Doctor of Optometry?",
                "Doctor of Optometry application requirements?",
                "Can you list the requirements for Doctor of Optometry?",
                "Doctor of Optometry programme admission requirements?",
                "What are the general admission criteria for Doctor of Optometry?",
                "What is needed for entry into Doctor of Optometry?",
                "What do I need to qualify for Doctor of Optometry?",
                "Doctor of Optometry requirements for WASSCE/SSSCE?",
                "Doctor of Optometry programme prerequisites?",
                "What qualifications are needed for Doctor of Optometry programme?",
                "What is the admission process for Doctor of Optometry?",
                "Doctor of Optometry entry criteria?",
                "What are the required subjects for Doctor of Optometry?",
                "What do I need to meet the requirements for Doctor of Optometry?",
                "Doctor of Optometry entry qualifications?",
                "Doctor of Optometry programme entry requirements?",
                "What are the specific requirements for Doctor of Optometry?",
                "What qualifications are needed to apply for Doctor of Optometry?",
                "What is the criteria for admission into Doctor of Optometry?",
                "What are the core admission requirements for Doctor of Optometry?",
                "Doctor of Optometry programme admission criteria?",
                "What is required for Doctor of Optometry admission?",
                "What are the specific prerequisites for Doctor of Optometry?",
                "Admission requirements for OD programme?",
                "Doctor of Optometry qualification criteria?",
                "What do I need to qualify for the Doctor of Optometry programme?",
                "What are the eligibility requirements for Doctor of Optometry?",
                "What subjects do I need for Doctor of Optometry admission?",
                "Doctor of Optometry application criteria?",
                "What are the prerequisites for applying to Doctor of Optometry?",
                "Doctor of Optometry entry requirements and criteria?",
                "What qualifications are required for OD programme admission?"
            ],
            "responses": [
                "Here are the requirements for Doctor of Optometry (OD) <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Biology, Physics, and either Chemistry or Mathematics. Shortlisted applicants are expected to pass an interview. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects: Biology, Chemistry, Physics or Additional Mathematics, English Language, and Mathematics. </p><p><b>'A' Level or equivalent:</b>  Credit passes in THREE (3) subjects including Biology, Physics, and Chemistry or Mathematics.  </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li><li>Foreign students who have credit from Optometric courses will be required to present an official English translation and pass an interview, if shortlisted. Foreign students with BSc. in Natural Sciences such as Biology, Biochemistry, and Physics will be admitted after passing an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "Doctor of Optometry Cutoff Points",
            "patterns": [
                "cutoff points for Doctor of Optometry",
                "Doctor of Optometry cutoff points",
                "minimum score for Doctor of Optometry",
                "required score for Doctor of Optometry",
                "aggregate for Doctor of Optometry",
                "what is the cutoff for Doctor of Optometry",
                "cutoff marks for Doctor of Optometry",
                "Doctor of Optometry required marks",
                "what aggregate do I need for Doctor of Optometry",
                "score needed for Doctor of Optometry",
                "cutoff points for optometry",
                "aggregate requirements for optometry",
                "what were the cut-off aggregates for optometry",
                "what are the cut-off aggregates optometry",
                "What are the cutoff points for Doctor of Optometry?",
                "Doctor of Optometry minimum cutoff score?",
                "Required aggregate score for Doctor of Optometry?",
                "Doctor of Optometry admission cutoff marks?",
                "What is the required score for Doctor of Optometry?",
                "What is the cutoff aggregate for Doctor of Optometry?",
                "Doctor of Optometry cutoff aggregate?",
                "What are the cut-off points for Doctor of Optometry?",
                "Aggregate score needed for Doctor of Optometry?",
                "Minimum cutoff for Doctor of Optometry?",
                "Score required for Doctor of Optometry admission?",
                "What are the cutoff marks for Doctor of Optometry?",
                "Doctor of Optometry cutoff requirements?",
                "What is the aggregate for Doctor of Optometry?",
                "Doctor of Optometry admission requirements cutoff points?",
                "Cutoff points needed for Doctor of Optometry?",
                "What cutoff is required for Doctor of Optometry?",
                "Doctor of Optometry cut-off marks?",
                "Aggregate needed for Doctor of Optometry admission?",
                "Doctor of Optometry admission score?",
                "Required cutoff points for Doctor of Optometry?",
                "Doctor of Optometry cutoff aggregate score?",
                "What are the aggregate requirements for Doctor of Optometry?",
                "Cutoff score for Doctor of Optometry programme?",
                "Doctor of Optometry score cutoff?",
                "What cutoff is necessary for Doctor of Optometry?",
                "Doctor of Optometry admission cutoff score?",
                "What cutoff marks are needed for Doctor of Optometry?",
                "Doctor of Optometry required cutoff points?",
                "Minimum score for admission to Doctor of Optometry?",
                "Cutoff points for admission into Doctor of Optometry?",
                "What are the aggregate scores for Doctor of Optometry?",
                "Doctor of Optometry programme cutoff points?",
                "Doctor of Optometry cut-off score for admission?",
                "What is the cutoff score for Doctor of Optometry programme?",
                "Doctor of Optometry entry cutoff points?",
                "Aggregate score for Doctor of Optometry entry?",
                "Cutoff points for Doctor of Optometry programme?",
                "Doctor of Optometry required scores?",
                "What is the aggregate requirement for Doctor of Optometry?",
                "Doctor of Optometry programme score requirements?",
                "Doctor of Optometry admissions cutoff marks?",
                "Required marks for Doctor of Optometry?",
                "What is the cut-off aggregate for Doctor of Optometry?",
                "Doctor of Optometry entry requirements cutoff?",
                "Doctor of Optometry cutoff score details?",
                "Cutoff points needed for Doctor of Optometry admission?"
            ],
            "responses": [
                "The cutoff points for Doctor of Optometry are typically around aggregate 09. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": " Doctor of Optometry fees",
            "patterns": [
                "what is the fees for Doctor of Optometry",
                "Can I know the amount I will pay for Doctor of Optometry",
                "Can i pay the fees in installment for Doctor of Optometry?",
                "When should i pay the fees for Doctor of Optometry?",
                "Can i book for a hall before paying fees for Doctor of Optometry",
                "How much are the fees for . Doctor of Optometry?",
                "What are the tuition fees for . Doctor of Optometry?",
                "How much do I need to pay for . Doctor of Optometry?",
                "What is the cost of the . Doctor of Optometry programme?",
                "Can you provide the fee details for . Doctor of Optometry?",
                "What is the tuition cost for . Doctor of Optometry?",
                "How much is the fee for studying Doctor of Optometry?",
                "What is the payment schedule for . Doctor of Optometry fees?",
                "Do I have to pay the full fee for . Doctor of Optometry upfront?",
                "What is the fee structure for . Doctor of Optometry?",
                "Can I pay my . Doctor of Optometry fees in installments?",
                "What are the fee payment options for . Doctor of Optometry?",
                "How are the fees for . Doctor of Optometry calculated?",
                "Are there any additional costs for . Doctor of Optometry?",
                "What is the total cost of . Doctor of Optometry for a year?",
                "Are there any extra fees for . Doctor of Optometry?",
                "Can I get a breakdown of the . Doctor of Optometry fees?",
                "What is the annual fee for . Doctor of Optometry?",
                "How much does each semester cost for . Doctor of Optometry?",
                "What are the miscellaneous fees for . Doctor of Optometry?",
                "Are there any lab fees for . Doctor of Optometry?",
                "What are the accommodation fees for . Doctor of Optometry?",
                "How much are the hostel fees for . Doctor of Optometry students?",
                "What is the fee for international students in . Doctor of Optometry?",
                "Do international students pay higher fees for . Doctor of Optometry?",
                "What is the fee for fee-paying students in . Doctor of Optometry?",
                "Are there fee waivers for . Doctor of Optometry?",
                "Are scholarships available to cover . Doctor of Optometry fees?",
                "What are the financial aid options for . Doctor of Optometry?",
                "How much should I budget for . Doctor of Optometry fees?",
                "Is there a fee refund policy for . Doctor of Optometry?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for . Doctor of Optometry?",
                "What is the refund policy for . Doctor of Optometry fees?",
                "What is the deadline for paying . Doctor of Optometry fees?",
                "Can I get a fee extension for . Doctor of Optometry?",
                "What is the penalty for late payment of . Doctor of Optometry fees?",
                "Can I pay . Doctor of Optometry fees in multiple payments?",
                "Are there any hidden costs for . Doctor of Optometry?",
                "What are the compulsory fees for . Doctor of Optometry?",
                "Can I pay . Doctor of Optometry fees with a payment plan?",
                "How often do I need to pay fees for . Doctor of Optometry?",
                "What are the semester fees for . Doctor of Optometry?",
                "Is there an application fee for . Doctor of Optometry?",
                "What is the registration fee for . Doctor of Optometry?",
                "Are the fees for . Doctor of Optometry fixed or variable?",
                "What is the cost per credit hour for . Doctor of Optometry?",
                "Are there any discounts available for . Doctor of Optometry fees?",
                "Can I get a fee breakdown for . Doctor of Optometry?",
                "What are the non-tuition fees for . Doctor of Optometry?",
                "Are there any additional charges for . Doctor of Optometry?",
                "How much is the acceptance fee for . Doctor of Optometry?",
                "Can I book a hall without paying the . Doctor of Optometry fees?",
                "What are the hostel booking requirements for . Doctor of Optometry?",
                "When are the . Doctor of Optometry fees due?",
                "What is the initial deposit for . Doctor of Optometry fees?",
                "How do I pay my . Doctor of Optometry fees online?",
                "Are there any late fees for . Doctor of Optometry?",
                "What is the mode of payment for . Doctor of Optometry fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for . Doctor of Optometry?",
                "How do I access my fee statement for . Doctor of Optometry?",
                "What is the last date to pay fees for . Doctor of Optometry?",
                "Is there an online payment option for . Doctor of Optometry fees?",
                "What is the procedure for paying . Doctor of Optometry fees?",
                "What is the tuition fee for the first year of . Doctor of Optometry?",
                "Are there any financial aid options for . Doctor of Optometry?",
                "What is included in the . Doctor of Optometry fee?",
                "Can I get a fee waiver for . Doctor of Optometry?"
            ],
            "responses": [
                "The fees for . Doctor of Optometry programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "chemistry_requirement",
            "patterns": [
                "What are the requirements for BSc. Chemistry?",
                "Can you provide the admission criteria for BSc. Chemistry?",
                "Requirements for BSc. Chemistry programme?",
                "What are the prerequisites for BSc. Chemistry?",
                "BSc. Chemistry admission requirements?",
                "Information on eligibility for BSc. Chemistry?",
                "What are the entry requirements for BSc. Chemistry?",
                "Criteria for admission into BSc. Chemistry?",
                "BSc. Chemistry programme prerequisites?",
                "What are the admission requirements for BSc. Chemistry?",
                "BSc. Chemistry eligibility criteria?",
                "Prerequisites for BSc. Chemistry programme?",
                "Requirements for admission to BSc. Chemistry?",
                "BSc. Chemistry entry requirements?",
                "What do I need to get into BSc. Chemistry?",
                "BSc. Chemistry programme entry criteria?",
                "Core and elective requirements for BSc. Chemistry?",
                "What qualifications are needed for BSc. Chemistry?",
                "BSc. Chemistry admission criteria?",
                "What subjects are required for BSc. Chemistry?",
                "What is needed to apply for BSc. Chemistry?",
                "Entry criteria for BSc. Chemistry?",
                "Academic requirements for BSc. Chemistry?",
                "What are the core subjects for BSc. Chemistry?",
                "Required subjects for BSc. Chemistry programme?",
                "BSc. Chemistry admission requirements details?",
                "BSc. Chemistry course prerequisites?",
                "What are the specific requirements for BSc. Chemistry?",
                "Chemistry programme admission requirements?",
                "What do I need to study BSc. Chemistry?",
                "Admission criteria for Chemistry degree?",
                "BSc. Chemistry entry requirements and qualifications?",
                "Core and elective subjects for Chemistry degree?",
                "BSc. Chemistry eligibility and requirements?",
                "Requirements to study BSc. Chemistry?",
                "What qualifications are needed for Chemistry degree?",
                "BSc. Chemistry prerequisites and criteria?",
                "Criteria for BSc. Chemistry programme?",
                "Required courses for BSc. Chemistry admission?",
                "What subjects should I have for BSc. Chemistry?",
                "Admission requirements for studying Chemistry?",
                "What do I need to qualify for BSc. Chemistry?",
                "BSc. Chemistry academic entry requirements?",
                "Specific requirements for BSc. Chemistry programme?",
                "What is required to apply for BSc. Chemistry?",
                "Core subjects for BSc. Chemistry?",
                "Elective subjects for BSc. Chemistry admission?",
                "Requirements for Chemistry undergraduate programme?",
                "What are the entry qualifications for BSc. Chemistry?",
                "Prerequisites for Chemistry degree programme?",
                "What subjects are needed for Chemistry degree?",
                "What is the eligibility criteria for BSc. Chemistry?",
                "Admission qualifications for BSc. Chemistry?",
                "What are the entry criteria for studying BSc. Chemistry?",
                "BSc. Chemistry requirements and qualifications?",
                "What do I need to get into Chemistry programme?"
            ],
            "responses": [
                "Here are the requirements for BSc. Chemistry <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Chemistry, Physics, Mathematics or Biology. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Mathematics, Chemistry, and Physics.</p></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Chemistry Cutoff Points",
            "patterns": [
                "cutoff points for BSc Chemistry",
                "BSc Chemistry cutoff points",
                "minimum score for BSc Chemistry",
                "required score for BSc Chemistry",
                "aggregate for BSc Chemistry",
                "what is the cutoff for BSc Chemistry",
                "cutoff marks for BSc Chemistry",
                "BSc Chemistry required marks",
                "what aggregate do I need for BSc Chemistry",
                "score needed for BSc Chemistry",
                "cutoff points for chemistry",
                "aggregate requirements for chemistry",
                "what were the cut-off aggregates for chemistry",
                "what are the cut-off aggregates chemistry",
                "What are the cutoff points for BSc Chemistry?",
                "BSc Chemistry minimum aggregate required?",
                "Required cutoff marks for BSc Chemistry?",
                "BSc Chemistry entry score?",
                "What is the aggregate for BSc Chemistry?",
                "Cutoff scores for BSc Chemistry programme?",
                "BSc Chemistry admission cutoff?",
                "Aggregate requirements for BSc Chemistry?",
                "What cutoff do I need for BSc Chemistry?",
                "Score needed for admission to BSc Chemistry?",
                "Minimum cutoff points for BSc Chemistry?",
                "What is the required aggregate for BSc Chemistry?",
                "BSc Chemistry required aggregate score?",
                "What are the cutoff requirements for BSc Chemistry?",
                "Cutoff marks for admission into BSc Chemistry?",
                "BSc Chemistry programme score requirements?",
                "BSc Chemistry entry aggregate points?",
                "What is the admission score for BSc Chemistry?",
                "BSc Chemistry cutoff and aggregate points?",
                "Aggregate score needed for BSc Chemistry?",
                "What cutoff marks are needed for BSc Chemistry?",
                "Cutoff aggregate for BSc Chemistry programme?",
                "Required score for BSc Chemistry admission?",
                "What are the minimum points for BSc Chemistry?",
                "BSc Chemistry score requirements for admission?",
                "What aggregate is needed for BSc Chemistry?",
                "Cutoff points and marks for BSc Chemistry?",
                "BSc Chemistry programme entry score?",
                "What is the minimum score for BSc Chemistry?",
                "Aggregate cutoff points for BSc Chemistry?",
                "Score needed for entry into BSc Chemistry?",
                "BSc Chemistry admission aggregate points?",
                "What are the cutoff points for studying BSc Chemistry?",
                "BSc Chemistry minimum required score?",
                "What cutoff is required for BSc Chemistry admission?",
                "BSc Chemistry programme aggregate requirements?",
                "Required cutoff marks for Chemistry programme?",
                "What is the aggregate requirement for BSc Chemistry?",
                "Cutoff scores for Chemistry degree?",
                "BSc Chemistry required admission score?",
                "What cutoff points are used for BSc Chemistry?",
                "BSc Chemistry entry aggregate requirements?",
                "Minimum aggregate for Chemistry degree?",
                "Required cutoff points for Chemistry admission?",
                "What is the aggregate score needed for BSc Chemistry?",
                "Cutoff marks needed for BSc Chemistry programme?",
                "BSc Chemistry admission score and aggregate?",
                "What are the cutoff points for BSc Chemistry course?"
            ],
            "responses": [
                "The cutoff points for BSc. Chemistry are typically around aggregate 16. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Chemistry fees",
            "patterns": [
                "what is the fees for Chemistry",
                "Can I know the amount I will pay for Chemistry",
                "Can i pay the fees in installment for Chemistry?",
                "When should i pay the fees for Chemistry?",
                "Can i book for a hall before paying fees for Chemistry",
                "How much are the fees for BSc. Chemistry?",
                "What are the tuition fees for BSc. Chemistry?",
                "How much do I need to pay for BSc. Chemistry?",
                "What is the cost of the BSc. Chemistry programme?",
                "Can you provide the fee details for BSc. Chemistry?",
                "What is the tuition cost for BSc. Chemistry?",
                "How much is the fee for studying Chemistry?",
                "What is the payment schedule for BSc. Chemistry fees?",
                "Do I have to pay the full fee for BSc. Chemistry upfront?",
                "What is the fee structure for BSc. Chemistry?",
                "Can I pay my BSc. Chemistry fees in installments?",
                "What are the fee payment options for BSc. Chemistry?",
                "How are the fees for BSc. Chemistry calculated?",
                "Are there any additional costs for BSc. Chemistry?",
                "What is the total cost of BSc. Chemistry for a year?",
                "Are there any extra fees for BSc. Chemistry?",
                "Can I get a breakdown of the BSc. Chemistry fees?",
                "What is the annual fee for BSc. Chemistry?",
                "How much does each semester cost for BSc. Chemistry?",
                "What are the miscellaneous fees for BSc. Chemistry?",
                "Are there any lab fees for BSc. Chemistry?",
                "What are the accommodation fees for BSc. Chemistry?",
                "How much are the hostel fees for BSc. Chemistry students?",
                "What is the fee for international students in BSc. Chemistry?",
                "Do international students pay higher fees for BSc. Chemistry?",
                "What is the fee for fee-paying students in BSc. Chemistry?",
                "Are there fee waivers for BSc. Chemistry?",
                "Are scholarships available to cover BSc. Chemistry fees?",
                "What are the financial aid options for BSc. Chemistry?",
                "How much should I budget for BSc. Chemistry fees?",
                "Is there a fee refund policy for BSc. Chemistry?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Chemistry?",
                "What is the refund policy for BSc. Chemistry fees?",
                "What is the deadline for paying BSc. Chemistry fees?",
                "Can I get a fee extension for BSc. Chemistry?",
                "What is the penalty for late payment of BSc. Chemistry fees?",
                "Can I pay BSc. Chemistry fees in multiple payments?",
                "Are there any hidden costs for BSc. Chemistry?",
                "What are the compulsory fees for BSc. Chemistry?",
                "Can I pay BSc. Chemistry fees with a payment plan?",
                "How often do I need to pay fees for BSc. Chemistry?",
                "What are the semester fees for BSc. Chemistry?",
                "Is there an application fee for BSc. Chemistry?",
                "What is the registration fee for BSc. Chemistry?",
                "Are the fees for BSc. Chemistry fixed or variable?",
                "What is the cost per credit hour for BSc. Chemistry?",
                "Are there any discounts available for BSc. Chemistry fees?",
                "Can I get a fee breakdown for BSc. Chemistry?",
                "What are the non-tuition fees for BSc. Chemistry?",
                "Are there any additional charges for BSc. Chemistry?",
                "How much is the acceptance fee for BSc. Chemistry?",
                "Can I book a hall without paying the BSc. Chemistry fees?",
                "What are the hostel booking requirements for BSc. Chemistry?",
                "When are the BSc. Chemistry fees due?",
                "What is the initial deposit for BSc. Chemistry fees?",
                "How do I pay my BSc. Chemistry fees online?",
                "Are there any late fees for BSc. Chemistry?",
                "What is the mode of payment for BSc. Chemistry fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Chemistry?",
                "How do I access my fee statement for BSc. Chemistry?",
                "What is the last date to pay fees for BSc. Chemistry?",
                "Is there an online payment option for BSc. Chemistry fees?",
                "What is the procedure for paying BSc. Chemistry fees?",
                "What is the tuition fee for the first year of BSc. Chemistry?",
                "Are there any financial aid options for BSc. Chemistry?",
                "What is included in the BSc. Chemistry fee?",
                "Can I get a fee waiver for BSc. Chemistry?"
            ],
            "responses": [
                "The fees for BSc. Chemistry programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "physics_requirement",
            "patterns": [
                "What are the requirements for BSc. Physics?",
                "Can you provide the admission criteria for BSc. Physics?",
                "Requirements for BSc. Physics programme?",
                "What are the prerequisites for BSc. Physics?",
                "BSc. Physics admission requirements?",
                "Information on eligibility for BSc. Physics?",
                "What are the entry requirements for BSc. Physics?",
                "Criteria for admission into BSc. Physics?",
                "BSc. Physics programme prerequisites?",
                "What are the admission requirements for BSc. Physics?",
                "BSc. Physics entry criteria?",
                "Requirements for admission into BSc. Physics?",
                "What are the eligibility criteria for BSc. Physics?",
                "Prerequisites for BSc. Physics programme?",
                "BSc. Physics programme requirements?",
                "What qualifications are needed for BSc. Physics?",
                "Criteria for BSc. Physics admission?",
                "What is required to enter BSc. Physics?",
                "BSc. Physics admission requirements?",
                "What are the core requirements for BSc. Physics?",
                "Entry requirements for BSc. Physics programme?",
                "Admission criteria for BSc. Physics degree?",
                "What are the prerequisites for BSc. Physics degree?",
                "Eligibility requirements for BSc. Physics?",
                "What qualifications do I need for BSc. Physics?",
                "BSc. Physics programme admission criteria?",
                "Requirements for BSc. Physics course?",
                "What is needed for admission into BSc. Physics?",
                "BSc. Physics entry requirements?",
                "Criteria for eligibility in BSc. Physics?",
                "What are the core and elective requirements for BSc. Physics?",
                "BSc. Physics programme prerequisites?",
                "What are the core subjects needed for BSc. Physics?",
                "Requirements for studying BSc. Physics?",
                "BSc. Physics eligibility requirements?",
                "Admission prerequisites for BSc. Physics?",
                "What are the entry criteria for BSc. Physics programme?",
                "BSc. Physics course requirements?",
                "Qualifications for BSc. Physics programme?",
                "What are the requirements for BSc. Physics course?",
                "BSc. Physics admission qualifications?",
                "What subjects are needed for BSc. Physics?",
                "Prerequisite subjects for BSc. Physics?",
                "BSc. Physics admission core and elective subjects?",
                "What do I need to apply for BSc. Physics?",
                "BSc. Physics entry qualifications?",
                "Eligibility for BSc. Physics degree?",
                "Core and elective requirements for BSc. Physics?",
                "What qualifications are required for BSc. Physics?",
                "BSc. Physics degree requirements?",
                "Requirements to apply for BSc. Physics?",
                "What are the core subjects for BSc. Physics admission?",
                "BSc. Physics admission core requirements?",
                "What are the criteria for BSc. Physics entry?",
                "BSc. Physics programme qualifications?",
                "What qualifications are needed for BSc. Physics programme?",
                "BSc. Physics admission criteria details?",
                "Prerequisites for BSc. Physics course?",
                "What do you need for BSc. Physics admission?"
            ],
            "responses": [
                "Here are the requirements for BSc. Physics <ul><li><b><u>WASSCE/SSSCE APPLICANTS</u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Mathematics, Physics and Chemistry or Electronics. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Mathematics, Chemistry, and Physics. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e., WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Physics Cutoff Points",
            "patterns": [
                "cutoff points for BSc Physics",
                "BSc Physics cutoff points",
                "minimum score for BSc Physics",
                "required score for BSc Physics",
                "aggregate for BSc Physics",
                "what is the cutoff for BSc Physics",
                "cutoff marks for BSc Physics",
                "BSc Physics required marks",
                "what aggregate do I need for BSc Physics",
                "score needed for BSc Physics",
                "cutoff points for physics",
                "aggregate requirements for physics",
                "what were the cut-off aggregates for physics",
                "what are the cut-off aggregates physics",
                "What are the cutoff points for BSc Physics?",
                "BSc Physics cutoff marks?",
                "Minimum aggregate for BSc Physics admission?",
                "What is the required aggregate for BSc Physics?",
                "Cutoff score for BSc Physics programme?",
                "BSc Physics entry cutoff points?",
                "What cutoff marks are needed for BSc Physics?",
                "Aggregate score required for BSc Physics?",
                "BSc Physics admission cutoff points?",
                "What are the required scores for BSc Physics?",
                "BSc Physics program cutoff marks?",
                "What is the aggregate requirement for BSc Physics?",
                "BSc Physics cutoff aggregate?",
                "Score needed for BSc Physics admission?",
                "Cutoff points for BSc Physics degree?",
                "What is the minimum score for BSc Physics?",
                "BSc Physics aggregate requirements?",
                "What are the entry cutoff points for BSc Physics?",
                "Required cutoff points for BSc Physics programme?",
                "Minimum aggregate for admission into BSc Physics?",
                "What cutoff scores apply for BSc Physics?",
                "BSc Physics minimum cutoff points?",
                "What are the cutoff marks for BSc Physics?",
                "Aggregate required for BSc Physics programme?",
                "BSc Physics admission score requirements?",
                "What is the cutoff aggregate for BSc Physics?",
                "BSc Physics programme cutoff points?",
                "What is the required cutoff for BSc Physics?",
                "Cutoff aggregate for BSc Physics programme?",
                "BSc Physics minimum cutoff score?",
                "Score required for BSc Physics programme?",
                "What are the cutoff points for Physics programme?",
                "Required aggregate for BSc Physics degree?",
                "BSc Physics score requirements?",
                "Cutoff points for BSc Physics course?",
                "Minimum cutoff for BSc Physics degree?",
                "What aggregate is needed for BSc Physics admission?",
                "BSc Physics programme admission cutoff?",
                "What are the minimum cutoff marks for BSc Physics?",
                "BSc Physics aggregate cutoff?",
                "What cutoff is required for BSc Physics?",
                "BSc Physics required cutoff points?",
                "Minimum score for BSc Physics admission?",
                "What are the cutoff marks for the BSc Physics course?",
                "BSc Physics admission aggregate requirements?",
                "Required marks for BSc Physics programme?",
                "BSc Physics degree cutoff points?",
                "What are the admission cutoff points for BSc Physics?",
                "BSc Physics entry score requirements?",
                "Aggregate points needed for BSc Physics?"
            ],
            "responses": [
                "The cutoff points for BSc. Physics are typically around aggregate 18. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Physics fees",
            "patterns": [
                "what is the fees for Physics",
                "Can I know the amount I will pay for Physics",
                "Can i pay the fees in installment for Physics?",
                "When should i pay the fees for Physics?",
                "Can i book for a hall before paying fees for Physics",
                "How much are the fees for BSc. Physics?",
                "What are the tuition fees for BSc. Physics?",
                "How much do I need to pay for BSc. Physics?",
                "What is the cost of the BSc. Physics programme?",
                "Can you provide the fee details for BSc. Physics?",
                "What is the tuition cost for BSc. Physics?",
                "How much is the fee for studying Physics?",
                "What is the payment schedule for BSc. Physics fees?",
                "Do I have to pay the full fee for BSc. Physics upfront?",
                "What is the fee structure for BSc. Physics?",
                "Can I pay my BSc. Physics fees in installments?",
                "What are the fee payment options for BSc. Physics?",
                "How are the fees for BSc. Physics calculated?",
                "Are there any additional costs for BSc. Physics?",
                "What is the total cost of BSc. Physics for a year?",
                "Are there any extra fees for BSc. Physics?",
                "Can I get a breakdown of the BSc. Physics fees?",
                "What is the annual fee for BSc. Physics?",
                "How much does each semester cost for BSc. Physics?",
                "What are the miscellaneous fees for BSc. Physics?",
                "Are there any lab fees for BSc. Physics?",
                "What are the accommodation fees for BSc. Physics?",
                "How much are the hostel fees for BSc. Physics students?",
                "What is the fee for international students in BSc. Physics?",
                "Do international students pay higher fees for BSc. Physics?",
                "What is the fee for fee-paying students in BSc. Physics?",
                "Are there fee waivers for BSc. Physics?",
                "Are scholarships available to cover BSc. Physics fees?",
                "What are the financial aid options for BSc. Physics?",
                "How much should I budget for BSc. Physics fees?",
                "Is there a fee refund policy for BSc. Physics?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Physics?",
                "What is the refund policy for BSc. Physics fees?",
                "What is the deadline for paying BSc. Physics fees?",
                "Can I get a fee extension for BSc. Physics?",
                "What is the penalty for late payment of BSc. Physics fees?",
                "Can I pay BSc. Physics fees in multiple payments?",
                "Are there any hidden costs for BSc. Physics?",
                "What are the compulsory fees for BSc. Physics?",
                "Can I pay BSc. Physics fees with a payment plan?",
                "How often do I need to pay fees for BSc. Physics?",
                "What are the semester fees for BSc. Physics?",
                "Is there an application fee for BSc. Physics?",
                "What is the registration fee for BSc. Physics?",
                "Are the fees for BSc. Physics fixed or variable?",
                "What is the cost per credit hour for BSc. Physics?",
                "Are there any discounts available for BSc. Physics fees?",
                "Can I get a fee breakdown for BSc. Physics?",
                "What are the non-tuition fees for BSc. Physics?",
                "Are there any additional charges for BSc. Physics?",
                "How much is the acceptance fee for BSc. Physics?",
                "Can I book a hall without paying the BSc. Physics fees?",
                "What are the hostel booking requirements for BSc. Physics?",
                "When are the BSc. Physics fees due?",
                "What is the initial deposit for BSc. Physics fees?",
                "How do I pay my BSc. Physics fees online?",
                "Are there any late fees for BSc. Physics?",
                "What is the mode of payment for BSc. Physics fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Physics?",
                "How do I access my fee statement for BSc. Physics?",
                "What is the last date to pay fees for BSc. Physics?",
                "Is there an online payment option for BSc. Physics fees?",
                "What is the procedure for paying BSc. Physics fees?",
                "What is the tuition fee for the first year of BSc. Physics?",
                "Are there any financial aid options for BSc. Physics?",
                "What is included in the BSc. Physics fee?",
                "Can I get a fee waiver for BSc. Physics?"
            ],
            "responses": [
                "The fees for BSc. Physics programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "meteorology_and_climate_science_requirement",
            "patterns": [
                "What are the requirements for BSc. Meteorology and Climate Science?",
                "Can you provide the admission criteria for BSc. Meteorology and Climate Science?",
                "Requirements for BSc. Meteorology and Climate Science programme?",
                "What are the prerequisites for BSc. Meteorology and Climate Science?",
                "BSc. Meteorology and Climate Science admission requirements?",
                "Information on eligibility for BSc. Meteorology and Climate Science?",
                "What are the entry requirements for BSc. Meteorology and Climate Science?",
                "Criteria for admission into BSc. Meteorology and Climate Science?",
                "BSc. Meteorology and Climate Science programme prerequisites?",
                "What are the entry requirements for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science admission criteria?",
                "Requirements for BSc Meteorology and Climate Science degree?",
                "Prerequisites for BSc Meteorology and Climate Science?",
                "Admission requirements for BSc Meteorology and Climate Science?",
                "Eligibility criteria for BSc Meteorology and Climate Science?",
                "What are the requirements for BSc Meteorology and Climate Science programme?",
                "Criteria for BSc Meteorology and Climate Science admission?",
                "What do I need to get into BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science eligibility requirements?",
                "What qualifications are needed for BSc Meteorology and Climate Science?",
                "Admission requirements for Meteorology and Climate Science programme?",
                "Requirements for BSc in Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science programme requirements?",
                "Prerequisites for BSc in Meteorology and Climate Science?",
                "What are the core and elective subjects for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science entry qualifications?",
                "What subjects are needed for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science application requirements?",
                "What are the qualifications for BSc Meteorology and Climate Science?",
                "Criteria for BSc Meteorology and Climate Science programme?",
                "What do I need to apply for BSc Meteorology and Climate Science?",
                "Requirements for admission into BSc Meteorology and Climate Science?",
                "Eligibility for BSc Meteorology and Climate Science programme?",
                "BSc Meteorology and Climate Science entry requirements?",
                "What are the admission criteria for BSc Meteorology and Climate Science?",
                "What are the requirements to study BSc Meteorology and Climate Science?",
                "Prerequisites for admission into BSc Meteorology and Climate Science?",
                "What qualifications are required for BSc Meteorology and Climate Science?",
                "Admission criteria for BSc in Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science programme admission requirements?",
                "What is needed for admission into BSc Meteorology and Climate Science?",
                "Requirements to apply for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science programme prerequisites?",
                "What are the core subjects for BSc Meteorology and Climate Science?",
                "What elective subjects are needed for BSc Meteorology and Climate Science?",
                "Entry qualifications for BSc Meteorology and Climate Science?",
                "What is required for admission into BSc Meteorology and Climate Science?",
                "Requirements for BSc in Meteorology and Climate Science programme?",
                "What are the admission requirements for Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science programme criteria?",
                "Prerequisites for BSc in Meteorology and Climate Science programme?",
                "What qualifications do I need for BSc Meteorology and Climate Science?",
                "What are the eligibility requirements for BSc Meteorology and Climate Science?",
                "Admission requirements for BSc Meteorology and Climate Science programme?",
                "What is the entry criteria for BSc Meteorology and Climate Science?",
                "Requirements for applying to BSc Meteorology and Climate Science?",
                "What are the entry criteria for the BSc Meteorology and Climate Science programme?",
                "BSc Meteorology and Climate Science application criteria?",
                "What are the qualifications for applying to BSc Meteorology and Climate Science?"
            ],
            "responses": [
                "Here are the requirements for BSc. Meteorology and Climate Science <ul><li><b><u>WASSCE/SSSCE APPLICANTS</u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Mathematics, Physics and Chemistry or Electronics. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Mathematics, Chemistry, and Physics. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e., WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Meteorology and Climate Science Cutoff Points",
            "patterns": [
                "cutoff points for BSc Meteorology and Climate Science",
                "BSc Meteorology and Climate Science cutoff points",
                "minimum score for BSc Meteorology and Climate Science",
                "required score for BSc Meteorology and Climate Science",
                "aggregate for BSc Meteorology and Climate Science",
                "what is the cutoff for BSc Meteorology and Climate Science",
                "cutoff marks for BSc Meteorology and Climate Science",
                "BSc Meteorology and Climate Science required marks",
                "what aggregate do I need for BSc Meteorology and Climate Science",
                "score needed for BSc Meteorology and Climate Science",
                "cutoff points for meteorology and climate science",
                "aggregate requirements for meteorology and climate science",
                "what were the cut-off aggregates for meteorology and climate science",
                "what are the cut-off aggregates meteorology and climate science",
                "What are the cutoff points for BSc Meteorology and Climate Science?",
                "Minimum aggregate for BSc Meteorology and Climate Science?",
                "Required cutoff for BSc Meteorology and Climate Science?",
                "What is the required score for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science cutoff marks?",
                "What aggregate is needed for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science score requirements?",
                "Aggregate needed for BSc Meteorology and Climate Science?",
                "What are the cut-off points for Meteorology and Climate Science?",
                "What cutoff marks are needed for BSc Meteorology and Climate Science?",
                "What is the cut-off for Meteorology and Climate Science?",
                "Cutoff aggregates for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science minimum score?",
                "Required aggregate for BSc Meteorology and Climate Science?",
                "What are the cutoff scores for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science aggregate requirements?",
                "What aggregate do you need for BSc Meteorology and Climate Science?",
                "Cutoff points for Meteorology and Climate Science programme?",
                "BSc Meteorology and Climate Science cutoff aggregates?",
                "What score is required for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science minimum cutoff points?",
                "What were the cutoff points for Meteorology and Climate Science?",
                "What are the current cutoff points for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science required aggregates?",
                "What were the cutoff aggregates for BSc Meteorology and Climate Science?",
                "Cutoff for BSc in Meteorology and Climate Science?",
                "Required cutoff marks for BSc Meteorology and Climate Science?",
                "What are the cutoff requirements for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science aggregate cutoff?",
                "Minimum cutoff points for Meteorology and Climate Science?",
                "What is the minimum aggregate for Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science score cutoff?",
                "Cutoff points for BSc Meteorology and Climate Science programme?",
                "What aggregate is required for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science entry cutoff points?",
                "What are the cut-off requirements for BSc Meteorology and Climate Science?",
                "What aggregate do I need for BSc Meteorology and Climate Science?",
                "Required score for BSc Meteorology and Climate Science admission?",
                "BSc Meteorology and Climate Science cutoff marks for admission?",
                "What cutoff is needed for BSc Meteorology and Climate Science?",
                "Current cutoff for BSc Meteorology and Climate Science?",
                "Cutoff points for Meteorology and Climate Science degree?",
                "BSc Meteorology and Climate Science admission cutoff points?",
                "What are the admission requirements for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science cutoff scores?",
                "Cutoff points for admission into BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science minimum admission score?",
                "What were the cutoff marks for BSc Meteorology and Climate Science?",
                "BSc Meteorology and Climate Science aggregate score requirements?"
            ],
            "responses": [
                "The cutoff points for BSc. Meteorology and Climate Science are typically around aggregate 19. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Meteorology and Climate Science fees",
            "patterns": [
                "what is the fees for Meteorology and Climate Science",
                "Can I know the amount I will pay for Meteorology and Climate Science",
                "Can i pay the fees in installment for Meteorology and Climate Science?",
                "When should i pay the fees for Meteorology and Climate Science?",
                "Can i book for a hall before paying fees for Meteorology and Climate Science",
                "How much are the fees for BSc. Meteorology and Climate Science?",
                "What are the tuition fees for BSc. Meteorology and Climate Science?",
                "How much do I need to pay for BSc. Meteorology and Climate Science?",
                "What is the cost of the BSc. Meteorology and Climate Science programme?",
                "Can you provide the fee details for BSc. Meteorology and Climate Science?",
                "What is the tuition cost for BSc. Meteorology and Climate Science?",
                "How much is the fee for studying Meteorology and Climate Science?",
                "What is the payment schedule for BSc. Meteorology and Climate Science fees?",
                "Do I have to pay the full fee for BSc. Meteorology and Climate Science upfront?",
                "What is the fee structure for BSc. Meteorology and Climate Science?",
                "Can I pay my BSc. Meteorology and Climate Science fees in installments?",
                "What are the fee payment options for BSc. Meteorology and Climate Science?",
                "How are the fees for BSc. Meteorology and Climate Science calculated?",
                "Are there any additional costs for BSc. Meteorology and Climate Science?",
                "What is the total cost of BSc. Meteorology and Climate Science for a year?",
                "Are there any extra fees for BSc. Meteorology and Climate Science?",
                "Can I get a breakdown of the BSc. Meteorology and Climate Science fees?",
                "What is the annual fee for BSc. Meteorology and Climate Science?",
                "How much does each semester cost for BSc. Meteorology and Climate Science?",
                "What are the miscellaneous fees for BSc. Meteorology and Climate Science?",
                "Are there any lab fees for BSc. Meteorology and Climate Science?",
                "What are the accommodation fees for BSc. Meteorology and Climate Science?",
                "How much are the hostel fees for BSc. Meteorology and Climate Science students?",
                "What is the fee for international students in BSc. Meteorology and Climate Science?",
                "Do international students pay higher fees for BSc. Meteorology and Climate Science?",
                "What is the fee for fee-paying students in BSc. Meteorology and Climate Science?",
                "Are there fee waivers for BSc. Meteorology and Climate Science?",
                "Are scholarships available to cover BSc. Meteorology and Climate Science fees?",
                "What are the financial aid options for BSc. Meteorology and Climate Science?",
                "How much should I budget for BSc. Meteorology and Climate Science fees?",
                "Is there a fee refund policy for BSc. Meteorology and Climate Science?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Meteorology and Climate Science?",
                "What is the refund policy for BSc. Meteorology and Climate Science fees?",
                "What is the deadline for paying BSc. Meteorology and Climate Science fees?",
                "Can I get a fee extension for BSc. Meteorology and Climate Science?",
                "What is the penalty for late payment of BSc. Meteorology and Climate Science fees?",
                "Can I pay BSc. Meteorology and Climate Science fees in multiple payments?",
                "Are there any hidden costs for BSc. Meteorology and Climate Science?",
                "What are the compulsory fees for BSc. Meteorology and Climate Science?",
                "Can I pay BSc. Meteorology and Climate Science fees with a payment plan?",
                "How often do I need to pay fees for BSc. Meteorology and Climate Science?",
                "What are the semester fees for BSc. Meteorology and Climate Science?",
                "Is there an application fee for BSc. Meteorology and Climate Science?",
                "What is the registration fee for BSc. Meteorology and Climate Science?",
                "Are the fees for BSc. Meteorology and Climate Science fixed or variable?",
                "What is the cost per credit hour for BSc. Meteorology and Climate Science?",
                "Are there any discounts available for BSc. Meteorology and Climate Science fees?",
                "Can I get a fee breakdown for BSc. Meteorology and Climate Science?",
                "What are the non-tuition fees for BSc. Meteorology and Climate Science?",
                "Are there any additional charges for BSc. Meteorology and Climate Science?",
                "How much is the acceptance fee for BSc. Meteorology and Climate Science?",
                "Can I book a hall without paying the BSc. Meteorology and Climate Science fees?",
                "What are the hostel booking requirements for BSc. Meteorology and Climate Science?",
                "When are the BSc. Meteorology and Climate Science fees due?",
                "What is the initial deposit for BSc. Meteorology and Climate Science fees?",
                "How do I pay my BSc. Meteorology and Climate Science fees online?",
                "Are there any late fees for BSc. Meteorology and Climate Science?",
                "What is the mode of payment for BSc. Meteorology and Climate Science fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Meteorology and Climate Science?",
                "How do I access my fee statement for BSc. Meteorology and Climate Science?",
                "What is the last date to pay fees for BSc. Meteorology and Climate Science?",
                "Is there an online payment option for BSc. Meteorology and Climate Science fees?",
                "What is the procedure for paying BSc. Meteorology and Climate Science fees?",
                "What is the tuition fee for the first year of BSc. Meteorology and Climate Science?",
                "Are there any financial aid options for BSc. Meteorology and Climate Science?",
                "What is included in the BSc. Meteorology and Climate Science fee?",
                "Can I get a fee waiver for BSc. Meteorology and Climate Science?"
            ],
            "responses": [
                "The fees for BSc. Meteorology and Climate Science programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "mathematics_requirement",
            "patterns": [
                "What are the requirements for BSc. Mathematics?",
                "Can you provide the admission criteria for BSc. Mathematics?",
                "Requirements for BSc. Mathematics programme?",
                "What are the prerequisites for BSc. Mathematics?",
                "BSc. Mathematics admission requirements?",
                "Information on eligibility for BSc. Mathematics?",
                "What are the entry requirements for BSc. Mathematics?",
                "Criteria for admission into BSc. Mathematics?",
                "BSc. Mathematics programme prerequisites?",
                "What are the entry requirements for the BSc Mathematics program?",
                "Admission criteria for BSc Mathematics?",
                "Requirements to study BSc Mathematics?",
                "Prerequisites for BSc Mathematics?",
                "Eligibility criteria for BSc Mathematics?",
                "What is needed to apply for BSc Mathematics?",
                "Criteria for BSc Mathematics admission?",
                "BSc Mathematics program entry requirements?",
                "What are the admission requirements for BSc Mathematics?",
                "What qualifications are needed for BSc Mathematics?",
                "BSc Mathematics admission criteria?",
                "What subjects are required for BSc Mathematics?",
                "Core subjects needed for BSc Mathematics?",
                "Elective subjects required for BSc Mathematics?",
                "What are the general requirements for BSc Mathematics?",
                "BSc Mathematics program prerequisites?",
                "What is required for admission into BSc Mathematics?",
                "Criteria for entry into BSc Mathematics?",
                "Requirements for enrolling in BSc Mathematics?",
                "What qualifications do I need for BSc Mathematics?",
                "BSc Mathematics requirements and criteria?",
                "Eligibility for BSc Mathematics program?",
                "BSc Mathematics core and elective subjects?",
                "What are the subjects required for BSc Mathematics admission?",
                "Entry requirements for BSc Mathematics program?",
                "BSc Mathematics program requirements?",
                "What do I need to apply for BSc Mathematics?",
                "Requirements to get into BSc Mathematics?",
                "What subjects should I have for BSc Mathematics?",
                "Admission requirements for Mathematics degree?",
                "What are the prerequisites for studying Mathematics?",
                "Criteria for admission into Mathematics program?",
                "BSc Mathematics prerequisites?",
                "What is the required academic background for BSc Mathematics?",
                "BSc Mathematics application requirements?",
                "Subjects needed for BSc Mathematics admission?",
                "What qualifications are necessary for BSc Mathematics?",
                "What are the entry qualifications for BSc Mathematics?",
                "BSc Mathematics admission subjects?",
                "Eligibility requirements for BSc Mathematics?",
                "What are the prerequisites for the Mathematics program?",
                "Core and elective subjects for BSc Mathematics?",
                "Requirements for BSc Mathematics applicants?",
                "BSc Mathematics eligibility criteria?",
                "What is the admission criteria for BSc Mathematics?",
                "Criteria needed for BSc Mathematics admission?",
                "Required subjects for BSc Mathematics program?",
                "What are the qualifications for BSc Mathematics?"
            ],
            "responses": [
                "Here are the requirements for BSc. Mathematics <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Mathematics, Physics and Chemistry or Biology. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English Language and Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in Mathematics, Physics, and Chemistry or Biology. </p></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Mathematics Cutoff Points",
            "patterns": [
                "cutoff points for BSc Mathematics",
                "BSc Mathematics cutoff points",
                "minimum score for BSc Mathematics",
                "required score for BSc Mathematics",
                "aggregate for BSc Mathematics",
                "what is the cutoff for BSc Mathematics",
                "cutoff marks for BSc Mathematics",
                "BSc Mathematics required marks",
                "what aggregate do I need for BSc Mathematics",
                "score needed for BSc Mathematics",
                "cutoff points for mathematics",
                "aggregate requirements for mathematics",
                "what were the cut-off aggregates for mathematics",
                "what are the cut-off aggregates mathematics",
                "What is the cutoff aggregate for BSc Mathematics?",
                "BSc Mathematics required cutoff points?",
                "Minimum cutoff for BSc Mathematics?",
                "BSc Mathematics admission cutoff marks?",
                "What aggregate score is needed for BSc Mathematics?",
                "What is the cutoff score for BSc Mathematics?",
                "Aggregate cutoff for BSc Mathematics program?",
                "What are the cutoff marks for BSc Mathematics?",
                "Required aggregate for BSc Mathematics admission?",
                "BSc Mathematics entry score requirements?",
                "What is the minimum aggregate for BSc Mathematics?",
                "BSc Mathematics program cutoff points?",
                "What aggregate is required for BSc Mathematics?",
                "Score needed to qualify for BSc Mathematics?",
                "Cutoff marks for admission to BSc Mathematics?",
                "What are the cutoff points for BSc Mathematics?",
                "Minimum required score for BSc Mathematics?",
                "BSc Mathematics cutoff aggregate?",
                "What cutoff is needed for BSc Mathematics?",
                "BSc Mathematics aggregate requirements?",
                "What were the previous cutoff points for BSc Mathematics?",
                "BSc Mathematics admission aggregate?",
                "Cutoff points for entry into BSc Mathematics?",
                "What score do I need for BSc Mathematics?",
                "What are the cutoff scores for BSc Mathematics?",
                "BSc Mathematics cutoff criteria?",
                "Required marks for BSc Mathematics admission?",
                "What are the required cutoff points for BSc Mathematics?",
                "BSc Mathematics aggregate score needed?",
                "What is the aggregate score for BSc Mathematics?",
                "What cutoff marks are required for BSc Mathematics?",
                "BSc Mathematics score requirements?",
                "What were the cutoff aggregates for BSc Mathematics last year?",
                "What are the aggregate requirements for BSc Mathematics?",
                "BSc Mathematics admission cutoff score?",
                "Minimum aggregate score for BSc Mathematics program?",
                "BSc Mathematics entry aggregate points?",
                "What is the cutoff for BSc Mathematics this year?",
                "BSc Mathematics required entry score?",
                "Cutoff for BSc Mathematics program?",
                "What cutoff points do I need for BSc Mathematics?",
                "BSc Mathematics required aggregate score?",
                "What are the entry cutoff points for BSc Mathematics?",
                "BSc Mathematics minimum cutoff requirements?",
                "Cutoff requirements for BSc Mathematics admission?",
                "What are the cut-off marks for BSc Mathematics?",
                "BSc Mathematics cutoff points and aggregates?",
                "What is the current cutoff for BSc Mathematics?"
            ],
            "responses": [
                "The cutoff points for BSc. Mathematics are typically around aggregate 17. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Mathematics fees",
            "patterns": [
                "what is the fees for Mathematics",
                "Can I know the amount I will pay for Mathematics",
                "Can i pay the fees in installment for Mathematics?",
                "When should i pay the fees for Mathematics?",
                "Can i book for a hall before paying fees for Mathematics",
                "How much are the fees for BSc. Mathematics?",
                "What are the tuition fees for BSc. Mathematics?",
                "How much do I need to pay for BSc. Mathematics?",
                "What is the cost of the BSc. Mathematics programme?",
                "Can you provide the fee details for BSc. Mathematics?",
                "What is the tuition cost for BSc. Mathematics?",
                "How much is the fee for studying Mathematics?",
                "What is the payment schedule for BSc. Mathematics fees?",
                "Do I have to pay the full fee for BSc. Mathematics upfront?",
                "What is the fee structure for BSc. Mathematics?",
                "Can I pay my BSc. Mathematics fees in installments?",
                "What are the fee payment options for BSc. Mathematics?",
                "How are the fees for BSc. Mathematics calculated?",
                "Are there any additional costs for BSc. Mathematics?",
                "What is the total cost of BSc. Mathematics for a year?",
                "Are there any extra fees for BSc. Mathematics?",
                "Can I get a breakdown of the BSc. Mathematics fees?",
                "What is the annual fee for BSc. Mathematics?",
                "How much does each semester cost for BSc. Mathematics?",
                "What are the miscellaneous fees for BSc. Mathematics?",
                "Are there any lab fees for BSc. Mathematics?",
                "What are the accommodation fees for BSc. Mathematics?",
                "How much are the hostel fees for BSc. Mathematics students?",
                "What is the fee for international students in BSc. Mathematics?",
                "Do international students pay higher fees for BSc. Mathematics?",
                "What is the fee for fee-paying students in BSc. Mathematics?",
                "Are there fee waivers for BSc. Mathematics?",
                "Are scholarships available to cover BSc. Mathematics fees?",
                "What are the financial aid options for BSc. Mathematics?",
                "How much should I budget for BSc. Mathematics fees?",
                "Is there a fee refund policy for BSc. Mathematics?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Mathematics?",
                "What is the refund policy for BSc. Mathematics fees?",
                "What is the deadline for paying BSc. Mathematics fees?",
                "Can I get a fee extension for BSc. Mathematics?",
                "What is the penalty for late payment of BSc. Mathematics fees?",
                "Can I pay BSc. Mathematics fees in multiple payments?",
                "Are there any hidden costs for BSc. Mathematics?",
                "What are the compulsory fees for BSc. Mathematics?",
                "Can I pay BSc. Mathematics fees with a payment plan?",
                "How often do I need to pay fees for BSc. Mathematics?",
                "What are the semester fees for BSc. Mathematics?",
                "Is there an application fee for BSc. Mathematics?",
                "What is the registration fee for BSc. Mathematics?",
                "Are the fees for BSc. Mathematics fixed or variable?",
                "What is the cost per credit hour for BSc. Mathematics?",
                "Are there any discounts available for BSc. Mathematics fees?",
                "Can I get a fee breakdown for BSc. Mathematics?",
                "What are the non-tuition fees for BSc. Mathematics?",
                "Are there any additional charges for BSc. Mathematics?",
                "How much is the acceptance fee for BSc. Mathematics?",
                "Can I book a hall without paying the BSc. Mathematics fees?",
                "What are the hostel booking requirements for BSc. Mathematics?",
                "When are the BSc. Mathematics fees due?",
                "What is the initial deposit for BSc. Mathematics fees?",
                "How do I pay my BSc. Mathematics fees online?",
                "Are there any late fees for BSc. Mathematics?",
                "What is the mode of payment for BSc. Mathematics fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Mathematics?",
                "How do I access my fee statement for BSc. Mathematics?",
                "What is the last date to pay fees for BSc. Mathematics?",
                "Is there an online payment option for BSc. Mathematics fees?",
                "What is the procedure for paying BSc. Mathematics fees?",
                "What is the tuition fee for the first year of BSc. Mathematics?",
                "Are there any financial aid options for BSc. Mathematics?",
                "What is included in the BSc. Mathematics fee?",
                "Can I get a fee waiver for BSc. Mathematics?"
            ],
            "responses": [
                "The fees for BSc. Mathematics programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "actuarial_science_requirement",
            "patterns": [
                "What are the requirements for BSc. Actuarial Science?",
                "Can you provide the admission criteria for BSc. Actuarial Science?",
                "Requirements for BSc. Actuarial Science programme?",
                "What are the prerequisites for BSc. Actuarial Science?",
                "BSc. Actuarial Science admission requirements?",
                "Information on eligibility for BSc. Actuarial Science?",
                "What are the entry requirements for BSc. Actuarial Science?",
                "Criteria for admission into BSc. Actuarial Science?",
                "BSc. Actuarial Science programme prerequisites?",
                "What are the admission requirements for BSc Actuarial Science?",
                "BSc Actuarial Science entry criteria?",
                "Prerequisites for BSc Actuarial Science?",
                "Eligibility criteria for BSc Actuarial Science?",
                "What are the core requirements for BSc Actuarial Science?",
                "BSc Actuarial Science admission criteria?",
                "Requirements to apply for BSc Actuarial Science?",
                "What qualifications are needed for BSc Actuarial Science?",
                "BSc Actuarial Science prerequisites?",
                "Entry requirements for BSc Actuarial Science programme?",
                "What do I need to get into BSc Actuarial Science?",
                "BSc Actuarial Science programme admission requirements?",
                "Core subjects for BSc Actuarial Science?",
                "Elective subjects needed for BSc Actuarial Science?",
                "General requirements for BSc Actuarial Science admission?",
                "What is needed to be admitted into BSc Actuarial Science?",
                "BSc Actuarial Science program entry requirements?",
                "What are the eligibility requirements for BSc Actuarial Science?",
                "BSc Actuarial Science admission requirements for WASSCE/SSSCE?",
                "BSc Actuarial Science 'A' level requirements?",
                "Mature student requirements for BSc Actuarial Science?",
                "HND and diploma requirements for BSc Actuarial Science?",
                "What are the entry qualifications for BSc Actuarial Science?",
                "BSc Actuarial Science program eligibility?",
                "Requirements for mature students applying to BSc Actuarial Science?",
                "What are the subject requirements for BSc Actuarial Science?",
                "BSc Actuarial Science admission prerequisites?",
                "What qualifications are required for BSc Actuarial Science?",
                "Entry criteria for BSc Actuarial Science programme?",
                "BSc Actuarial Science application requirements?",
                "Prerequisites for applying to BSc Actuarial Science?",
                "What do I need to qualify for BSc Actuarial Science?",
                "Requirements for BSc Actuarial Science program?",
                "BSc Actuarial Science eligibility criteria?",
                "Core and elective requirements for BSc Actuarial Science?",
                "What are the requirements to enroll in BSc Actuarial Science?",
                "BSc Actuarial Science admission requirements overview?",
                "BSc Actuarial Science eligibility for mature students?",
                "What are the prerequisites for enrolling in BSc Actuarial Science?",
                "BSc Actuarial Science entry qualifications?",
                "Criteria for BSc Actuarial Science admission?",
                "What subjects are needed for BSc Actuarial Science?",
                "Requirements for diploma holders in BSc Actuarial Science?",
                "BSc Actuarial Science general admission criteria?",
                "What are the specific requirements for BSc Actuarial Science?",
                "BSc Actuarial Science application criteria?",
                "What qualifications must I have for BSc Actuarial Science?",
                "What are the admission requirements for BSc Actuarial Science programme?"
            ],
            "responses": [
                "Here are the requirement for BSc. Actuarial Science <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Mathematics and any TWO (2) Elective Subjects. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in THREE (3) subjects including  Mathematics. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul><br><li><b><u>HND AND OTHER DIPLOMA </u></b></li><p>Applicants must have a minimum of 2nd Class Lower Division in the following programmes:  Statistics, Mathematics, Engineering, Economics, or any programme with the Mathematical Sciences with evidence of Mathematical or qualitative ability. </p></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Actuarial Science Cutoff Points",
            "patterns": [
                "cutoff points for BSc Actuarial Science",
                "BSc Actuarial Science cutoff points",
                "minimum score for BSc Actuarial Science",
                "required score for BSc Actuarial Science",
                "aggregate for BSc Actuarial Science",
                "what is the cutoff for BSc Actuarial Science",
                "cutoff marks for BSc Actuarial Science",
                "BSc Actuarial Science required marks",
                "what aggregate do I need for BSc Actuarial Science",
                "score needed for BSc Actuarial Science",
                "cutoff points for actuarial science",
                "aggregate requirements for actuarial science",
                "what were the cut-off aggregates for actuarial science",
                "what are the cut-off aggregates actuarial science",
                "What is the cutoff score for BSc Actuarial Science?",
                "What are the cutoff marks for BSc Actuarial Science?",
                "How much aggregate is required for BSc Actuarial Science?",
                "Minimum cutoff points for BSc Actuarial Science?",
                "BSc Actuarial Science aggregate requirements?",
                "Required aggregate for BSc Actuarial Science?",
                "What is the required score for BSc Actuarial Science?",
                "BSc Actuarial Science cutoff aggregate?",
                "What cutoff points are needed for BSc Actuarial Science?",
                "What are the required marks for BSc Actuarial Science?",
                "BSc Actuarial Science entry cutoff points?",
                "Cutoff aggregates for BSc Actuarial Science?",
                "What aggregate do I need for BSc Actuarial Science?",
                "BSc Actuarial Science admission cutoff?",
                "What is the minimum aggregate for BSc Actuarial Science?",
                "Cutoff points needed for BSc Actuarial Science programme?",
                "How high is the cutoff for BSc Actuarial Science?",
                "What cutoff score is needed for BSc Actuarial Science?",
                "What were the previous cutoff points for BSc Actuarial Science?",
                "Aggregate score needed for BSc Actuarial Science?",
                "BSc Actuarial Science cutoff scores?",
                "Current cutoff for BSc Actuarial Science?",
                "What is the cutoff mark for BSc Actuarial Science this year?",
                "Required cutoff points for BSc Actuarial Science admission?",
                "Cutoff for BSc Actuarial Science course?",
                "BSc Actuarial Science program cutoff?",
                "What were the cutoff aggregates for BSc Actuarial Science last year?",
                "Cutoff marks for BSc Actuarial Science programme?",
                "What is the latest cutoff for BSc Actuarial Science?",
                "BSc Actuarial Science required aggregate score?",
                "Minimum cutoff for BSc Actuarial Science programme?",
                "What are the current cutoff points for BSc Actuarial Science?",
                "Required cutoff for BSc Actuarial Science admission?",
                "Cutoff requirements for BSc Actuarial Science?",
                "What cutoff is needed for BSc Actuarial Science?",
                "Aggregate requirements for BSc Actuarial Science programme?",
                "What is the cutoff aggregate for BSc Actuarial Science?",
                "BSc Actuarial Science cutoff points details?",
                "What cutoff scores are needed for BSc Actuarial Science?",
                "How much aggregate do I need for BSc Actuarial Science?",
                "What are the latest cutoff marks for BSc Actuarial Science?",
                "Cutoff for Actuarial Science BSc?",
                "What are the required cutoff points for BSc Actuarial Science?",
                "BSc Actuarial Science aggregate cutoff?",
                "What cutoff points are required for BSc Actuarial Science admission?",
                "What is the aggregate requirement for BSc Actuarial Science?",
                "BSc Actuarial Science cutoff scores this year?",
                "Minimum score for admission into BSc Actuarial Science?",
                "What is the aggregate cutoff for BSc Actuarial Science programme?",
                "BSc Actuarial Science entry score?",
                "Required cutoff marks for BSc Actuarial Science?",
                "What are the cutoff points for Actuarial Science BSc?",
                "BSc Actuarial Science admission aggregate?"
            ],
            "responses": [
                "The cutoff points for BSc. Actuarial Science are typically around aggregate 11. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Actuarial Science fees",
            "patterns": [
                "what is the fees for Actuarial Science",
                "Can I know the amount I will pay for Actuarial Science",
                "Can i pay the fees in installment for Actuarial Science?",
                "When should i pay the fees for Actuarial Science?",
                "Can i book for a hall before paying fees for Actuarial Science",
                "How much are the fees for BSc. Actuarial Science?",
                "What are the tuition fees for BSc. Actuarial Science?",
                "How much do I need to pay for BSc. Actuarial Science?",
                "What is the cost of the BSc. Actuarial Science programme?",
                "Can you provide the fee details for BSc. Actuarial Science?",
                "What is the tuition cost for BSc. Actuarial Science?",
                "How much is the fee for studying Actuarial Science?",
                "What is the payment schedule for BSc. Actuarial Science fees?",
                "Do I have to pay the full fee for BSc. Actuarial Science upfront?",
                "What is the fee structure for BSc. Actuarial Science?",
                "Can I pay my BSc. Actuarial Science fees in installments?",
                "What are the fee payment options for BSc. Actuarial Science?",
                "How are the fees for BSc. Actuarial Science calculated?",
                "Are there any additional costs for BSc. Actuarial Science?",
                "What is the total cost of BSc. Actuarial Science for a year?",
                "Are there any extra fees for BSc. Actuarial Science?",
                "Can I get a breakdown of the BSc. Actuarial Science fees?",
                "What is the annual fee for BSc. Actuarial Science?",
                "How much does each semester cost for BSc. Actuarial Science?",
                "What are the miscellaneous fees for BSc. Actuarial Science?",
                "Are there any lab fees for BSc. Actuarial Science?",
                "What are the accommodation fees for BSc. Actuarial Science?",
                "How much are the hostel fees for BSc. Actuarial Science students?",
                "What is the fee for international students in BSc. Actuarial Science?",
                "Do international students pay higher fees for BSc. Actuarial Science?",
                "What is the fee for fee-paying students in BSc. Actuarial Science?",
                "Are there fee waivers for BSc. Actuarial Science?",
                "Are scholarships available to cover BSc. Actuarial Science fees?",
                "What are the financial aid options for BSc. Actuarial Science?",
                "How much should I budget for BSc. Actuarial Science fees?",
                "Is there a fee refund policy for BSc. Actuarial Science?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Actuarial Science?",
                "What is the refund policy for BSc. Actuarial Science fees?",
                "What is the deadline for paying BSc. Actuarial Science fees?",
                "Can I get a fee extension for BSc. Actuarial Science?",
                "What is the penalty for late payment of BSc. Actuarial Science fees?",
                "Can I pay BSc. Actuarial Science fees in multiple payments?",
                "Are there any hidden costs for BSc. Actuarial Science?",
                "What are the compulsory fees for BSc. Actuarial Science?",
                "Can I pay BSc. Actuarial Science fees with a payment plan?",
                "How often do I need to pay fees for BSc. Actuarial Science?",
                "What are the semester fees for BSc. Actuarial Science?",
                "Is there an application fee for BSc. Actuarial Science?",
                "What is the registration fee for BSc. Actuarial Science?",
                "Are the fees for BSc. Actuarial Science fixed or variable?",
                "What is the cost per credit hour for BSc. Actuarial Science?",
                "Are there any discounts available for BSc. Actuarial Science fees?",
                "Can I get a fee breakdown for BSc. Actuarial Science?",
                "What are the non-tuition fees for BSc. Actuarial Science?",
                "Are there any additional charges for BSc. Actuarial Science?",
                "How much is the acceptance fee for BSc. Actuarial Science?",
                "Can I book a hall without paying the BSc. Actuarial Science fees?",
                "What are the hostel booking requirements for BSc. Actuarial Science?",
                "When are the BSc. Actuarial Science fees due?",
                "What is the initial deposit for BSc. Actuarial Science fees?",
                "How do I pay my BSc. Actuarial Science fees online?",
                "Are there any late fees for BSc. Actuarial Science?",
                "What is the mode of payment for BSc. Actuarial Science fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Actuarial Science?",
                "How do I access my fee statement for BSc. Actuarial Science?",
                "What is the last date to pay fees for BSc. Actuarial Science?",
                "Is there an online payment option for BSc. Actuarial Science fees?",
                "What is the procedure for paying BSc. Actuarial Science fees?",
                "What is the tuition fee for the first year of BSc. Actuarial Science?",
                "Are there any financial aid options for BSc. Actuarial Science?",
                "What is included in the BSc. Actuarial Science fee?",
                "Can I get a fee waiver for BSc. Actuarial Science?"
            ],
            "responses": [
                "The fees for BSc. Actuarial Science programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "statistics_requirement",
            "patterns": [
                "What are the requirements for BSc. Statistics?",
                "Can you provide the admission criteria for BSc. Statistics?",
                "Requirements for BSc. Statistics programme?",
                "What are the prerequisites for BSc. Statistics?",
                "BSc. Statistics admission requirements?",
                "Information on eligibility for BSc. Statistics?",
                "What are the entry requirements for BSc. Statistics?",
                "Criteria for admission into BSc. Statistics?",
                "BSc. Statistics programme prerequisites?",
                "What are the admission requirements for BSc. Statistics?",
                "What are the eligibility criteria for BSc. Statistics?",
                "How can I apply for BSc. Statistics?",
                "What do I need to qualify for BSc. Statistics?",
                "Requirements for enrolling in BSc. Statistics?",
                "What is needed to get into BSc. Statistics?",
                "Criteria for BSc. Statistics programme admission?",
                "What qualifications are needed for BSc. Statistics?",
                "Admission criteria for BSc. Statistics?",
                "BSc. Statistics entry requirements?",
                "What are the prerequisites for studying BSc. Statistics?",
                "What qualifications do I need for BSc. Statistics?",
                "Requirements to apply for BSc. Statistics programme?",
                "What are the core requirements for BSc. Statistics?",
                "BSc. Statistics application criteria?",
                "What subjects are needed for BSc. Statistics?",
                "BSc. Statistics programme admission criteria?",
                "What are the core subjects for BSc. Statistics admission?",
                "What qualifications do mature students need for BSc. Statistics?",
                "Requirements for mature students applying for BSc. Statistics?",
                "What are the entry qualifications for BSc. Statistics?",
                "How do I qualify for BSc. Statistics?",
                "What are the criteria for admission into BSc. Statistics?",
                "BSc. Statistics programme prerequisites?",
                "What is the entry requirement for BSc. Statistics?",
                "Admission requirements for BSc. Statistics programme?",
                "What do I need to apply for BSc. Statistics?",
                "Eligibility criteria for BSc. Statistics?",
                "What is needed for BSc. Statistics admission?",
                "Requirements for BSc. Statistics course?",
                "BSc. Statistics programme entry qualifications?",
                "What is required to study BSc. Statistics?",
                "What are the requirements for enrolling in BSc. Statistics?",
                "What are the necessary qualifications for BSc. Statistics?",
                "Criteria for enrolling in BSc. Statistics?",
                "What qualifications are needed for BSc. Statistics programme?",
                "BSc. Statistics admission requirements and criteria?",
                "What are the core subjects needed for BSc. Statistics?",
                "How to qualify for BSc. Statistics?",
                "What are the prerequisites for BSc. Statistics admission?",
                "BSc. Statistics course requirements?",
                "Admission criteria for BSc. Statistics course?",
                "What qualifications do I need for admission into BSc. Statistics?",
                "What is the eligibility for BSc. Statistics programme?",
                "What are the requirements for BSc. Statistics course entry?",
                "What are the prerequisites for BSc. Statistics course?",
                "BSc. Statistics admission qualifications?",
                "What are the necessary requirements for BSc. Statistics admission?"
            ],
            "responses": [
                "Here are the requirements for BSc. Statistics <ul><li><b><u>WASSCE/SSSCE APPLICANTS</u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Mathematics and any TWO (2) Elective Subjects. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in THREE (3) subjects including Mathematics. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul><br><li><b><u>HND AND OTHER DIPLOMA </u></b></li><p>Applicants must have a minimum of 2nd Class Lower Division in the following programmes:  Statistics, Mathematics, Engineering, Economics, or any programme with the Mathematical Sciences with evidence of Mathematical or qualitative ability. </p></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Statistics Cutoff Points",
            "patterns": [
                "cutoff points for BSc Statistics",
                "BSc Statistics cutoff points",
                "minimum score for BSc Statistics",
                "required score for BSc Statistics",
                "aggregate for BSc Statistics",
                "what is the cutoff for BSc Statistics",
                "cutoff marks for BSc Statistics",
                "BSc Statistics required marks",
                "what aggregate do I need for BSc Statistics",
                "score needed for BSc Statistics",
                "cutoff points for statistics",
                "aggregate requirements for statistics",
                "what were the cut-off aggregates for statistics",
                "what are the cut-off aggregates statistics",
                "What is the aggregate required for BSc Statistics?",
                "What are the cutoff marks for BSc Statistics?",
                "BSc Statistics score requirements?",
                "What is the minimum aggregate for BSc Statistics?",
                "BSc Statistics admission cutoff points?",
                "What cutoff is needed for BSc Statistics?",
                "Cutoff for BSc Statistics programme?",
                "What score do I need for BSc Statistics?",
                "Aggregate score for BSc Statistics admission?",
                "Cutoff points for BSc Statistics course?",
                "Required aggregate for BSc Statistics?",
                "What is the minimum score for BSc Statistics?",
                "BSc Statistics required aggregate points?",
                "What are the cut-off marks for BSc Statistics?",
                "What cutoff score is needed for BSc Statistics?",
                "BSc Statistics programme aggregate requirements?",
                "What are the cutoff scores for BSc Statistics?",
                "Minimum cutoff points for BSc Statistics?",
                "Required cutoff marks for BSc Statistics?",
                "Aggregate requirements for BSc Statistics?",
                "What cutoff do I need for BSc Statistics?",
                "BSc Statistics minimum score required?",
                "BSc Statistics course cutoff points?",
                "What is the cutoff aggregate for BSc Statistics?",
                "Cutoff points for Statistics programme?",
                "Required score for admission to BSc Statistics?",
                "What aggregate is needed for BSc Statistics?",
                "BSc Statistics admission score?",
                "What are the cutoff points for Statistics?",
                "What score is required for BSc Statistics?",
                "BSc Statistics entry aggregate points?",
                "Aggregate needed for BSc Statistics admission?",
                "BSc Statistics admission cutoff marks?",
                "Cutoff for Statistics degree?",
                "Minimum score for BSc Statistics programme?",
                "What are the required cutoff points for BSc Statistics?",
                "BSc Statistics course entry score?",
                "Aggregate score for Statistics admission?",
                "What cutoff points are required for BSc Statistics?",
                "BSc Statistics programme entry score?",
                "Minimum aggregate score for BSc Statistics?",
                "Required points for BSc Statistics admission?",
                "What is the cut-off aggregate for BSc Statistics?",
                "Cutoff marks needed for BSc Statistics?",
                "What is the required aggregate for Statistics?",
                "BSc Statistics entry cutoff points?",
                "What is the admission cutoff for BSc Statistics?",
                "Required marks for BSc Statistics admission?",
                "What cutoff is needed for Statistics programme?",
                "BSc Statistics minimum aggregate points?",
                "Cutoff points needed for BSc Statistics admission?"
            
            ],
            "responses": [
                "The cutoff points for BSc. Statistics are typically around aggregate 12. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Statistics fees",
            "patterns": [
                "what is the fees for Statistics",
                "Can I know the amount I will pay for Statistics",
                "Can i pay the fees in installment for Statistics?",
                "When should i pay the fees for Statistics?",
                "Can i book for a hall before paying fees for Statistics",
                "How much are the fees for BSc. Statistics?",
                "What are the tuition fees for BSc. Statistics?",
                "How much do I need to pay for BSc. Statistics?",
                "What is the cost of the BSc. Statistics programme?",
                "Can you provide the fee details for BSc. Statistics?",
                "What is the tuition cost for BSc. Statistics?",
                "How much is the fee for studying Statistics?",
                "What is the payment schedule for BSc. Statistics fees?",
                "Do I have to pay the full fee for BSc. Statistics upfront?",
                "What is the fee structure for BSc. Statistics?",
                "Can I pay my BSc. Statistics fees in installments?",
                "What are the fee payment options for BSc. Statistics?",
                "How are the fees for BSc. Statistics calculated?",
                "Are there any additional costs for BSc. Statistics?",
                "What is the total cost of BSc. Statistics for a year?",
                "Are there any extra fees for BSc. Statistics?",
                "Can I get a breakdown of the BSc. Statistics fees?",
                "What is the annual fee for BSc. Statistics?",
                "How much does each semester cost for BSc. Statistics?",
                "What are the miscellaneous fees for BSc. Statistics?",
                "Are there any lab fees for BSc. Statistics?",
                "What are the accommodation fees for BSc. Statistics?",
                "How much are the hostel fees for BSc. Statistics students?",
                "What is the fee for international students in BSc. Statistics?",
                "Do international students pay higher fees for BSc. Statistics?",
                "What is the fee for fee-paying students in BSc. Statistics?",
                "Are there fee waivers for BSc. Statistics?",
                "Are scholarships available to cover BSc. Statistics fees?",
                "What are the financial aid options for BSc. Statistics?",
                "How much should I budget for BSc. Statistics fees?",
                "Is there a fee refund policy for BSc. Statistics?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Statistics?",
                "What is the refund policy for BSc. Statistics fees?",
                "What is the deadline for paying BSc. Statistics fees?",
                "Can I get a fee extension for BSc. Statistics?",
                "What is the penalty for late payment of BSc. Statistics fees?",
                "Can I pay BSc. Statistics fees in multiple payments?",
                "Are there any hidden costs for BSc. Statistics?",
                "What are the compulsory fees for BSc. Statistics?",
                "Can I pay BSc. Statistics fees with a payment plan?",
                "How often do I need to pay fees for BSc. Statistics?",
                "What are the semester fees for BSc. Statistics?",
                "Is there an application fee for BSc. Statistics?",
                "What is the registration fee for BSc. Statistics?",
                "Are the fees for BSc. Statistics fixed or variable?",
                "What is the cost per credit hour for BSc. Statistics?",
                "Are there any discounts available for BSc. Statistics fees?",
                "Can I get a fee breakdown for BSc. Statistics?",
                "What are the non-tuition fees for BSc. Statistics?",
                "Are there any additional charges for BSc. Statistics?",
                "How much is the acceptance fee for BSc. Statistics?",
                "Can I book a hall without paying the BSc. Statistics fees?",
                "What are the hostel booking requirements for BSc. Statistics?",
                "When are the BSc. Statistics fees due?",
                "What is the initial deposit for BSc. Statistics fees?",
                "How do I pay my BSc. Statistics fees online?",
                "Are there any late fees for BSc. Statistics?",
                "What is the mode of payment for BSc. Statistics fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Statistics?",
                "How do I access my fee statement for BSc. Statistics?",
                "What is the last date to pay fees for BSc. Statistics?",
                "Is there an online payment option for BSc. Statistics fees?",
                "What is the procedure for paying BSc. Statistics fees?",
                "What is the tuition fee for the first year of BSc. Statistics?",
                "Are there any financial aid options for BSc. Statistics?",
                "What is included in the BSc. Statistics fee?",
                "Can I get a fee waiver for BSc. Statistics?"
            ],
            "responses": [
                "The fees for BSc. Statistics programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        },



        {
            "tag": "computer_science_requirement",
            "patterns": [
                "What are the requirements for BSc. Computer Science?",
                "Can you provide the admission criteria for BSc. Computer Science?",
                "Requirements for BSc. Computer Science programme?",
                "What are the prerequisites for BSc. Computer Science?",
                "BSc. Computer Science admission requirements?",
                "Information on eligibility for BSc. Computer Science?",
                "What are the entry requirements for BSc. Computer Science?",
                "Criteria for admission into BSc. Computer Science?",
                "BSc. Computer Science programme prerequisites?",
                "minimum score for computer",
                "how high must my aggregate be for computer science",
                "What are the core requirements for BSc. Computer Science?",
                "BSc. Computer Science admission criteria?",
                "Entry requirements for BSc. Computer Science?",
                "What do I need to be admitted to BSc. Computer Science?",
                "Prerequisites for BSc. Computer Science programme?",
                "BSc. Computer Science core subjects required?",
                "What qualifications are needed for BSc. Computer Science?",
                "Requirements for enrolling in BSc. Computer Science?",
                "What subjects are required for BSc. Computer Science?",
                "Minimum academic requirements for BSc. Computer Science?",
                "Criteria for BSc. Computer Science admission?",
                "What are the eligibility requirements for BSc. Computer Science?",
                "BSc. Computer Science programme entry criteria?",
                "What are the academic requirements for BSc. Computer Science?",
                "BSc. Computer Science admission prerequisites?",
                "Requirements for applying to BSc. Computer Science?",
                "What qualifications do I need for BSc. Computer Science?",
                "BSc. Computer Science admission eligibility?",
                "What are the academic prerequisites for BSc. Computer Science?",
                "Criteria to get into BSc. Computer Science?",
                "What are the entry criteria for BSc. Computer Science?",
                "BSc. Computer Science minimum qualification requirements?",
                "What are the core admission requirements for BSc. Computer Science?",
                "Eligibility criteria for BSc. Computer Science?",
                "What are the necessary subjects for BSc. Computer Science?",
                "BSc. Computer Science admission subjects?",
                "What is required to qualify for BSc. Computer Science?",
                "What subjects must be passed for BSc. Computer Science?",
                "BSc. Computer Science programme admission requirements?",
                "Core subjects needed for BSc. Computer Science?",
                "What are the requirements for studying BSc. Computer Science?",
                "What qualifications are required for BSc. Computer Science?",
                "BSc. Computer Science academic entry requirements?",
                "What do I need to be eligible for BSc. Computer Science?",
                "BSc. Computer Science entry requirements and criteria?",
                "Admission criteria for BSc. Computer Science programme?",
                "What subjects are needed for BSc. Computer Science admission?",
                "BSc. Computer Science programme entry requirements?",
                "What are the necessary qualifications for BSc. Computer Science?",
                "Core subjects for BSc. Computer Science entry?",
                "Minimum subjects required for BSc. Computer Science?",
                "What is required for BSc. Computer Science admission?",
                "What are the admission subjects for BSc. Computer Science?",
                "Requirements for BSc. Computer Science admission and entry?",
                "What do I need to apply for BSc. Computer Science?",
                "BSc. Computer Science programme admission subjects?",
                "What are the entry qualifications for BSc. Computer Science?",
                "Minimum academic criteria for BSc. Computer Science?",
                "Requirements to enroll in BSc. Computer Science programme?",
                "What are the core subjects needed for BSc. Computer Science?",
                "BSc. Computer Science programme admission criteria?",
                "What are the prerequisites for BSc. Computer Science programme?"
            ],
            "responses": [
                "Here are the requirements for BSc. Computer Science <ul><li><b><u>WASSCE/SSSCE APPLICANTS </u></b></li><p><b>Core Subjects:</b> Credit passes in English Language, Mathematics, and Integrated Science. </p><p><b>Elective Subjects:</b> Credit passes in Mathematics, Physics and either Chemistry or Applied Electricity or Electronics. </p><br><li><b><u>'A' LEVEL AND EQUIVALENT </u></b></li><p><b>'O' Level or equivalent:</b> Credit passes in FIVE (5) subjects including English  Language, Mathematics, and Additional/Elective Mathematics, and </p><p><b>'A' Level or equivalent:</b>  Credit passes in THREE (3) subjects including  Mathematics. </p><br><li><b><u>MATURE APPLICANTS </u></b></li><ul><li>Applicants should be at least 25 years at the time of the application.  </li><li>Applicants must satisfy the general requirements for the programme (i.e WASSCE/SSSCE, or 'A' Level, or HND/Diploma) </li><li>Short-listed applicants may take an Entrance Examination and pass an interview. </li></ul></ul>"
            ],
            "context_set": ""
        },

        {
            "tag": "BSc Computer Science Cutoff Points",
            "patterns": [
                "cutoff points for BSc Computer Science",
                "BSc Computer Science cutoff points",
                "minimum score for BSc Computer Science",
                "required score for BSc Computer Science",
                "aggregate for BSc Computer Science",
                "what is the cutoff for BSc Computer Science",
                "cutoff marks for BSc Computer Science",
                "BSc Computer Science required marks",
                "what aggregate do I need for BSc Computer Science",
                "score needed for BSc Computer Science",
                "cutoff points for computer science",
                "aggregate requirements for computer science",
                "what were the cut-off aggregates for computer science",
                "what are the cut-off aggregates computer science",
                "What are the cutoff points for BSc Computer Science?",
                "BSc Computer Science required aggregate?",
                "What score is needed for BSc Computer Science?",
                "Minimum aggregate for BSc Computer Science?",
                "Cutoff marks for BSc Computer Science programme?",
                "What is the required cutoff for BSc Computer Science?",
                "Score needed to get into BSc Computer Science?",
                "BSc Computer Science aggregate requirements?",
                "What is the minimum score for BSc Computer Science?",
                "Cutoff aggregate for BSc Computer Science?",
                "What were the cutoff points for BSc Computer Science last year?",
                "Aggregate needed for BSc Computer Science admission?",
                "Current cutoff for BSc Computer Science?",
                "Required marks for BSc Computer Science programme?",
                "BSc Computer Science admission cutoff points?",
                "What aggregate is required for BSc Computer Science?",
                "Cutoff marks for Computer Science degree?",
                "BSc Computer Science minimum entry score?",
                "What are the cutoff aggregates for BSc Computer Science?",
                "BSc Computer Science programme cutoff points?",
                "Required aggregate for BSc Computer Science admission?",
                "What cutoff is needed for BSc Computer Science?",
                "BSc Computer Science admission score?",
                "Cutoff points for Computer Science degree programme?",
                "What is the cutoff score for BSc Computer Science?",
                "Aggregate requirements for BSc Computer Science?",
                "What are the cutoff requirements for BSc Computer Science?",
                "Score needed for admission to BSc Computer Science?",
                "BSc Computer Science entry aggregate?",
                "What were the cutoff points for BSc Computer Science last year?",
                "Current aggregate for BSc Computer Science admission?",
                "Required score for Computer Science programme?",
                "BSc Computer Science cutoff marks?",
                "What are the minimum cutoff points for BSc Computer Science?",
                "BSc Computer Science cutoff scores?",
                "What are the cut-off scores for BSc Computer Science?",
                "Aggregate needed for BSc Computer Science programme?",
                "BSc Computer Science entry score requirements?",
                "Cutoff points for BSc Computer Science course?",
                "What is the minimum aggregate for BSc Computer Science?",
                "Required aggregate marks for BSc Computer Science?",
                "What are the cutoff marks for Computer Science?",
                "BSc Computer Science admission aggregate points?",
                "What cutoff is required for BSc Computer Science?",
                "BSc Computer Science minimum aggregate requirements?",
                "Cutoff points for Computer Science programme?",
                "What were the cutoff scores for BSc Computer Science?",
                "BSc Computer Science required score?",
                "Current cutoff points for BSc Computer Science?",
                "Required aggregate score for BSc Computer Science?",
                "BSc Computer Science cutoff requirements?",
                "What is the cutoff score for Computer Science?"
            ],
            "responses": [
                "The cutoff points for BSc. Computer Science are typically around aggregate 11. Please check our website or contact the admissions office for the most up-to-date information, as cutoff points may vary each year."
            ],
            "context_set": ""
        },

        {
            "tag": "bsc Computer Science fees",
            "patterns": [
                "what is the fees for Computer Science",
                "Can I know the amount I will pay for Computer Science",
                "Can i pay the fees in installment for Computer Science?",
                "When should i pay the fees for Computer Science?",
                "Can i book for a hall before paying fees for Computer Science",
                "How much are the fees for BSc. Computer Science?",
                "What are the tuition fees for BSc. Computer Science?",
                "How much do I need to pay for BSc. Computer Science?",
                "What is the cost of the BSc. Computer Science programme?",
                "Can you provide the fee details for BSc. Computer Science?",
                "What is the tuition cost for BSc. Computer Science?",
                "How much is the fee for studying Computer Science?",
                "What is the payment schedule for BSc. Computer Science fees?",
                "Do I have to pay the full fee for BSc. Computer Science upfront?",
                "What is the fee structure for BSc. Computer Science?",
                "Can I pay my BSc. Computer Science fees in installments?",
                "What are the fee payment options for BSc. Computer Science?",
                "How are the fees for BSc. Computer Science calculated?",
                "Are there any additional costs for BSc. Computer Science?",
                "What is the total cost of BSc. Computer Science for a year?",
                "Are there any extra fees for BSc. Computer Science?",
                "Can I get a breakdown of the BSc. Computer Science fees?",
                "What is the annual fee for BSc. Computer Science?",
                "How much does each semester cost for BSc. Computer Science?",
                "What are the miscellaneous fees for BSc. Computer Science?",
                "Are there any lab fees for BSc. Computer Science?",
                "What are the accommodation fees for BSc. Computer Science?",
                "How much are the hostel fees for BSc. Computer Science students?",
                "What is the fee for international students in BSc. Computer Science?",
                "Do international students pay higher fees for BSc. Computer Science?",
                "What is the fee for fee-paying students in BSc. Computer Science?",
                "Are there fee waivers for BSc. Computer Science?",
                "Are scholarships available to cover BSc. Computer Science fees?",
                "What are the financial aid options for BSc. Computer Science?",
                "How much should I budget for BSc. Computer Science fees?",
                "Is there a fee refund policy for BSc. Computer Science?",
                "What happens if I miss the fee payment deadline?",
                "Are there penalties for late fee payment for BSc. Computer Science?",
                "What is the refund policy for BSc. Computer Science fees?",
                "What is the deadline for paying BSc. Computer Science fees?",
                "Can I get a fee extension for BSc. Computer Science?",
                "What is the penalty for late payment of BSc. Computer Science fees?",
                "Can I pay BSc. Computer Science fees in multiple payments?",
                "Are there any hidden costs for BSc. Computer Science?",
                "What are the compulsory fees for BSc. Computer Science?",
                "Can I pay BSc. Computer Science fees with a payment plan?",
                "How often do I need to pay fees for BSc. Computer Science?",
                "What are the semester fees for BSc. Computer Science?",
                "Is there an application fee for BSc. Computer Science?",
                "What is the registration fee for BSc. Computer Science?",
                "Are the fees for BSc. Computer Science fixed or variable?",
                "What is the cost per credit hour for BSc. Computer Science?",
                "Are there any discounts available for BSc. Computer Science fees?",
                "Can I get a fee breakdown for BSc. Computer Science?",
                "What are the non-tuition fees for BSc. Computer Science?",
                "Are there any additional charges for BSc. Computer Science?",
                "How much is the acceptance fee for BSc. Computer Science?",
                "Can I book a hall without paying the BSc. Computer Science fees?",
                "What are the hostel booking requirements for BSc. Computer Science?",
                "When are the BSc. Computer Science fees due?",
                "What is the initial deposit for BSc. Computer Science fees?",
                "How do I pay my BSc. Computer Science fees online?",
                "Are there any late fees for BSc. Computer Science?",
                "What is the mode of payment for BSc. Computer Science fees?",
                "Can I pay my fees through bank transfer?",
                "Is there a fee payment portal for BSc. Computer Science?",
                "How do I access my fee statement for BSc. Computer Science?",
                "What is the last date to pay fees for BSc. Computer Science?",
                "Is there an online payment option for BSc. Computer Science fees?",
                "What is the procedure for paying BSc. Computer Science fees?",
                "What is the tuition fee for the first year of BSc. Computer Science?",
                "Are there any financial aid options for BSc. Computer Science?",
                "What is included in the BSc. Computer Science fee?",
                "Can I get a fee waiver for BSc. Computer Science?"
            ],
            "responses": [
                "The fees for BSc. Computer Science programme at KNUST for the 2024/2025 academic year vary. The specific amount can differ based on factors such as whether you are a local or international student, and whether you are enrolled as a regular or fee-paying students. Please check the official KNUST website for the most up-to-date information on fees.<br> Here are some general guidelines for the fee structure:<br> <ul> <li>Regular programmes typically have lower fees compared to fee-paying.</li> <li>Fee-paying options are available for students who do not meet the regular admission criteria but are willing to pay extra fees for admission.</li> </ul>  <br><br>Fees must be payed after offer of admission. Fees should be payed before booking for a traditional hall. Fees must be payed in full."
            ],
            "context_set": ""
        }
    ]
}