{
    "intents": [
        {
            "tag": "shs_general_science",
            "patterns": [
                "I studied general science in shs, what programmes can I read in KNUST?",
                "With a general science background in shs, what programmes are available for me?",
                "If I studied general science in shs, what can I read in university?",
                "What courses can I take at KNUST with a general science background?",
                "Which programmes are open to general science students in shs?",
                "What can I study at KNUST with a general science background?",
                "What programmes are available for general science students?",
                "What courses are available at KNUST for shs science students?",
                "What university programmes can I pursue with a general science background?",
                "Which courses are suitable for a general science background?",
                "What programmes can I apply for with a general science background?",
                "What are my options at KNUST with a general science background?",
                "What can a general science student study in university?",
                "Which university programmes accept general science students?",
                "What are the course options for general science students in shs?",
                "What can I do with a general science background at KNUST?",
                "What are the available programmes for general science students at KNUST?",
                "What courses can general science students pursue at university?",
                "What programmes are there for general science students?",
                "What can I study at KNUST with a background in general science?",
                "What are the possible courses for a general science student in university?",
                "What programmes does KNUST offer for general science students?",
                "What are the study options for a general science student at KNUST?",
                "Which courses can I take if I studied general science in shs?",
                "What are the KNUST programmes for general science students?",
                "What university courses can I apply for with a general science background?",
                "Which programmes can I read with a general science background at KNUST?",
                "What courses are open to general science students at KNUST?",
                "What study options are there for general science students at university?",
                "What programmes can I pursue at KNUST with a general science background?",
                "What can a general science student read in university at KNUST?",
                "Which programmes at KNUST are available for general science students?",
                "What courses can a general science student apply for at KNUST?",
                "What are the academic options for general science students at KNUST?",
                "What can I study in university with a general science background?",
                "What programmes can a general science student choose at KNUST?",
                "What are the available university courses for general science students?",
                "What programmes can I enroll in at KNUST with a general science background?",
                "What can I pursue at KNUST with a general science background?",
                "What are the suitable university programmes for general science students?",
                "what programme can i read if i studied general science in high school"
            ],
            "responses": [
                "With a general science background from SHS, you can pursue various programmes at KNUST, including but not limited to Engineering, Medicine, Pharmacy, Computer Science, Biological Sciences, and Physical Sciences. Please refer to the specific programme requirements for more details. Remember to consider your interests, career goals and minimum aggregate when choosing a program. You can also explore other faculties like Pharmacy and Pharmaceutical Sciences, and Architecture and Built Environment for potential options."
            ],
            "context_set": ""
        },


        {
            "tag": "shs_general_arts",
            "patterns": [
                "I studied general arts in shs, what programmes can I read in KNUST?",
                "With a general arts background in shs, what programmes are available for me?",
                "If I studied general arts in shs, what can I read in university?",
                "What courses can I take at KNUST with a general arts background?",
                "Which programmes are open to general arts students in shs?",
                "What can I study at KNUST with a general arts background?",
                "What programmes are available for general arts students?",
                "What courses are available at KNUST for shs arts students?",
                "What university programmes can I pursue with a general arts background?",
                "Which courses are suitable for a general arts background?",
                "What programmes can I apply for with a general arts background?",
                "What are my options at KNUST with a general arts background?",
                "What can a general arts student study in university?",
                "Which university programmes accept general arts students?",
                "What are the course options for general arts students in shs?",
                "What can I do with a general arts background at KNUST?",
                "What are the available programmes for general arts students at KNUST?",
                "What courses can general arts students pursue at university?",
                "What programmes are there for general arts students?",
                "What can I study at KNUST with a background in general arts?",
                "What are the possible courses for a general arts student in university?",
                "What programmes does KNUST offer for general arts students?",
                "What are the study options for a general arts student at KNUST?",
                "Which courses can I take if I studied general arts in shs?",
                "What are the KNUST programmes for general arts students?",
                "What university courses can I apply for with a general arts background?",
                "Which programmes can I read with a general arts background at KNUST?",
                "What courses are open to general arts students at KNUST?",
                "What study options are there for general arts students at university?",
                "What programmes can I pursue at KNUST with a general arts background?",
                "What can a general arts student read in university at KNUST?",
                "Which programmes at KNUST are available for general arts students?",
                "What courses can a general arts student apply for at KNUST?",
                "What are the academic options for general arts students at KNUST?",
                "What can I study in university with a general arts background?",
                "What programmes can a general arts student choose at KNUST?",
                "What are the available university courses for general arts students?",
                "What programmes can I enroll in at KNUST with a general arts background?",
                "What can I pursue at KNUST with a general arts background?",
                "What are the suitable university programmes for general arts students?",
                "can i read medicine with a general art background?"
            ],
            "responses": [
                "With a general arts background from SHS, you can pursue various programmes at KNUST, including but not limited to Law, Political Science, Sociology, Economics, Geography, History, English, and Languages. Please refer to the specific programme requirements for more details. Remember to consider your interests, career goals, and minimum aggregate when choosing a program. You can also explore other faculties like Social Sciences, Business, and Art and Design for potential options."
            ],
            "context_set": ""
        },


        {
            "tag": "shs_business",
            "patterns": [
                "I studied business in shs, what programmes can I read in KNUST?",
                "With a business background in shs, what programmes are available for me?",
                "If I studied business in shs, what can I read in university?",
                "What courses can I take at KNUST with a business background?",
                "Which programmes are open to business students in shs?",
                "What can I study at KNUST with a business background?",
                "What programmes are available for business students?",
                "What courses are available at KNUST for shs business students?",
                "What university programmes can I pursue with a business background?",
                "Which courses are suitable for a business background?",
                "What programmes can I apply for with a business background?",
                "What are my options at KNUST with a business background?",
                "What can a business student study in university?",
                "Which university programmes accept business students?",
                "What are the course options for business students in shs?",
                "What can I do with a business background at KNUST?",
                "What are the available programmes for business students at KNUST?",
                "What courses can business students pursue at university?",
                "What programmes are there for business students?",
                "What can I study at KNUST with a background in business?",
                "What are the possible courses for a business student in university?",
                "What programmes does KNUST offer for business students?",
                "What are the study options for a business student at KNUST?",
                "Which courses can I take if I studied business in shs?",
                "What are the KNUST programmes for business students?",
                "What university courses can I apply for with a business background?",
                "Which programmes can I read with a business background at KNUST?",
                "What courses are open to business students at KNUST?",
                "What study options are there for business students at university?",
                "What programmes can I pursue at KNUST with a business background?",
                "What can a business student read in university at KNUST?",
                "Which programmes at KNUST are available for business students?",
                "What courses can a business student apply for at KNUST?",
                "What are the academic options for business students at KNUST?",
                "What can I study in university with a business background?",
                "What programmes can a business student choose at KNUST?",
                "What are the available university courses for business students?",
                "What programmes can I enroll in at KNUST with a business background?",
                "What can I pursue at KNUST with a business background?",
                "What are the suitable university programmes for business students?"
            ],
            "responses": [
                "With a business background from SHS, you can pursue various programmes at KNUST, including but not limited to Business Administration, Accounting, Banking and Finance, Marketing, Human Resource Management, and Supply Chain Management. Please refer to the specific programme requirements for more details. Remember to consider your interests, career goals, and minimum aggregate when choosing a program. You can also explore other faculties like Social Sciences and Art and Design for potential options."
            ],
            "context_set": ""
        },


        {
            "tag": "shs_home_economics",
            "patterns": [
                "I studied home economics in shs, what programmes can I read in KNUST?",
                "With a home economics background in shs, what programmes are available for me?",
                "If I studied home economics in shs, what can I read in university?",
                "What courses can I take at KNUST with a home economics background?",
                "Which programmes are open to home economics students in shs?",
                "What can I study at KNUST with a home economics background?",
                "What programmes are available for home economics students?",
                "What courses are available at KNUST for shs home economics students?",
                "What university programmes can I pursue with a home economics background?",
                "Which courses are suitable for a home economics background?",
                "What programmes can I apply for with a home economics background?",
                "What are my options at KNUST with a home economics background?",
                "What can a home economics student study in university?",
                "Which university programmes accept home economics students?",
                "What are the course options for home economics students in shs?",
                "What can I do with a home economics background at KNUST?",
                "What are the available programmes for home economics students at KNUST?",
                "What courses can home economics students pursue at university?",
                "What programmes are there for home economics students?",
                "What can I study at KNUST with a background in home economics?",
                "What are the possible courses for a home economics student in university?",
                "What programmes does KNUST offer for home economics students?",
                "What are the study options for a home economics student at KNUST?",
                "Which courses can I take if I studied home economics in shs?",
                "What are the KNUST programmes for home economics students?",
                "What university courses can I apply for with a home economics background?",
                "Which programmes can I read with a home economics background at KNUST?",
                "What courses are open to home economics students at KNUST?",
                "What study options are there for home economics students at university?",
                "What programmes can I pursue at KNUST with a home economics background?",
                "What can a home economics student read in university at KNUST?",
                "Which programmes at KNUST are available for home economics students?",
                "What courses can a home economics student apply for at KNUST?",
                "What are the academic options for home economics students at KNUST?",
                "What can I study in university with a home economics background?",
                "What programmes can a home economics student choose at KNUST?",
                "What are the available university courses for home economics students?",
                "What programmes can I enroll in at KNUST with a home economics background?",
                "What can I pursue at KNUST with a home economics background?",
                "What are the suitable university programmes for home economics students?"
            ],
            "responses": [
                "With a home economics background from SHS, you can pursue various programmes at KNUST, including but not limited to Hospitality Management, Food Science and Technology, Fashion Design, and Textiles, Nutrition and Dietetics, and Family and Consumer Sciences. Please refer to the specific programme requirements for more details. Remember to consider your interests, career goals, and minimum aggregate when choosing a program. You can also explore other faculties like Art and Design and Social Sciences for potential options."
            ],
            "context_set": ""
        },


        {
            "tag": "shs_visual_arts",
            "patterns": [
                "I studied visual arts in shs, what programmes can I read in KNUST?",
                "With a visual arts background in shs, what programmes are available for me?",
                "If I studied visual arts in shs, what can I read in university?",
                "What courses can I take at KNUST with a visual arts background?",
                "Which programmes are open to visual arts students in shs?",
                "What can I study at KNUST with a visual arts background?",
                "What programmes are available for visual arts students?",
                "What courses are available at KNUST for shs visual arts students?",
                "What university programmes can I pursue with a visual arts background?",
                "Which courses are suitable for a visual arts background?",
                "What programmes can I apply for with a visual arts background?",
                "What are my options at KNUST with a visual arts background?",
                "What can a visual arts student study in university?",
                "Which university programmes accept visual arts students?",
                "What are the course options for visual arts students in shs?",
                "What can I do with a visual arts background at KNUST?",
                "What are the available programmes for visual arts students at KNUST?",
                "What courses can visual arts students pursue at university?",
                "What programmes are there for visual arts students?",
                "What can I study at KNUST with a background in visual arts?",
                "What are the possible courses for a visual arts student in university?",
                "What programmes does KNUST offer for visual arts students?",
                "What are the study options for a visual arts student at KNUST?",
                "Which courses can I take if I studied visual arts in shs?",
                "What are the KNUST programmes for visual arts students?",
                "What university courses can I apply for with a visual arts background?",
                "Which programmes can I read with a visual arts background at KNUST?",
                "What courses are open to visual arts students at KNUST?",
                "What study options are there for visual arts students at university?",
                "What programmes can I pursue at KNUST with a visual arts background?",
                "What can a visual arts student read in university at KNUST?",
                "Which programmes at KNUST are available for visual arts students?",
                "What courses can a visual arts student apply for at KNUST?",
                "What are the academic options for visual arts students at KNUST?",
                "What can I study in university with a visual arts background?",
                "What programmes can a visual arts student choose at KNUST?",
                "What are the available university courses for visual arts students?",
                "What programmes can I enroll in at KNUST with a visual arts background?",
                "What can I pursue at KNUST with a visual arts background?",
                "What are the suitable university programmes for visual arts students?"
            ],
            "responses": [
                "With a visual arts background from SHS, you can pursue various programmes at KNUST, including but not limited to Fine Art, Industrial Art, Communication Design, Painting, Sculpture, Ceramics, Graphic Design, and Textiles. Please refer to the specific programme requirements for more details. Remember to consider your interests, career goals, and minimum aggregate when choosing a program. You can also explore other faculties like Architecture and Built Environment and Social Sciences for potential options."
            ],
            "context_set": ""
        },


        {
            "tag": "shs_agriculture",
            "patterns": [
                "I studied agriculture in shs, what programmes can I read in KNUST?",
                "With an agriculture background in shs, what programmes are available for me?",
                "If I studied agriculture in shs, what can I read in university?",
                "What courses can I take at KNUST with an agriculture background?",
                "Which programmes are open to agriculture students in shs?",
                "What can I study at KNUST with an agriculture background?",
                "What programmes are available for agriculture students?",
                "What courses are available at KNUST for shs agriculture students?",
                "What university programmes can I pursue with an agriculture background?",
                "Which courses are suitable for an agriculture background?",
                "What programmes can I apply for with an agriculture background?",
                "What are my options at KNUST with an agriculture background?",
                "What can an agriculture student study in university?",
                "Which university programmes accept agriculture students?",
                "What are the course options for agriculture students in shs?",
                "What can I do with an agriculture background at KNUST?",
                "What are the available programmes for agriculture students at KNUST?",
                "What courses can agriculture students pursue at university?",
                "What programmes are there for agriculture students?",
                "What can I study at KNUST with a background in agriculture?",
                "What are the possible courses for an agriculture student in university?",
                "What programmes does KNUST offer for agriculture students?",
                "What are the study options for an agriculture student at KNUST?",
                "Which courses can I take if I studied agriculture in shs?",
                "What are the KNUST programmes for agriculture students?",
                "What university courses can I apply for with an agriculture background?",
                "Which programmes can I read with an agriculture background at KNUST?",
                "What courses are open to agriculture students at KNUST?",
                "What study options are there for agriculture students at university?",
                "What programmes can I pursue at KNUST with an agriculture background?",
                "What can an agriculture student read in university at KNUST?",
                "Which programmes at KNUST are available for agriculture students?",
                "What courses can an agriculture student apply for at KNUST?",
                "What are the academic options for agriculture students at KNUST?",
                "What can I study in university with an agriculture background?",
                "What programmes can an agriculture student choose at KNUST?",
                "What are the available university courses for agriculture students?",
                "What programmes can I enroll in at KNUST with an agriculture background?",
                "What can I pursue at KNUST with an agriculture background?",
                "What are the suitable university programmes for agriculture students?"
            ],
            "responses": [
                "With an agriculture background from SHS, you can pursue various programmes at KNUST, including but not limited to Agriculture, Agribusiness Management, and Agricultural Biotechnology. Please refer to the specific programme requirements for more details. Remember to consider your interests, career goals, and minimum aggregate when choosing a program. You can also explore other faculties like Natural Resources and Forest Resources Technology for potential options."
            ],
            "context_set": ""
        },


        {
            "tag": "shs_technical",
            "patterns": [
                "I studied technical in shs, what programmes can I read in KNUST?",
                "With a technical background in shs, what programmes are available for me?",
                "If I studied technical in shs, what can I read in university?",
                "What courses can I take at KNUST with a technical background?",
                "Which programmes are open to technical students in shs?",
                "What can I study at KNUST with a technical background?",
                "What programmes are available for technical students?",
                "What courses are available at KNUST for shs technical students?",
                "What university programmes can I pursue with a technical background?",
                "Which courses are suitable for a technical background?",
                "What programmes can I apply for with a technical background?",
                "What are my options at KNUST with a technical background?",
                "What can a technical student study in university?",
                "Which university programmes accept technical students?",
                "What are the course options for technical students in shs?",
                "What can I do with a technical background at KNUST?",
                "What are the available programmes for technical students at KNUST?",
                "What courses can technical students pursue at university?",
                "What programmes are there for technical students?",
                "What can I study at KNUST with a background in technical?",
                "What are the possible courses for a technical student in university?",
                "What programmes does KNUST offer for technical students?",
                "What are the study options for a technical student at KNUST?",
                "Which courses can I take if I studied technical in shs?",
                "What are the KNUST programmes for technical students?",
                "What university courses can I apply for with a technical background?",
                "Which programmes can I read with a technical background at KNUST?",
                "What courses are open to technical students at KNUST?",
                "What study options are there for technical students at university?",
                "What programmes can I pursue at KNUST with a technical background?",
                "What can a technical student read in university at KNUST?",
                "Which programmes at KNUST are available for technical students?",
                "What courses can a technical student apply for at KNUST?",
                "What are the academic options for technical students at KNUST?",
                "What can I study in university with a technical background?",
                "What programmes can a technical student choose at KNUST?",
                "What are the available university courses for technical students?",
                "What programmes can I enroll in at KNUST with a technical background?",
                "What can I pursue at KNUST with a technical background?",
                "What are the suitable university programmes for technical students?"
            ],
            "responses": [
                "With a technical background from SHS, you can pursue various programmes at KNUST, including but not limited to Engineering (Civil, Mechanical, Electrical, Computer, Aerospace), Architecture, Building Technology, Geomatic Engineering, and Materials Engineering. Please refer to the specific programme requirements for more details. Remember to consider your interests, career goals, and minimum aggregate when choosing a program. You can also explore other faculties like Planning and Land Economy for potential options."
            ],
            "context_set": ""
        }
    ]
}